{
  "version": "1.0",
  "courses": [
    {
      "title_ar": "التعلم الآلي",
      "title_en": "Machine Learning",
      "description_ar": "مقدمة شاملة في مجال التعلم الآلي، يغطي المفاهيم الأساسية، والخوارزميات، والتقنيات المستخدمة في بناء أنظمة تتعلم من البيانات دون برمجة صريحة. تتضمن المادة أنواع التعلم المختلفة (التعلم بالإشراف، التعلم غير الإشرافي، التعلم المعزز)، وخوارزميات التصنيف، والانحدار، والتجميع، وتقليل الأبعاد، وتقييم الأداء، والتطبيقات العملية للتعلم الآلي.",
      "description_en": "A practical, end‑to‑end introduction to supervised/unsupervised/reinforcement learning, model evaluation, and real-world ML workflows in Python.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في التعلم الآلي:",
          "items": [
            "مفهوم التعلم الآلي وأهميته في الذكاء الاصطناعي وعلوم البيانات.",
            "أنواع التعلم الآلي: التعلم بالإشراف، التعلم غير الإشرافي، التعلم المعزز.",
            "تطبيقات التعلم الآلي في مجالات مختلفة (الطب، الهندسة، الأعمال، التسويق، إلخ.).",
            "خطوات بناء نموذج تعلم آلي: جمع البيانات، معالجة البيانات، اختيار النموذج، التدريب، التقييم، النشر.",
            "تمارين: مناقشة تطبيقات التعلم الآلي، تحديد أنواع التعلم الآلي المناسبة لمشاكل مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "التعلم بالإشراف - الانحدار الخطي:",
          "items": [
            "مفهوم الانحدار الخطي البسيط والمتعدد.",
            "دالة التكلفة (Cost Function) وطريقة المربعات الصغرى (Least Squares).",
            "خوارزمية التدرج الهابط (Gradient Descent) لتدريب نموذج الانحدار الخطي.",
            "تقييم أداء نموذج الانحدار الخطي (R-squared, RMSE, MAE).",
            "تمارين: تطبيق الانحدار الخطي باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 3,
          "title": "التعلم بالإشراف - الانحدار اللوجستي:",
          "items": [
            "مفهوم التصنيف الثنائي والتصنيف المتعدد الفئات.",
            "الانحدار اللوجستي كخوارزمية تصنيف.",
            "دالة التكلفة للانحدار اللوجستي (Cross-Entropy Loss).",
            "تدريب نموذج الانحدار اللوجستي.",
            "تقييم أداء نموذج الانحدار اللوجستي (Accuracy, Precision, Recall, F1-score, AUC-ROC).",
            "تمارين: تطبيق الانحدار اللوجستي باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 4,
          "title": "التعلم بالإشراف - أشجار القرار:",
          "items": [
            "مفهوم أشجار القرار وكيفية عملها.",
            "خوارزميات بناء أشجار القرار (ID3, C4.5, CART).",
            "مزايا وعيوب أشجار القرار.",
            "تمارين: تطبيق أشجار القرار للتصنيف والانحدار باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 5,
          "title": "التعلم بالإشراف - الغابات العشوائية:",
          "items": [
            "مفهوم الغابات العشوائية كمجموعة من أشجار القرار.",
            "تقنية التجميع (Ensemble Learning) وتقنية الحقيبة (Bagging).",
            "مزايا وعيوب الغابات العشوائية.",
            "تمارين: تطبيق الغابات العشوائية للتصنيف والانحدار باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 6,
          "title": "التعلم بالإشراف - آلات الدعم المتجه:",
          "items": [
            "مفهوم آلات الدعم المتجه (Support Vector Machines - SVM).",
            "المصنفات الخطية وغير الخطية لـ SVM.",
            "النواة (Kernels) في SVM (الخطي، متعدد الحدود، الشعاعي).",
            "تمارين: تطبيق آلات الدعم المتجه للتصنيف باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 7,
          "title": "التعلم بالإشراف - الشبكات العصبية الاصطناعية (مقدمة):",
          "items": [
            "مقدمة في الشبكات العصبية الاصطناعية (Artificial Neural Networks - ANNs).",
            "الخلايا العصبية الاصطناعية (Neurons) والشبكات متعددة الطبقات (Multilayer Perceptrons - MLPs).",
            "دالة التنشيط (Activation Functions).",
            "التغذية الأمامية (Feedforward) والانتشار الخلفي (Backpropagation) (مقدمة).",
            "تمارين: بناء شبكة عصبية بسيطة باستخدام مكتبة Keras أو TensorFlow (مقدمة)."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في التعلم الآلي، التعلم بالإشراف - الانحدار الخطي، الانحدار اللوجستي، أشجار القرار، الغابات العشوائية، آلات الدعم المتجه، الشبكات العصبية الاصطناعية - مقدمة)."
          ]
        },
        {
          "week": 9,
          "title": "التعلم غير الإشرافي - التجميع:",
          "items": [
            "مفهوم التجميع (Clustering) وأهميته.",
            "خوارزمية K-Means للتجميع.",
            "خوارزميات التجميع الهرمي (Hierarchical Clustering).",
            "تقييم أداء التجميع (Silhouette Score, Davies-Bouldin Index).",
            "تمارين: تطبيق خوارزميات التجميع باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 10,
          "title": "التعلم غير الإشرافي - تقليل الأبعاد:",
          "items": [
            "مفهوم تقليل الأبعاد (Dimensionality Reduction) وأهميته.",
            "تحليل المكونات الرئيسية (Principal Component Analysis - PCA).",
            "تحليل المكونات المستقلة (Independent Component Analysis - ICA) (مقدمة).",
            "تمارين: تطبيق تقليل الأبعاد باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 11,
          "title": "التعلم المعزز (مقدمة):",
          "items": [
            "مقدمة في التعلم المعزز (Reinforcement Learning - RL).",
            "المفاهيم الأساسية في التعلم المعزز (الوكيل، البيئة، الحالة، الفعل، المكافأة).",
            "أنواع التعلم المعزز (القائم على القيمة، القائم على السياسة، القائم على النموذج).",
            "تمارين: مناقشة تطبيقات التعلم المعزز، فهم مفاهيم التعلم المعزز الأساسية."
          ]
        },
        {
          "week": 12,
          "title": "تقييم نماذج التعلم الآلي واختيار النموذج:",
          "items": [
            "طرق تقييم نماذج التعلم الآلي (مصفوفة الارتباك، الدقة، الاسترجاع، F1-score، AUC-ROC، R-squared، RMSE، MAE).",
            "التحقق المتقاطع (Cross-Validation).",
            "ضبط المعلمات الفائقة (Hyperparameter Tuning) (Grid Search, Random Search).",
            "اختيار النموذج الأفضل لمشكلة معينة.",
            "تمارين: تقييم نماذج تعلم آلي مختلفة ومقارنة أدائها، ضبط المعلمات الفائقة."
          ]
        },
        {
          "week": 13,
          "title": "معالجة البيانات وتجهيزها للتعلم الآلي:",
          "items": [
            "تنظيف البيانات (معالجة القيم المفقودة، القيم الشاذة).",
            "تحويل البيانات (Normalizing, Scaling, Encoding Categorical Features).",
            "تقسيم البيانات (Training Set, Validation Set, Test Set).",
            "تمارين: معالجة وتجهيز بيانات حقيقية لمشاريع التعلم الآلي."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة في التعلم الآلي (اختياري):",
          "items": [
            "التعلم الآلي العميق (Deep Learning) (مقدمة).",
            "التعلم الآلي الموزع (Distributed Machine Learning) (مقدمة).",
            "التعلم الآلي التفسيري (Explainable AI - XAI) (مقدمة).",
            "مناقشة مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في التعلم الآلي:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وخوارزميات التعلم الآلي على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والخوارزميات، والتقنيات، والتطبيقات العملية للتعلم الآلي."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام Python ومكتبات التعلم الآلي (scikit-learn, TensorFlow, Keras, PyTorch)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم التعلم الآلي وأنواعه المختلفة.",
        "تطبيق خوارزميات التعلم الآلي الأساسية (الانحدار، التصنيف، التجميع، تقليل الأبعاد).",
        "تقييم أداء نماذج التعلم الآلي واختيار النموذج الأنسب.",
        "معالجة البيانات وتجهيزها لتطبيق خوارزميات التعلم الآلي.",
        "تطبيق التعلم الآلي لحل مشاكل واقعية في مجالات مختلفة."
      ]
    },
    {
      "title_ar": "التعلم العميق",
      "title_en": "Deep Learning",
      "description_ar": "مقدمة متعمقة في مجال التعلم العميق، يركز على بناء وتدريب الشبكات العصبية العميقة. تغطي المادة أنواع الشبكات العصبية المختلفة (الشبكات العصبية التلافيفية، الشبكات العصبية المتكررة، المحولات)، وتقنيات التدريب المتقدمة، وتطبيقات التعلم العميق في مجالات مثل رؤية الحاسوب، ومعالجة اللغة الطبيعية، والتعرف على الصوت.",
      "description_en": "Hands-on deep learning with modern architectures (CNN, RNN, Transformers), training tricks, regularization, and applications in CV & NLP.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في التعلم العميق:",
          "items": [
            "مراجعة الشبكات العصبية الاصطناعية (ANNs) والشبكات متعددة الطبقات (MLPs).",
            "مفهوم التعلم العميق وأهميته.",
            "تاريخ وتطور التعلم العميق.",
            "مكتبات وأطر عمل التعلم العميق (TensorFlow, Keras, PyTorch).",
            "تمارين: تثبيت مكتبات التعلم العميق، بناء شبكة عصبية بسيطة باستخدام Keras."
          ]
        },
        {
          "week": 2,
          "title": "الشبكات العصبية التلافيفية (CNNs) - الطبقات التلافيفية والتجميعية:",
          "items": [
            "مقدمة في الشبكات العصبية التلافيفية (Convolutional Neural Networks - CNNs).",
            "الطبقات التلافيفية (Convolutional Layers) والمرشحات (Filters).",
            "طبقات التجميع (Pooling Layers) وأنواعها (Max Pooling, Average Pooling).",
            "بنية CNN الأساسية (Convolution - Pooling - Activation).",
            "تمارين: بناء CNN بسيطة لتصنيف الصور باستخدام Keras."
          ]
        },
        {
          "week": 3,
          "title": "الشبكات العصبية التلافيفية (CNNs) - معمارية CNN وتدريبها:",
          "items": [
            "معماريات CNN الشهيرة (LeNet-5, AlexNet, VGG, ResNet, Inception).",
            "دالة التنشيط ReLU وأنواعها المختلفة.",
            "تقنيات التسوية (Batch Normalization, Dropout).",
            "تدريب CNN باستخدام الانتشار الخلفي (Backpropagation) ومحسنات (Optimizers) مختلفة (Adam, SGD, RMSprop).",
            "تمارين: تدريب CNN على مجموعة بيانات صور (CIFAR-10, MNIST)."
          ]
        },
        {
          "week": 4,
          "title": "الشبكات العصبية التلافيفية (CNNs) - تطبيقات رؤية الحاسوب:",
          "items": [
            "تطبيقات CNN في رؤية الحاسوب: تصنيف الصور، الكشف عن الكائنات، تجزئة الصور.",
            "نقل التعلم (Transfer Learning) باستخدام نماذج CNN المدربة مسبقًا (ImageNet).",
            "ضبط دقيق (Fine-tuning) لنماذج CNN المدربة مسبقًا.",
            "تمارين: تطبيق نقل التعلم لتصنيف الصور باستخدام نماذج CNN المدربة مسبقًا."
          ]
        },
        {
          "week": 5,
          "title": "الشبكات العصبية المتكررة (RNNs) - الشبكات المتكررة الأساسية:",
          "items": [
            "مقدمة في الشبكات العصبية المتكررة (Recurrent Neural Networks - RNNs).",
            "مفهوم التسلسل الزمني (Sequential Data) والذاكرة في RNNs.",
            "بنية RNN الأساسية (الخلايا المتكررة، الحالات المخفية).",
            "مشكلة التدرج المتلاشي (Vanishing Gradient Problem) في RNNs.",
            "تمارين: بناء RNN بسيطة لتوقع التسلسلات الزمنية."
          ]
        },
        {
          "week": 6,
          "title": "الشبكات العصبية المتكررة (RNNs) - LSTM و GRU:",
          "items": [
            "الشبكات ذات الذاكرة طويلة المدى (Long Short-Term Memory Networks - LSTM).",
            "وحدات البوابة المتكررة (Gated Recurrent Units - GRU).",
            "معمارية LSTM و GRU وكيفية حل مشكلة التدرج المتلاشي.",
            "تطبيقات LSTM و GRU في معالجة اللغة الطبيعية (NLP) والتسلسلات الزمنية.",
            "تمارين: بناء LSTM أو GRU لتصنيف النصوص أو توقع التسلسلات الزمنية."
          ]
        },
        {
          "week": 7,
          "title": "الشبكات العصبية المتكررة (RNNs) - تطبيقات معالجة اللغة الطبيعية:",
          "items": [
            "تطبيقات RNN في معالجة اللغة الطبيعية (NLP): توليد النصوص، ترجمة الآلة، تحليل المشاعر.",
            "تضمين الكلمات (Word Embeddings) (Word2Vec, GloVe, FastText).",
            "نماذج تسلسل إلى تسلسل (Sequence-to-Sequence Models) باستخدام RNNs.",
            "تمارين: بناء نموذج ترجمة آلية بسيط باستخدام RNNs أو LSTM."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 مقدمة في التعلم العميق، CNNs - الطبقات التلافيفية والتجميعية، CNNs - معمارية CNN وتدريبها، CNNs - تطبيقات رؤية الحاسوب، RNNs - الشبكات المتكررة الأساسية، RNNs - LSTM و GRU، RNNs - تطبيقات معالجة اللغة الطبيعية."
          ]
        },
        {
          "week": 9,
          "title": "المحولات (Transformers) - آلية الانتباه الذاتي:",
          "items": [
            "مقدمة في المحولات (Transformers).",
            "آلية الانتباه الذاتي (Self-Attention Mechanism).",
            "بنية المحول (Encoders, Decoders).",
            "مزايا المحولات مقارنة بـ RNNs.",
            "تمارين: فهم آلية الانتباه الذاتي في المحولات."
          ]
        },
        {
          "week": 10,
          "title": "المحولات (Transformers) - تطبيقات المحولات:",
          "items": [
            "تطبيقات المحولات في معالجة اللغة الطبيعية (NLP): نماذج اللغة الكبيرة (BERT, GPT).",
            "المحولات في رؤية الحاسوب (Vision Transformers - ViT).",
            "نماذج المحولات متعددة الوسائط (Multimodal Transformers).",
            "تمارين: استخدام نماذج محولات مدربة مسبقًا (Hugging Face Transformers)."
          ]
        },
        {
          "week": 11,
          "title": "التعلم العميق التوليدي - الشبكات التوليدية الخصومية (GANs):",
          "items": [
            "مقدمة في التعلم العميق التوليدي (Generative Deep Learning).",
            "الشبكات التوليدية الخصومية (Generative Adversarial Networks - GANs).",
            "بنية GANs المولد، المميز.",
            "أنواع GANs المختلفة وتطبيقاتها (توليد الصور، توليد الفيديو، توليد البيانات الاصطناعية).",
            "تمارين: بناء GAN بسيطة لتوليد الصور (MNIST, Fashion-MNIST)."
          ]
        },
        {
          "week": 12,
          "title": "التعلم العميق التوليدي - المولدات التلقائية المشفرة المتغيرة (VAEs):",
          "items": [
            "المولدات التلقائية المشفرة المتغيرة (Variational Autoencoders - VAEs).",
            "الفرق بين VAEs و GANs.",
            "تطبيقات VAEs (توليد الصور، اكتشاف الشذوذ، تمثيل البيانات).",
            "تمارين: بناء VAE بسيطة لتوليد الصور."
          ]
        },
        {
          "week": 13,
          "title": "تفسيرية التعلم العميق (Explainable Deep Learning):",
          "items": [
            "أهمية تفسيرية نماذج التعلم العميق.",
            "تقنيات تفسيرية التعلم العميق (LIME, SHAP, Grad-CAM).",
            "تطبيقات تفسيرية التعلم العميق في مجالات مختلفة.",
            "تمارين: تطبيق تقنيات تفسيرية على نماذج تعلم عميق مدربة."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة في التعلم العميق (اختياري):",
          "items": [
            "التعلم العميق المعزز (Deep Reinforcement Learning).",
            "التعلم العميق الرسومي (Graph Deep Learning).",
            "التعلم العميق الموزع (Distributed Deep Learning).",
            "مناقشة مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في التعلم العميق:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وخوارزميات التعلم العميق على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والشبكات العصبية المختلفة، وتقنيات التدريب المتقدمة، والتطبيقات العملية للتعلم العميق."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام Python ومكتبات التعلم العميق (TensorFlow, Keras, PyTorch)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، قراءات من أحدث الأبحاث في مجال التعلم العميق.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم التعلم العميق وأنواعه المختلفة.",
        "بناء وتدريب الشبكات العصبية العميقة المختلفة (CNNs, RNNs, Transformers).",
        "تطبيق تقنيات التدريب المتقدمة لتحسين أداء نماذج التعلم العميق.",
        "تطبيق التعلم العميق لحل مشاكل واقعية في مجالات رؤية الحاسوب ومعالجة اللغة الطبيعية.",
        "فهم أساسيات تفسيرية نماذج التعلم العميق."
      ]
    },
    {
      "title_ar": "الذكاء الاصطناعي",
      "title_en": "Artificial Intelligence",
      "description_ar": "مقدمة شاملة في مجال الذكاء الاصطناعي، يغطي التاريخ، الفلسفة، المفاهيم الأساسية، والمجالات الفرعية للذكاء الاصطناعي. تتضمن المادة تمثيل المعرفة، البحث، المنطق، التعلم الآلي، معالجة اللغة الطبيعية، رؤية الحاسوب، الروبوتات، الأنظمة الخبيرة، والأخلاقيات والقضايا المجتمعية المتعلقة بالذكاء الاصطناعي.",
      "description_en": "Core AI concepts: search, knowledge representation, reasoning, learning, NLP, vision, robotics, and AI ethics.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في الذكاء الاصطناعي:",
          "items": [
            "مفهوم الذكاء الاصطناعي وتاريخه.",
            "فلسفة الذكاء الاصطناعي: هل يمكن للآلات أن تفكر؟ اختبار تورينج.",
            "أنواع الذكاء الاصطناعي: الذكاء الاصطناعي الضعيف والقوي والذكاء العام.",
            "مجالات الذكاء الاصطناعي وتطبيقاته المختلفة.",
            "تمارين: مناقشة تعريفات الذكاء الاصطناعي، تطبيقات الذكاء الاصطناعي في حياتنا اليومية."
          ]
        },
        {
          "week": 2,
          "title": "تمثيل المعرفة والبحث:",
          "items": [
            "تمثيل المعرفة: المنطق الاقتراحي، منطق الرتبة الأولى، الشبكات الدلالية، الأطر.",
            "استراتيجيات البحث: البحث غير الموجه (BFS, DFS)، البحث الموجه (A*).",
            "حل المشكلات باستخدام البحث.",
            "تمارين: تمثيل المعرفة لمشكلة بسيطة، تطبيق خوارزميات البحث لحل مسائل."
          ]
        },
        {
          "week": 3,
          "title": "المنطق والاستدلال:",
          "items": [
            "المنطق الاقتراحي ومنطق الرتبة الأولى.",
            "الاستدلال المنطقي: الاستدلال الأمامي والخلفي.",
            "أنظمة الاستدلال الآلي.",
            "تمارين: تطبيق قواعد الاستدلال المنطقي، بناء نظام استدلال بسيط."
          ]
        },
        {
          "week": 4,
          "title": "التعلم الآلي (مراجعة وتعميق):",
          "items": [
            "مراجعة أنواع التعلم الآلي (بالإشراف، غير الإشرافي، المعزز).",
            "خوارزميات التعلم الآلي الأساسية وتطبيقاتها (تصنيف، انحدار، تجميع).",
            "تقييم نماذج التعلم الآلي.",
            "تمارين: تطبيق خوارزميات تعلم آلي مختلفة على مسائل متنوعة باستخدام Python."
          ]
        },
        {
          "week": 5,
          "title": "معالجة اللغة الطبيعية (NLP) - مقدمة:",
          "items": [
            "مقدمة في معالجة اللغة الطبيعية (Natural Language Processing - NLP).",
            "مستويات تحليل اللغة (صرفي، نحوي، دلالي، تداولي).",
            "تطبيقات NLP: تحليل المشاعر، ترجمة الآلة، تلخيص النصوص، استخراج المعلومات.",
            "تمارين: تحليل نصوص بسيطة باستخدام أدوات NLP."
          ]
        },
        {
          "week": 6,
          "title": "معالجة اللغة الطبيعية (NLP) - تقنيات NLP:",
          "items": [
            "تقنيات NLP: ترميز النصوص، تضمين الكلمات، نماذج اللغة.",
            "الشبكات العصبية في NLP (RNNs, Transformers).",
            "أدوات ومكتبات NLP (NLTK, spaCy, Transformers library).",
            "تمارين: تطبيق تقنيات NLP لمعالجة النصوص باستخدام Python."
          ]
        },
        {
          "week": 7,
          "title": "رؤية الحاسوب (Computer Vision) - مقدمة:",
          "items": [
            "مقدمة في رؤية الحاسوب (Computer Vision).",
            "مهام رؤية الحاسوب: تصنيف الصور، الكشف عن الكائنات، تجزئة الصور، التعرف على الوجوه.",
            "تطبيقات رؤية الحاسوب: القيادة الذاتية، التعرف على الصور، تحليل الصور الطبية.",
            "تمارين: معالجة صور بسيطة باستخدام مكتبات رؤية الحاسوب."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في الذكاء الاصطناعي، تمثيل المعرفة والبحث، المنطق والاستدلال، التعلم الآلي - مراجعة وتعميق، معالجة اللغة الطبيعية - مقدمة وتقنيات، رؤية الحاسوب - مقدمة)."
          ]
        },
        {
          "week": 9,
          "title": "رؤية الحاسوب (Computer Vision) - تقنيات رؤية الحاسوب:",
          "items": [
            "تقنيات رؤية الحاسوب: معالجة الصور، استخراج الميزات، الشبكات العصبية التلافيفية (CNNs).",
            "معماريات CNN الشهيرة وتطبيقاتها في رؤية الحاسوب.",
            "أدوات ومكتبات رؤية الحاسوب (OpenCV, TensorFlow, PyTorch).",
            "تمارين: تطبيق تقنيات رؤية الحاسوب لتحليل الصور باستخدام Python."
          ]
        },
        {
          "week": 10,
          "title": "الروبوتات (Robotics) - مقدمة:",
          "items": [
            "مقدمة في الروبوتات.",
            "أنواع الروبوتات ومكوناتها (المستشعرات، المشغلات، المتحكمات).",
            "تطبيقات الروبوتات في الصناعة، الطب، الاستكشاف، الخدمات.",
            "تمارين: مناقشة أنواع الروبوتات وتطبيقاتها المختلفة."
          ]
        },
        {
          "week": 11,
          "title": "الروبوتات (Robotics) - الذكاء في الروبوتات:",
          "items": [
            "الذكاء الاصطناعي في الروبوتات: التخطيط، الملاحة، التحكم، التعلم.",
            "الرؤية الروبوتية ومعالجة اللغة في الروبوتات.",
            "الروبوتات المستقلة والروبوتات التعاونية.",
            "تمارين: تصميم نظام روبوت بسيط لحل مهمة محددة."
          ]
        },
        {
          "week": 12,
          "title": "الأنظمة الخبيرة (Expert Systems):",
          "items": [
            "مقدمة في الأنظمة الخبيرة.",
            "مكونات الأنظمة الخبيرة (قاعدة المعرفة، محرك الاستدلال، واجهة المستخدم).",
            "بناء الأنظمة الخبيرة وتطبيقاتها في مجالات مختلفة (الطب، الهندسة، القانون).",
            "تمارين: بناء نظام خبير بسيط لحل مشكلة محددة."
          ]
        },
        {
          "week": 13,
          "title": "الأخلاقيات والقضايا المجتمعية للذكاء الاصطناعي:",
          "items": [
            "الأخلاقيات في الذكاء الاصطناعي: التحيز، الشفافية، المساءلة، الخصوصية.",
            "تأثير الذكاء الاصطناعي على المجتمع والوظائف والاقتصاد.",
            "المستقبل المحتمل للذكاء الاصطناعي والمخاطر المحتملة.",
            "مناقشات: مناقشة قضايا أخلاقية ومجتمعية متعلقة بالذكاء الاصطناعي."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة في الذكاء الاصطناعي (اختياري):",
          "items": [
            "الذكاء الاصطناعي العام (Artificial General Intelligence - AGI) - مقدمة.",
            "الذكاء الاصطناعي فائق الذكاء (Artificial Superintelligence - ASI) - مقدمة.",
            "مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في الذكاء الاصطناعي:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وتقنيات الذكاء الاصطناعي على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والمجالات الفرعية للذكاء الاصطناعي، والتطبيقات، والأخلاقيات والقضايا المجتمعية."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، قراءات من مقالات وأبحاث في مجال الذكاء الاصطناعي، أفلام وثائقية.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم الذكاء الاصطناعي وتاريخه ومجالاته الفرعية.",
        "تطبيق تقنيات تمثيل المعرفة والبحث والمنطق والاستدلال.",
        "تطبيق خوارزميات التعلم الآلي الأساسية.",
        "فهم أساسيات معالجة اللغة الطبيعية ورؤية الحاسوب والروبوتات والأنظمة الخبيرة.",
        "تحليل وتقييم القضايا الأخلاقية والمجتمعية المتعلقة بالذكاء الاصطناعي."
      ]
    },
    {
      "title_ar": "الشبكات العصبية",
      "title_en": "Neural Networks",
      "description_ar": "مادة متخصصة في الشبكات العصبية، تركز على الجوانب النظرية والعملية للشبكات العصبية الاصطناعية. تغطي المادة أنواع الشبكات العصبية المختلفة (الشبكات العصبية التلافيفية، الشبكات العصبية المتكررة، الشبكات المولدة)، وتقنيات التدريب، ومعمارية الشبكات، وتطبيقات الشبكات العصبية في مجالات متنوعة.",
      "description_en": "Foundations of neural networks: perceptrons, backpropagation, optimization, regularization, and building networks for regression/classification.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في الشبكات العصبية:",
          "items": [
            "مقدمة تاريخية للشبكات العصبية.",
            "الأساس البيولوجي للشبكات العصبية الاصطناعية.",
            "الخلايا العصبية الاصطناعية (Neurons) ودوال التنشيط (Activation Functions).",
            "أنواع الشبكات العصبية: التغذية الأمامية، المتكررة، التلافيفية، المولدة.",
            "تمارين: تصميم خلية عصبية بسيطة، استكشاف دوال التنشيط المختلفة."
          ]
        },
        {
          "week": 2,
          "title": "الشبكات العصبية ذات التغذية الأمامية (Feedforward Neural Networks - FFNNs):",
          "items": [
            "بنية الشبكات العصبية ذات التغذية الأمامية (Multilayer Perceptrons - MLPs).",
            "التغذية الأمامية (Feedforward) والانتشار الخلفي (Backpropagation) بالتفصيل.",
            "دالة التكلفة (Cost Function) ومحسنات (Optimizers) التدريب.",
            "تمارين: بناء وتدريب شبكة عصبية ذات تغذية أمامية لتصنيف البيانات باستخدام Keras أو PyTorch."
          ]
        },
        {
          "week": 3,
          "title": "تقنيات التدريب المتقدمة للشبكات العصبية:",
          "items": [
            "تقنيات التسوية (Regularization): L1, L2 regularization, Dropout.",
            "التسوية بالدفعات (Batch Normalization).",
            "محسنات التدريب المتقدمة (Adam, RMSprop, Adagrad).",
            "معدل التعلم (Learning Rate) وجدولة معدل التعلم (Learning Rate Scheduling).",
            "تمارين: تطبيق تقنيات التدريب المتقدمة لتحسين أداء الشبكات العصبية."
          ]
        },
        {
          "week": 4,
          "title": "الشبكات العصبية التلافيفية (CNNs) - بالتفصيل:",
          "items": [
            "مراجعة الشبكات العصبية التلافيفية (CNNs) وبنيتها.",
            "الطبقات التلافيفية (Convolutional Layers) والمرشحات (Filters) بالتفصيل.",
            "طبقات التجميع (Pooling Layers) وأنواعها.",
            "معماريات CNN الشهيرة وتحليلها (LeNet-5, AlexNet, VGG, ResNet, Inception).",
            "تمارين: بناء وتدريب CNN معمارية متقدمة لتصنيف الصور."
          ]
        },
        {
          "week": 5,
          "title": "الشبكات العصبية التلافيفية (CNNs) - تطبيقات متقدمة:",
          "items": [
            "الكشف عن الكائنات (Object Detection) باستخدام CNNs (R-CNN, Fast R-CNN, YOLO, SSD).",
            "تجزئة الصور (Image Segmentation) باستخدام CNNs (FCN, U-Net).",
            "تطبيقات CNNs في رؤية الحاسوب الطبي (تحليل الصور الطبية).",
            "تمارين: تطبيق CNNs للكشف عن الكائنات أو تجزئة الصور."
          ]
        },
        {
          "week": 6,
          "title": "الشبكات العصبية المتكررة (RNNs) - بالتفصيل:",
          "items": [
            "مراجعة الشبكات العصبية المتكررة (RNNs) وبنيتها.",
            "الشبكات ذات الذاكرة طويلة المدى (LSTM) ووحدات البوابة المتكررة (GRU) بالتفصيل.",
            "مشكلة التدرج المتلاشي (Vanishing Gradient Problem) وحلولها.",
            "معماريات RNNs المختلفة (Bidirectional RNNs, Stacked RNNs).",
            "تمارين: بناء وتدريب RNN أو LSTM لتوقع التسلسلات الزمنية أو تصنيف النصوص."
          ]
        },
        {
          "week": 7,
          "title": "الشبكات العصبية المتكررة (RNNs) - تطبيقات متقدمة:",
          "items": [
            "توليد النصوص (Text Generation) باستخدام RNNs.",
            "ترجمة الآلة (Machine Translation) باستخدام RNNs (نماذج تسلسل إلى تسلسل).",
            "تحليل المشاعر (Sentiment Analysis) باستخدام RNNs.",
            "تمارين: بناء نموذج توليد نصوص بسيط باستخدام RNNs أو LSTM."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 مقدمة في الشبكات العصبية، FFNNs، تقنيات التدريب المتقدمة، CNNs - بالتفصيل، CNNs - تطبيقات متقدمة، RNNs - بالتفصيل، RNNs - تطبيقات متقدمة."
          ]
        },
        {
          "week": 9,
          "title": "الشبكات المولدة (Generative Networks) - الشبكات التوليدية الخصومية (GANs) بالتفصيل:",
          "items": [
            "مراجعة الشبكات التوليدية الخصومية (GANs) وبنيتها (المولد، المميز).",
            "أنواع GANs المختلفة (DCGAN, Conditional GAN, CycleGAN).",
            "تحديات تدريب GANs وتقنيات الاستقرار.",
            "تمارين: بناء وتدريب GAN معمارية متقدمة لتوليد الصور."
          ]
        },
        {
          "week": 10,
          "title": "الشبكات المولدة (Generative Networks) - المولدات التلقائية المشفرة المتغيرة (VAEs) بالتفصيل:",
          "items": [
            "مراجعة المولدات التلقائية المشفرة المتغيرة (VAEs) وبنيتها.",
            "الأساس الرياضي لـ VAEs (الاستدلال المتغير، دالة الخسارة).",
            "أنواع VAEs المختلفة (Conditional VAE, β-VAE).",
            "تمارين: بناء وتدريب VAE معمارية متقدمة لتوليد الصور."
          ]
        },
        {
          "week": 11,
          "title": "معمارية الشبكات العصبية (Neural Network Architectures) - تصميم المعمارية:",
          "items": [
            "مبادئ تصميم معمارية الشبكات العصبية.",
            "اختيار عدد الطبقات والخلايا العصبية ودوال التنشيط.",
            "تقنيات البحث عن المعمارية (Neural Architecture Search - NAS) - مقدمة.",
            "تمارين: تصميم معمارية شبكة عصبية لمشكلة محددة."
          ]
        },
        {
          "week": 12,
          "title": "تفسيرية الشبكات العصبية (Explainability of Neural Networks):",
          "items": [
            "أهمية تفسيرية الشبكات العصبية.",
            "تقنيات تفسيرية الشبكات العصبية (LIME, SHAP, Grad-CAM) بالتفصيل.",
            "تطبيقات تفسيرية الشبكات العصبية في مجالات حساسة (الطب، التمويل).",
            "تمارين: تطبيق تقنيات تفسيرية على نماذج شبكات عصبية مدربة."
          ]
        },
        {
          "week": 13,
          "title": "تحسين أداء الشبكات العصبية (Performance Optimization):",
          "items": [
            "تحسين أداء الشبكات العصبية: ضبط المعلمات الفائقة (Hyperparameter Tuning).",
            "تقنيات تسريع التدريب والاستدلال (GPU acceleration, quantization, pruning).",
            "التعامل مع البيانات الكبيرة في تدريب الشبكات العصبية.",
            "تمارين: تحسين أداء شبكة عصبية باستخدام تقنيات مختلفة."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة للشبكات العصبية (اختياري):",
          "items": [
            "الشبكات العصبية الرسومية (Graph Neural Networks - GNNs) - مقدمة.",
            "الشبكات العصبية العصبية (Spiking Neural Networks - SNNs) - مقدمة.",
            "الشبكات العصبية في الأجهزة الطرفية (Edge AI) - مقدمة.",
            "مناقشة مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في الشبكات العصبية:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وتقنيات الشبكات العصبية على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، وأنواع الشبكات العصبية المختلفة، وتقنيات التدريب المتقدمة، والمعمارية، والتطبيقات العملية للشبكات العصبية."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية متعمقة، تمارين عملية مكثفة باستخدام Python ومكتبات الشبكات العصبية (TensorFlow, Keras, PyTorch)، مشاريع تطبيقية متقدمة، مناقشات جماعية، دراسات حالة من أحدث الأبحاث في مجال الشبكات العصبية، قراءات بحثية.",
      "outcomes_ar": [
        "فهم متعمق للأسس النظرية للشبكات العصبية وأنواعها المختلفة.",
        "تصميم وبناء وتدريب الشبكات العصبية المختلفة (FFNNs, CNNs, RNNs, GANs, VAEs).",
        "تطبيق تقنيات التدريب المتقدمة لتحسين أداء الشبكات العصبية.",
        "تطبيق الشبكات العصبية لحل مشاكل معقدة في مجالات متنوعة (رؤية الحاسوب، معالجة اللغة الطبيعية، توليد البيانات).",
        "فهم أساسيات تفسيرية الشبكات العصبية وتحسين أدائها."
      ]
    },
    {
      "title_ar": "أنظمة دعم القرار",
      "title_en": "Decision Support Systems",
      "description_ar": "مقدمة شاملة في مجال أنظمة دعم القرار، يغطي المفاهيم الأساسية، الأنواع، المكونات، ومنهجيات التطوير لأنظمة دعم القرار. تتضمن المادة نماذج القرار، تقنيات التحليل، واجهات المستخدم، تطبيقات أنظمة دعم القرار في مجالات الأعمال والإدارة والصناعة والطب.",
      "description_en": "Designing DSS: data pipelines, models, dashboards, multicriteria decision making, and deploying decision solutions for organizations.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في أنظمة دعم القرار:",
          "items": [
            "مفهوم أنظمة دعم القرار (Decision Support Systems - DSS) وأهميتها.",
            "تطور أنظمة دعم القرار وتصنيفاتها.",
            "أنواع القرارات: القرارات المهيكلة، شبه المهيكلة، غير المهيكلة.",
            "علاقة DSS بنظم المعلومات الإدارية (MIS) ونظم المعلومات التنفيذية (EIS).",
            "تمارين: مناقشة أمثلة لأنظمة دعم القرار في مجالات مختلفة، تحديد أنواع القرارات التي تدعمها DSS."
          ]
        },
        {
          "week": 2,
          "title": "أنواع أنظمة دعم القرار:",
          "items": [
            "أنظمة دعم القرار التشغيلية (Operational DSS).",
            "أنظمة دعم القرار الإدارية (Managerial DSS).",
            "أنظمة دعم القرار الاستراتيجية (Strategic DSS).",
            "أنظمة دعم القرار الجماعية (Group DSS).",
            "أنظمة دعم القرار الذكية (Intelligent DSS).",
            "تمارين: تحليل أنواع مختلفة من DSS وتحديد خصائص كل نوع."
          ]
        },
        {
          "week": 3,
          "title": "مكونات أنظمة دعم القرار:",
          "items": [
            "قاعدة البيانات (Database).",
            "قاعدة النماذج (Model Base).",
            "نظام إدارة الحوار (Dialog Management System) أو واجهة المستخدم (User Interface).",
            "محرك المعرفة (Knowledge Engine) (في الأنظمة الذكية).",
            "تمارين: تصميم هيكل نظام دعم قرار بسيط، تحديد مكونات كل جزء."
          ]
        },
        {
          "week": 4,
          "title": "نماذج القرار في أنظمة دعم القرار:",
          "items": [
            "نماذج رياضية وإحصائية للقرارات.",
            "نماذج الأمثلية (Optimization Models).",
            "نماذج المحاكاة (Simulation Models).",
            "نماذج التنبؤ (Forecasting Models).",
            "نماذج متعددة المعايير (Multi-Criteria Decision Making - MCDM).",
            "تمارين: تطبيق نماذج قرار بسيطة لحل مسائل باستخدام برامج جاهزة (Excel Solver, Python libraries)."
          ]
        },
        {
          "week": 5,
          "title": "تقنيات التحليل في أنظمة دعم القرار:",
          "items": [
            "تحليل الحساسية (Sensitivity Analysis).",
            "تحليل السيناريوهات (Scenario Analysis).",
            "تحليل ماذا-لو (What-If Analysis).",
            "تحليل الهدف (Goal Seeking Analysis).",
            "التنقيب في البيانات (Data Mining) واستخراج المعرفة.",
            "تمارين: تطبيق تقنيات التحليل على نماذج قرار باستخدام برامج DSS."
          ]
        },
        {
          "week": 6,
          "title": "واجهات المستخدم في أنظمة دعم القرار:",
          "items": [
            "مبادئ تصميم واجهات المستخدم الفعالة لـ DSS.",
            "أنواع واجهات المستخدم (GUI, Web-based, Mobile).",
            "تصميم التفاعلات بين المستخدم والنظام.",
            "تصور البيانات (Data Visualization) في DSS.",
            "تمارين: تصميم واجهة مستخدم لنظام دعم قرار مقترح."
          ]
        },
        {
          "week": 7,
          "title": "تطوير أنظمة دعم القرار - منهجيات التطوير:",
          "items": [
            "منهجيات تطوير أنظمة المعلومات بشكل عام.",
            "منهجيات تطوير DSS الخاصة (Rapid Prototyping, Agile Development).",
            "دورة حياة تطوير نظام دعم القرار.",
            "أدوات تطوير DSS (DSS Development Tools).",
            "تمارين: تخطيط دورة حياة تطوير نظام دعم قرار لمشروع معين."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 مقدمة في DSS، أنواع DSS، مكونات DSS، نماذج القرار، تقنيات التحليل، واجهات المستخدم، منهجيات التطوير."
          ]
        },
        {
          "week": 9,
          "title": "تطوير أنظمة دعم القرار - بناء النماذج وقواعد البيانات:",
          "items": [
            "بناء نماذج القرار باستخدام برامج النمذجة.",
            "تصميم قواعد البيانات لـ DSS.",
            "ربط النماذج بقواعد البيانات.",
            "اعتبارات الأداء والكفاءة في بناء DSS.",
            "تمارين: بناء نموذج قرار بسيط وربطه بقاعدة بيانات باستخدام أدوات تطوير DSS."
          ]
        },
        {
          "week": 10,
          "title": "تطوير أنظمة دعم القرار - تصميم واجهة المستخدم والتكامل:",
          "items": [
            "تنفيذ واجهة المستخدم المصممة.",
            "اختبار واجهة المستخدم وقابلية الاستخدام.",
            "تكامل DSS مع نظم المعلومات الأخرى في المؤسسة.",
            "اعتبارات الأمان والوصول في DSS.",
            "تمارين: تطوير واجهة مستخدم لنظام دعم قرار، اختبار قابلية الاستخدام."
          ]
        },
        {
          "week": 11,
          "title": "تطبيقات أنظمة دعم القرار في الأعمال والإدارة:",
          "items": [
            "DSS في التسويق والمبيعات.",
            "DSS في التمويل والمحاسبة.",
            "DSS في إدارة الموارد البشرية.",
            "DSS في إدارة سلسلة التوريد.",
            "دراسات حالة: أمثلة واقعية لتطبيقات DSS في الأعمال والإدارة."
          ]
        },
        {
          "week": 12,
          "title": "تطبيقات أنظمة دعم القرار في الصناعة والهندسة:",
          "items": [
            "DSS في التخطيط والجدولة الصناعية.",
            "DSS في إدارة المشاريع الهندسية.",
            "DSS في التحكم بالعمليات الصناعية.",
            "DSS في الصيانة التنبؤية.",
            "دراسات حالة: أمثلة واقعية لتطبيقات DSS في الصناعة والهندسة."
          ]
        },
        {
          "week": 13,
          "title": "تطبيقات أنظمة دعم القرار في الطب والرعاية الصحية:",
          "items": [
            "DSS في التشخيص الطبي.",
            "DSS في التخطيط العلاجي.",
            "DSS في إدارة المستشفيات والموارد الصحية.",
            "DSS في دعم القرارات للمرضى.",
            "دراسات حالة: أمثلة واقعية لتطبيقات DSS في الطب والرعاية الصحية."
          ]
        },
        {
          "week": 14,
          "title": "قضايا متقدمة في أنظمة دعم القرار (اختياري):",
          "items": [
            "DSS القائمة على الذكاء الاصطناعي والتعلم الآلي.",
            "DSS السحابية والمتنقلة.",
            "DSS التحليلية الكبيرة (Big Data DSS).",
            "الأخلاقيات والقضايا الاجتماعية في استخدام DSS.",
            "مناقشة مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في أنظمة دعم القرار:",
          "items": [
            "يقوم الطلاب بتصميم وتطوير نظام دعم قرار بسيط لمشكلة واقعية.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، وأنواع DSS، المكونات، النماذج، التقنيات، منهجيات التطوير، والتطبيقات العملية لـ DSS."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، زيارات ميدانية لمؤسسات تستخدم DSS (إذا أمكن)، استخدام برامج DSS جاهزة وأدوات تطوير DSS.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم أنظمة دعم القرار وأنواعها ومكوناتها.",
        "تطبيق نماذج وتقنيات التحليل في سياق DSS.",
        "تصميم وتطوير أنظمة دعم قرار بسيطة.",
        "تقييم واجهات المستخدم في DSS.",
        "تطبيق DSS لحل مشاكل واقعية في مجالات الأعمال والإدارة والصناعة والطب."
      ]
    },
    {
      "title_ar": "منهجية البحث",
      "title_en": "Research Methodology",
      "description_ar": "مقدمة شاملة في منهجية البحث العلمي، يغطي أنواع البحوث، تصميم البحوث، جمع البيانات، تحليل البيانات، كتابة التقارير والرسائل العلمية، وأخلاقيات البحث. تهدف المادة إلى تزويد الطلاب بالمهارات اللازمة لإجراء بحوث علمية منهجية في مختلف المجالات.",
      "description_en": "How to do solid research: problem formulation, literature review, methodology design, experiments, reporting, and academic writing.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في البحث العلمي:",
          "items": [
            "مفهوم البحث العلمي وأهميته.",
            "أنواع البحوث: البحوث الأساسية والتطبيقية، البحوث الكمية والنوعية، البحوث الوصفية والتحليلية والتجريبية.",
            "خصائص البحث العلمي الجيد: الموضوعية، الدقة، الصدق، الثبات، القابلية للتعميم.",
            "أخلاقيات البحث العلمي.",
            "تمارين: مناقشة أمثلة لأنواع البحوث المختلفة، تحديد خصائص البحث العلمي الجيد في أمثلة."
          ]
        },
        {
          "week": 2,
          "title": "تحديد مشكلة البحث وصياغة الأسئلة والفرضيات:",
          "items": [
            "تحديد مشكلة البحث: مصادر المشكلات البحثية، معايير اختيار المشكلة البحثية.",
            "صياغة أسئلة البحث.",
            "صياغة الفرضيات البحثية: أنواع الفرضيات، خصائص الفرضية الجيدة.",
            "المتغيرات في البحث العلمي: المتغير المستقل، المتغير التابع، المتغيرات الضابطة والدخيلة.",
            "تمارين: تحديد مشكلات بحثية محتملة في مجالات مختلفة، صياغة أسئلة وفرضيات بحثية لمشكلات محددة."
          ]
        },
        {
          "week": 3,
          "title": "مراجعة الأدبيات والدراسات السابقة:",
          "items": [
            "أهمية مراجعة الأدبيات والدراسات السابقة.",
            "مصادر الأدبيات والدراسات السابقة (قواعد البيانات العلمية، المكتبات الرقمية، المجلات العلمية، المؤتمرات).",
            "تقنيات البحث عن الأدبيات والدراسات السابقة.",
            "تقييم الأدبيات والدراسات السابقة وتلخيصها.",
            "تمارين: البحث عن أدبيات ودراسات سابقة في موضوع بحثي محدد، تقييم وتلخيص المقالات العلمية."
          ]
        },
        {
          "week": 4,
          "title": "تصميم البحوث الكمية:",
          "items": [
            "تصميم البحوث الوصفية (المسحية، دراسة الحالة، الارتباطية).",
            "تصميم البحوث التجريبية (التجارب المعملية والميدانية، التصميمات التجريبية).",
            "تصميم البحوث شبه التجريبية.",
            "اختيار تصميم البحث المناسب لسؤال البحث.",
            "تمارين: تصميم بحث كمي لمشكلة بحثية محددة، تحديد نوع التصميم المناسب."
          ]
        },
        {
          "week": 5,
          "title": "تصميم البحوث النوعية:",
          "items": [
            "تصميم البحوث الإثنوغرافية.",
            "تصميم البحوث الظاهراتية.",
            "تصميم البحوث النظرية المجذرة.",
            "تصميم البحوث السردية.",
            "اختيار تصميم البحث النوعي المناسب لسؤال البحث.",
            "تمارين: تصميم بحث نوعي لمشكلة بحثية محددة، تحديد نوع التصميم المناسب."
          ]
        },
        {
          "week": 6,
          "title": "جمع البيانات الكمية:",
          "items": [
            "أدوات جمع البيانات الكمية: الاستبيانات، الاختبارات، الملاحظة المنظمة، البيانات الثانوية.",
            "تصميم الاستبيانات والاختبارات.",
            "إجراء المسح الميداني وجمع البيانات.",
            "التحقق من جودة البيانات الكمية (الصدق والثبات).",
            "تمارين: تصميم استبيان لجمع بيانات كمية، تطبيق الاستبيان على عينة صغيرة."
          ]
        },
        {
          "week": 7,
          "title": "جمع البيانات النوعية:",
          "items": [
            "أدوات جمع البيانات النوعية: المقابلات المتعمقة، مجموعات التركيز، الملاحظة بالمشاركة، تحليل الوثائق.",
            "إجراء المقابلات ومجموعات التركيز.",
            "إجراء الملاحظة بالمشاركة.",
            "تحليل الوثائق والمواد النوعية.",
            "التحقق من جودة البيانات النوعية (المصداقية، القابلية للتحويل، الاعتمادية، التأكيدية).",
            "تمارين: إجراء مقابلة نوعية بسيطة، تحليل وثيقة نوعية."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في البحث العلمي، تحديد مشكلة البحث، مراجعة الأدبيات، تصميم البحوث الكمية والنوعية، جمع البيانات الكمية والنوعية)."
          ]
        },
        {
          "week": 9,
          "title": "تحليل البيانات الكمية - الإحصاء الوصفي:",
          "items": [
            "الإحصاء الوصفي: مقاييس النزعة المركزية (المتوسط، الوسيط، المنوال)، مقاييس التشتت (الانحراف المعياري، التباين، المدى).",
            "الجداول والرسوم البيانية الإحصائية (الأعمدة، الدائرية، الخطية، المدرجات التكرارية).",
            "استخدام برامج التحليل الإحصائي (SPSS, R, Python libraries).",
            "تمارين: تحليل بيانات كمية باستخدام الإحصاء الوصفي وبرامج التحليل الإحصائي."
          ]
        },
        {
          "week": 10,
          "title": "تحليل البيانات الكمية - الإحصاء الاستدلالي:",
          "items": [
            "الإحصاء الاستدلالي: اختبار الفرضيات، اختبارات الفروق (t-test, ANOVA)، اختبارات الارتباط (Correlation, Regression).",
            "مستوى الدلالة الإحصائية (p-value) وحجم التأثير.",
            "تفسير نتائج التحليل الإحصائي.",
            "تمارين: تحليل بيانات كمية باستخدام الإحصاء الاستدلالي وبرامج التحليل الإحصائي، تفسير النتائج."
          ]
        },
        {
          "week": 11,
          "title": "تحليل البيانات النوعية:",
          "items": [
            "تحليل المحتوى (Content Analysis).",
            "التحليل الموضوعي (Thematic Analysis).",
            "التحليل السردي (Narrative Analysis).",
            "استخدام برامج تحليل البيانات النوعية (NVivo, Atlas.ti).",
            "تمارين: تحليل بيانات نوعية باستخدام طرق التحليل المختلفة وبرامج التحليل النوعي."
          ]
        },
        {
          "week": 12,
          "title": "كتابة تقارير البحث والرسائل العلمية:",
          "items": [
            "هيكل تقرير البحث والرسالة العلمية (المقدمة، الأدبيات، المنهجية، النتائج، المناقشة، الخاتمة، المراجع).",
            "أسلوب الكتابة العلمية: الوضوح، الدقة، الموضوعية، الإيجاز.",
            "توثيق المصادر والمراجع (نظام APA أو غيره).",
            "تمارين: كتابة أجزاء من تقرير بحث أو رسالة علمية (مقدمة، منهجية، نتائج)."
          ]
        },
        {
          "week": 13,
          "title": "عرض نتائج البحث والمناقشة:",
          "items": [
            "إعداد العروض التقديمية لنتائج البحث.",
            "مهارات العرض الفعال.",
            "المشاركة في المناقشات العلمية والندوات والمؤتمرات.",
            "تمارين: تقديم عرض تقديمي موجز لنتائج بحث، المشاركة في مناقشة علمية."
          ]
        },
        {
          "week": 14,
          "title": "أخلاقيات البحث العلمي بالتفصيل:",
          "items": [
            "مراجعة أخلاقيات البحث العلمي.",
            "الأمانة العلمية والنزاهة.",
            "حقوق الملكية الفكرية والاقتباس.",
            "مراجعة الأقران (Peer Review) وأخلاقياتها.",
            "قضايا أخلاقية معاصرة في البحث العلمي (البحث على الإنترنت، البحث في مجالات حساسة).",
            "مناقشات: مناقشة حالات وقضايا أخلاقية في البحث العلمي."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في منهجية البحث:",
          "items": [
            "يقوم الطلاب بتطبيق منهجية البحث العلمي في مشروع بحثي صغير.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، وأنواع البحوث، تصميم البحوث، جمع البيانات، تحليل البيانات، كتابة التقارير، وأخلاقيات البحث."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، ورش عمل في استخدام برامج التحليل الإحصائي والنوعي، عروض تقديمية للطلاب.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم البحث العلمي وأنواعه وتصميماته.",
        "تحديد مشكلات البحث وصياغة الأسئلة والفرضيات.",
        "مراجعة الأدبيات والدراسات السابقة بشكل فعال.",
        "جمع البيانات الكمية والنوعية باستخدام الأدوات المناسبة.",
        "تحليل البيانات الكمية والنوعية باستخدام الأساليب المناسبة وبرامج التحليل.",
        "كتابة تقارير البحث والرسائل العلمية بأسلوب علمي ومنهجي.",
        "عرض نتائج البحث والمشاركة في المناقشات العلمية.",
        "الالتزام بأخلاقيات البحث العلمي."
      ]
    },
    {
      "title_ar": "السمينار",
      "title_en": "Seminar",
      "description_ar": "مادة تفاعلية تركز على تطوير مهارات العرض والمناقشة والبحث الذاتي لدى الطلاب. يتمحور السمينار حول مواضيع متقدمة في مجال التخصص، حيث يقوم الطلاب بتقديم عروض حول مواضيع مختارة، ومناقشة الأبحاث الحديثة، واستضافة متحدثين ضيوف، وتنظيم ورش عمل. يهدف السمينار إلى تعزيز التفكير النقدي ومهارات التواصل العلمي لدى الطلاب.",
      "description_en": "Student-led seminar course to present, critique, and discuss recent research papers and emerging topics with structured feedback.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في السمينار وأهدافه:",
          "items": [
            "تعريف السمينار وأهدافه ومخرجاته المتوقعة.",
            "شرح طبيعة المادة التفاعلية وأهمية المشاركة الفعالة.",
            "توزيع المواضيع المقترحة للعروض الطلابية أو تحديد مجالات الاهتمام.",
            "تحديد معايير التقييم للعروض والمشاركة في المناقشات.",
            "تمارين: مناقشة توقعات الطلاب من السمينار، اقتراح مواضيع محتملة للعروض."
          ]
        },
        {
          "week": 2,
          "title": "مهارات البحث والعرض العلمي - الجزء الأول:",
          "items": [
            "مهارات البحث الفعال عن المصادر العلمية الموثوقة (قواعد البيانات، المكتبات الرقمية، المجلات العلمية).",
            "تقنيات تقييم المصادر العلمية واختيار الأنسب.",
            "مبادئ العرض العلمي الفعال: التنظيم، الوضوح، الإيجاز، استخدام الوسائل البصرية.",
            "تمارين: ورشة عمل في البحث عن المصادر العلمية، تدريب على تصميم شرائح عرض تقديمية فعالة."
          ]
        },
        {
          "week": 3,
          "title": "مهارات البحث والعرض العلمي - الجزء الثاني:",
          "items": [
            "مهارات كتابة ملخصات وتقارير علمية موجزة.",
            "مهارات الإلقاء والتواصل غير اللفظي في العروض التقديمية.",
            "تقنيات التعامل مع الأسئلة والاستفسارات أثناء العروض.",
            "التدرب على تقديم عروض قصيرة (5 دقائق) وتقييمها.",
            "تمارين: تدريب على الإلقاء والتعامل مع الأسئلة، تقديم عروض قصيرة وتقييم الأداء.",
            "الأسبوع 4-7: عروض الطلاب - المجموعة الأولى:",
            "كل أسبوع، تقوم مجموعة من الطلاب (2-3 طلاب في المجموعة) بتقديم عروضهم حول المواضيع المختارة.",
            "بعد كل عرض، يتم فتح باب المناقشة للطلاب والمحاضر لطرح الأسئلة والتعليقات.",
            "يتم تقييم العروض من قبل المحاضر والطلاب المشاركين بناءً على معايير التقييم المتفق عليها.",
            "يتم تخصيص وقت في نهاية كل أسبوع لتقديم تغذية راجعة عامة حول العروض المقدمة."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي - تقييم المشاركة والعروض:",
          "items": [
            "لا يوجد امتحان نصفي تقليدي.",
            "التقييم النصفي يعتمد على تقييم مشاركة الطلاب في المناقشات خلال الأسابيع 4-7.",
            "تقييم جودة العروض التقديمية للمجموعة الأولى من الطلاب (الأسابيع 4-7).",
            "تقديم ملاحظات فردية للطلاب حول أدائهم في العروض والمشاركة."
          ]
        },
        {
          "week": 9,
          "title": "استضافة متحدث ضيف - محاضرة أو ورشة عمل:",
          "items": [
            "دعوة متحدث ضيف متخصص في مجال ذي صلة بمواضيع السمينار.",
            "يمكن أن يكون المتحدث من الأكاديميين أو الصناعة أو الخبراء في مجال معين.",
            "يقوم المتحدث بتقديم محاضرة أو ورشة عمل تفاعلية للطلاب.",
            "يتم تخصيص وقت في نهاية المحاضرة أو الورشة لفتح باب الأسئلة والنقاش مع المتحدث.",
            "الأسبوع 10-13: عروض الطلاب - المجموعة الثانية:",
            "تستمر عروض الطلاب في المجموعة الثانية بنفس أسلوب الأسابيع 4-7.",
            "يتم تقديم عروض من مجموعات طلابية أخرى حول مواضيع مختلفة.",
            "تستمر المناقشات والتقييمات بعد كل عرض.",
            "يتم تخصيص وقت للتغذية الراجعة العامة في نهاية كل أسبوع."
          ]
        },
        {
          "week": 14,
          "title": "ورشة عمل متقدمة في مهارات البحث أو العرض (اختياري):",
          "items": [
            "تنظيم ورشة عمل متقدمة تركز على مهارة معينة ذات صلة بالبحث أو العرض العلمي.",
            "يمكن أن تكون الورشة حول: كتابة المقترحات البحثية، تصميم الملصقات العلمية، استخدام برامج إدارة المراجع، مهارات التواصل العلمي المتقدمة، إلخ.",
            "يمكن دعوة مدرب متخصص لتقديم ورشة العمل."
          ]
        },
        {
          "week": 15,
          "title": "جلسة ختامية ومناقشة عامة:",
          "items": [
            "جلسة مخصصة للمناقشة العامة حول المواضيع التي تم تناولها في السمينار.",
            "تبادل الخبرات والتعلم المكتسب من العروض والمناقشات.",
            "مناقشة التحديات والصعوبات التي واجهت الطلاب واقتراح حلول.",
            "تحديد مواضيع محتملة للبحوث المستقبلية أو المشاريع التخرج."
          ]
        },
        {
          "week": 16,
          "title": "التقييم النهائي - تقييم شامل للمشاركة والعروض والتقرير النهائي:",
          "items": [
            "لا يوجد امتحان نهائي تقليدي.",
            "التقييم النهائي يعتمد على:",
            "تقييم المشاركة العامة في جميع جلسات السمينار (الحضور، المشاركة في المناقشات، الأسئلة، التعليقات).",
            "تقييم جودة العروض التقديمية للمجموعة الثانية من الطلاب (الأسابيع 10-13).",
            "تقديم تقرير نهائي موجز (صفحة واحدة) يلخص أهم ما تعلمه الطالب من السمينار وانعكاسه على تطوره العلمي."
          ]
        }
      ],
      "teaching_methods_ar": "عروض تقديمية للطلاب، مناقشات جماعية، محاضرات قصيرة من المحاضر، استضافة متحدثين ضيوف، ورش عمل تفاعلية، قراءات موجهة من الأبحاث الحديثة.",
      "outcomes_ar": [
        "تطوير مهارات البحث العلمي الذاتي في مجال التخصص.",
        "تحسين مهارات العرض العلمي الفعال أمام الجمهور.",
        "تعزيز مهارات المناقشة والتفكير النقدي في المواضيع العلمية.",
        "توسيع المعرفة في مواضيع متقدمة في مجال التخصص من خلال عروض الزملاء والمتحدثين الضيوف.",
        "تطوير مهارات التواصل العلمي الشفهي والكتابي.",
        "بناء الثقة بالنفس والقدرة على التعلم المستمر في مجال التخصص."
      ]
    },
    {
      "title_ar": "الروبوتات",
      "title_en": "Robotics",
      "description_ar": "مقدمة شاملة في مجال الروبوتات، تغطي المبادئ الأساسية لتصميم وبناء وتشغيل الروبوتات. تتضمن المادة دراسة المكونات الميكانيكية والإلكترونية للروبوتات، وأنظمة التحكم، والاستشعار، والتخطيط للحركة، والبرمجة، والتطبيقات الصناعية والخدمية للروبوتات. يتم التركيز على الجوانب العملية من خلال مشاريع تطبيقية وتمارين عملية.",
      "description_en": "Robotics fundamentals: kinematics, control, perception, planning, sensors, and practical robot programming & simulation.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في علم الروبوتات:",
          "items": [
            "تعريف الروبوتات وتاريخ تطورها.",
            "تصنيف الروبوتات وأنواعها المختلفة.",
            "مجالات تطبيق الروبوتات وأهميتها في الصناعة والمجتمع.",
            "المكونات الرئيسية للروبوت: الميكانيكية، الإلكترونية، البرمجية.",
            "تمارين: مناقشة تطبيقات الروبوتات، تحديد أنواع الروبوتات المناسبة لمهام مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "المكونات الميكانيكية للروبوتات:",
          "items": [
            "المحركات وأنواعها (الكهربائية، الهيدروليكية، الهوائية).",
            "نظام الحركة (العجلات، الأرجل، المسارات).",
            "أجهزة الاستشعار الميكانيكية (مستشعرات اللمس، القوة، التسارع).",
            "تصميم الهيكل الميكانيكي للروبوت.",
            "تمارين: تصميم وبناء هيكل روبوت بسيط باستخدام مواد أولية."
          ]
        },
        {
          "week": 3,
          "title": "المكونات الإلكترونية للروبوتات:",
          "items": [
            "المتحكمات الدقيقة (Microcontrollers) وأنواعها (Arduino, Raspberry Pi).",
            "الدوائر الإلكترونية الأساسية للروبوتات.",
            "تكامل أجهزة الاستشعار والمحركات مع المتحكم الدقيق.",
            "أنظمة الطاقة للروبوتات (البطاريات، مصادر الطاقة الخارجية).",
            "تمارين: بناء دائرة إلكترونية بسيطة للتحكم في محرك باستخدام Arduino."
          ]
        },
        {
          "week": 4,
          "title": "أجهزة استشعار الروبوتات:",
          "items": [
            "مستشعرات المسافة (فوق صوتية، الأشعة تحت الحمراء، الليزر).",
            "الكاميرات وأنظمة الرؤية الحاسوبية (مقدمة).",
            "مستشعرات الملاحة (جيروسكوب، مقياس التسارع، البوصلة).",
            "مستشعرات البيئة (درجة الحرارة، الرطوبة، الضوء).",
            "تمارين: استخدام مستشعرات المسافة لقراءة البيئة المحيطة بالروبوت."
          ]
        },
        {
          "week": 5,
          "title": "أنظمة التحكم في الروبوتات:",
          "items": [
            "مقدمة في نظرية التحكم.",
            "أنواع التحكم (الحلقة المفتوحة، الحلقة المغلقة، التحكم التناسبي-التكاملي-التفاضلي PID).",
            "تنفيذ أنظمة التحكم باستخدام المتحكمات الدقيقة.",
            "تمارين: تطبيق نظام تحكم بسيط للتحكم في حركة محرك روبوت."
          ]
        },
        {
          "week": 6,
          "title": "برمجة الروبوتات (مقدمة):",
          "items": [
            "مقدمة في لغات برمجة الروبوتات (Python, C++, ROS).",
            "أساسيات برمجة Arduino للروبوتات.",
            "التحكم في المحركات وأجهزة الاستشعار من خلال البرمجة.",
            "تمارين: كتابة برنامج بسيط للتحكم في حركة روبوت افتراضي أو حقيقي."
          ]
        },
        {
          "week": 7,
          "title": "تخطيط الحركة والملاحة للروبوتات:",
          "items": [
            "مفهوم تخطيط الحركة (Motion Planning) للروبوتات.",
            "خوارزميات تخطيط الحركة الأساسية (A*, RRT).",
            "الملاحة في البيئات المعروفة وغير المعروفة.",
            "تجنب العوائق والتخطيط للمسار.",
            "تمارين: تطبيق خوارزمية تخطيط حركة بسيطة لروبوت افتراضي."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، المكونات الميكانيكية والإلكترونية، أجهزة الاستشعار، أنظمة التحكم، برمجة الروبوتات، تخطيط الحركة)."
          ]
        },
        {
          "week": 9,
          "title": "الرؤية الحاسوبية للروبوتات:",
          "items": [
            "مقدمة في الرؤية الحاسوبية وتطبيقاتها في الروبوتات.",
            "معالجة الصور الأساسية (تصفية، تجزئة، اكتشاف الحواف).",
            "التعرف على الأنماط والأجسام باستخدام الرؤية الحاسوبية.",
            "تمارين: استخدام مكتبات الرؤية الحاسوبية (OpenCV) لمعالجة الصور واكتشاف الأجسام."
          ]
        },
        {
          "week": 10,
          "title": "التحكم في الروبوتات باستخدام الرؤية الحاسوبية:",
          "items": [
            "تكامل الرؤية الحاسوبية مع أنظمة التحكم في الروبوتات.",
            "توجيه الروبوتات باستخدام المعلومات البصرية.",
            "تطبيقات عملية للتحكم البصري في الروبوتات (تتبع الأجسام، الملاحة البصرية).",
            "تمارين: بناء نظام روبوت بسيط يتبع خطًا أو جسمًا باستخدام الرؤية الحاسوبية."
          ]
        },
        {
          "week": 11,
          "title": "الروبوتات المتنقلة:",
          "items": [
            "أنواع الروبوتات المتنقلة (ذات العجلات، ذات الأرجل، الطائرة).",
            "تصميم وبرمجة الروبوتات المتنقلة.",
            "تطبيقات الروبوتات المتنقلة في الاستكشاف والخدمات والبحث والإنقاذ.",
            "تمارين: تصميم وبرمجة روبوت متنقل بسيط يقوم بمهمة محددة."
          ]
        },
        {
          "week": 12,
          "title": "الروبوتات الصناعية:",
          "items": [
            "أنواع الروبوتات الصناعية واستخداماتها في خطوط الإنتاج.",
            "برمجة الروبوتات الصناعية للقيام بمهام تصنيعية مختلفة (اللحام، الطلاء، التجميع).",
            "السلامة في استخدام الروبوتات الصناعية.",
            "تمارين: محاكاة برمجة روبوت صناعي لتنفيذ مهمة تصنيعية باستخدام برنامج محاكاة."
          ]
        },
        {
          "week": 13,
          "title": "الروبوتات الخدمية:",
          "items": [
            "أنواع الروبوتات الخدمية وتطبيقاتها في المنازل والمستشفيات والمطاعم وغيرها.",
            "تصميم وبرمجة الروبوتات الخدمية للتفاعل مع البشر وتقديم الخدمات.",
            "التحديات الأخلاقية والاجتماعية للروبوتات الخدمية.",
            "تمارين: تصميم مفهوم روبوت خدمي لمهمة محددة في الحياة اليومية."
          ]
        },
        {
          "week": 14,
          "title": "موضوعات متقدمة في الروبوتات (اختياري):",
          "items": [
            "الروبوتات التعاونية (Cobots).",
            "الروبوتات الحيوية (Bio-inspired Robotics).",
            "الروبوتات السحابية (Cloud Robotics).",
            "مناقشة مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في الروبوتات:",
          "items": [
            "يقوم الطلاب بتصميم وبناء وبرمجة روبوت حقيقي أو افتراضي لتنفيذ مهمة محددة.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والمكونات، وأنظمة التحكم، والبرمجة، والتطبيقات العملية للروبوتات."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة في المختبر، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، زيارات ميدانية (إذا أمكن).",
      "outcomes_ar": [
        "فهم المبادئ الأساسية لعلم الروبوتات وتصنيفاته.",
        "تحديد ووصف المكونات الميكانيكية والإلكترونية لأنظمة الروبوتات.",
        "تطبيق أنظمة التحكم والاستشعار في تصميم الروبوتات.",
        "برمجة الروبوتات باستخدام لغات برمجة مناسبة.",
        "تخطيط الحركة والملاحة للروبوتات في بيئات مختلفة.",
        "فهم تطبيقات الروبوتات في الصناعة والخدمات والمجتمع.",
        "تصميم وبناء وبرمجة روبوت بسيط لتنفيذ مهمة محددة."
      ]
    },
    {
      "title_ar": "لغات البرمجة (بايثون)",
      "title_en": "Programming Languages (Python)",
      "description_ar": "مقدمة شاملة في لغة البرمجة بايثون، وهي لغة برمجة عالية المستوى ومتعددة الأغراض وسهلة التعلم. تغطي المادة أساسيات البرمجة باستخدام بايثون، بما في ذلك أنواع البيانات، المتغيرات، العمليات، هياكل التحكم، الدوال، الوحدات، البرمجة الشيئية، والتعامل مع الملفات والاستثناءات. يتم التركيز على الجانب العملي من خلال تمارين وتطبيقات متنوعة لترسيخ المفاهيم وتطوير مهارات البرمجة.",
      "description_en": "Python programming for data/AI: syntax, OOP, data structures, files, libraries, best practices, testing, and mini-projects.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في البرمجة وبايثون:",
          "items": [
            "مفهوم البرمجة وأهميتها في العصر الرقمي.",
            "مقدمة في لغة بايثون ومميزاتها وتطبيقاتها.",
            "إعداد بيئة تطوير بايثون (Python IDEs).",
            "كتابة وتشغيل أول برنامج بايثون (Hello, World!).",
            "تمارين: كتابة برامج بسيطة لطباعة نصوص وأرقام."
          ]
        },
        {
          "week": 2,
          "title": "أنواع البيانات والمتغيرات والعمليات:",
          "items": [
            "أنواع البيانات الأساسية في بايثون (أعداد صحيحة، أعداد عشرية، نصوص، قيم منطقية).",
            "المتغيرات وكيفية تعريفها واستخدامها.",
            "العمليات الحسابية والمنطقية وعمليات المقارنة.",
            "تمارين: كتابة برامج تستخدم أنواع البيانات والمتغيرات والعمليات المختلفة."
          ]
        },
        {
          "week": 3,
          "title": "هياكل التحكم - التسلسل والاختيار:",
          "items": [
            "التسلسل (Sequence) في تنفيذ التعليمات.",
            "جملة if الشرطية (if, elif, else) لاتخاذ القرارات.",
            "الشروط المنطقية والعمليات المنطقية المركبة.",
            "تمارين: كتابة برامج تستخدم جمل if الشرطية لاتخاذ قرارات بناءً على شروط مختلفة."
          ]
        },
        {
          "week": 4,
          "title": "هياكل التحكم - التكرار (الحلقات):",
          "items": [
            "حلقة for للتكرار لعدد محدد من المرات.",
            "حلقة while للتكرار طالما تحقق شرط معين.",
            "جمل break و continue للتحكم في الحلقات.",
            "تمارين: كتابة برامج تستخدم حلقات for و while لتكرار العمليات وتنفيذها بشكل فعال."
          ]
        },
        {
          "week": 5,
          "title": "هياكل البيانات - القوائم والصفوف والقواميس:",
          "items": [
            "القوائم (Lists) وكيفية تعريفها والوصول إلى عناصرها وتعديلها.",
            "الصفوف (Tuples) وكيفية تعريفها والفرق بينها وبين القوائم.",
            "القواميس (Dictionaries) وكيفية تعريفها والوصول إلى قيمها باستخدام المفاتيح.",
            "تمارين: كتابة برامج تستخدم القوائم والصفوف والقواميس لتخزين البيانات ومعالجتها."
          ]
        },
        {
          "week": 6,
          "title": "الدوال (Functions):",
          "items": [
            "مفهوم الدوال وأهميتها في تنظيم الكود وإعادة استخدامه.",
            "تعريف الدوال واستدعائها.",
            "المعاملات والقيم المرجعة للدوال.",
            "نطاق المتغيرات (Scope).",
            "تمارين: كتابة دوال بسيطة لتنفيذ مهام محددة واستدعائها في برامج مختلفة."
          ]
        },
        {
          "week": 7,
          "title": "الوحدات (Modules) والمكتبات:",
          "items": [
            "مفهوم الوحدات والمكتبات في بايثون.",
            "استخدام الوحدات والمكتبات الجاهزة (import).",
            "مقدمة في مكتبات بايثون الشائعة (math, random, datetime).",
            "تمارين: استخدام وحدات ومكتبات بايثون الجاهزة لتنفيذ مهام رياضية وعشوائية وتاريخية."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، أنواع البيانات، هياكل التحكم، هياكل البيانات، الدوال، الوحدات)."
          ]
        },
        {
          "week": 9,
          "title": "البرمجة الشيئية (Object-Oriented Programming - OOP) - مقدمة:",
          "items": [
            "مفهوم البرمجة الشيئية ومبادئها الأساسية (التغليف، الوراثة، التعددية الأشكال).",
            "الأصناف (Classes) والكائنات (Objects).",
            "تعريف الأصناف وإنشاء الكائنات.",
            "الخصائص (Attributes) والطرق (Methods).",
            "تمارين: تعريف أصناف بسيطة وإنشاء كائنات منها واستخدام خصائصها وطرقها."
          ]
        },
        {
          "week": 10,
          "title": "البرمجة الشيئية - الوراثة والتعددية الأشكال:",
          "items": [
            "مفهوم الوراثة وكيفية استخدامها لإعادة استخدام الكود وتوسيع الأصناف.",
            "الأصناف الأبوية والأصناف الابنة.",
            "التعددية الأشكال (Polymorphism) وكيفية تحقيقها في بايثون.",
            "تمارين: تعريف أصناف وراثية وتطبيق مفهوم التعددية الأشكال."
          ]
        },
        {
          "week": 11,
          "title": "التعامل مع الملفات:",
          "items": [
            "فتح وقراءة وكتابة الملفات النصية وملفات البيانات.",
            "أنماط فتح الملفات (القراءة، الكتابة، الإضافة).",
            "التعامل مع مسارات الملفات.",
            "تمارين: كتابة برامج لفتح ملفات نصية وقراءتها وكتابة بيانات جديدة فيها."
          ]
        },
        {
          "week": 12,
          "title": "التعامل مع الاستثناءات:",
          "items": [
            "مفهوم الاستثناءات والأخطاء في البرمجة.",
            "التعامل مع الاستثناءات باستخدام try-except.",
            "أنواع الاستثناءات الشائعة في بايثون.",
            "تمارين: كتابة برامج تتعامل مع الاستثناءات المحتملة وتمنع توقف البرنامج بشكل مفاجئ."
          ]
        },
        {
          "week": 13,
          "title": "مقدمة في مكتبة NumPy:",
          "items": [
            "مقدمة في مكتبة NumPy للحسابات العددية.",
            "المصفوفات (Arrays) في NumPy وكيفية إنشائها ومعالجتها.",
            "العمليات الرياضية والإحصائية على المصفوفات باستخدام NumPy.",
            "تمارين: استخدام NumPy لإنشاء مصفوفات وتنفيذ عمليات رياضية وإحصائية عليها."
          ]
        },
        {
          "week": 14,
          "title": "مقدمة في مكتبة Pandas:",
          "items": [
            "مقدمة في مكتبة Pandas لتحليل البيانات.",
            "إطارات البيانات (DataFrames) في Pandas وكيفية إنشائها ومعالجتها.",
            "قراءة وكتابة البيانات من وإلى ملفات مختلفة (CSV, Excel).",
            "تمارين: استخدام Pandas لإنشاء إطارات بيانات وقراءة بيانات من ملفات وتحليلها بشكل بسيط."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في بايثون:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم البرمجة بايثون على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، وهياكل التحكم، وهياكل البيانات، والدوال، والبرمجة الشيئية، والتعامل مع الملفات والاستثناءات، ومقدمة في NumPy و Pandas."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة في المختبر، مشاريع تطبيقية، مناقشات جماعية، واجبات منزلية، مسابقات برمجية (اختياري).",
      "outcomes_ar": [
        "فهم أساسيات البرمجة ومفاهيمها الرئيسية.",
        "كتابة برامج بايثون بسيطة ومعقدة لحل مشاكل متنوعة.",
        "استخدام هياكل التحكم وهياكل البيانات في بايثون بكفاءة.",
        "تصميم وتنفيذ الدوال والوحدات في بايثون.",
        "فهم مبادئ البرمجة الشيئية وتطبيقها في بايثون.",
        "التعامل مع الملفات والاستثناءات في بايثون.",
        "استخدام مكتبات NumPy و Pandas للعمليات العددية وتحليل البيانات بشكل أساسي.",
        "تطبيق مهارات البرمجة بايثون في مشاريع عملية."
      ]
    },
    {
      "title_ar": "علم اللغة الحاسوبي",
      "title_en": "Computational Linguistics",
      "description_ar": "مقدمة في علم اللغة الحاسوبي، وهو مجال متعدد التخصصات يجمع بين اللسانيات وعلوم الحاسوب لدراسة ومعالجة اللغة الطبيعية باستخدام الحاسوب. تغطي المادة المفاهيم الأساسية في اللسانيات الحاسوبية، بما في ذلك تحليل النصوص، المعالجة الصوتية، الصرف، النحو، الدلالة، والتداولية. كما تتناول المادة تطبيقات علم اللغة الحاسوبي في مجالات مثل معالجة اللغة الطبيعية، الترجمة الآلية، استرجاع المعلومات، والحوار الآلي.",
      "description_en": "Computational linguistics basics: morphology, syntax, semantics, corpora, parsing, and language resources with applied labs.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في علم اللغة الحاسوبي:",
          "items": [
            "تعريف علم اللغة الحاسوبي وأهدافه وتاريخ تطوره.",
            "العلاقة بين علم اللغة الحاسوبي واللسانيات وعلوم الحاسوب والذكاء الاصطناعي.",
            "مستويات التحليل اللغوي (صوتي، صرفي، نحوي، دلالي، تداولي).",
            "تطبيقات علم اللغة الحاسوبي في مجالات مختلفة.",
            "تمارين: مناقشة تطبيقات علم اللغة الحاسوبي، تحديد مستويات التحليل اللغوي في أمثلة مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "تمثيل النصوص ومعالجتها:",
          "items": [
            "تمثيل النصوص رقميًا (ترميز الحروف، ترميز الكلمات).",
            "معالجة النصوص الأولية (تقطيع الكلمات، إزالة علامات الترقيم، تحويل الحروف لحالة واحدة).",
            "التنظيف والتحضير المسبق للنصوص (إزالة الكلمات الشائعة، الكلمات الجذرية، التجريد اللغوي).",
            "تمارين: تطبيق تقنيات معالجة النصوص الأولية باستخدام Python ومكتبات NLP."
          ]
        },
        {
          "week": 3,
          "title": "المعالجة الصوتية (Phonetics and Phonology) - مقدمة:",
          "items": [
            "مقدمة في علم الأصوات وعلم وظائف الأصوات.",
            "الأصوات اللغوية وتمثيلها الصوتي (IPA).",
            "العمليات الصوتية (التغيرات الصوتية، القواعد الصوتية).",
            "تطبيقات المعالجة الصوتية في علم اللغة الحاسوبي (تحويل النص إلى كلام، التعرف على الكلام).",
            "تمارين: تحليل الأصوات اللغوية في كلمات مختلفة، التعرف على العمليات الصوتية."
          ]
        },
        {
          "week": 4,
          "title": "علم الصرف (Morphology):",
          "items": [
            "مقدمة في علم الصرف ودراسة بنية الكلمات.",
            "المورفيمات (Morphemes) وأنواعها (جذور، لواحق، سوابق).",
            "التحليل الصرفي (Morphological Analysis) وتوليد الكلمات (Morphological Generation).",
            "تمارين: تحليل الكلمات إلى مورفيمات، تطبيق التحليل الصرفي باستخدام أدوات حاسوبية."
          ]
        },
        {
          "week": 5,
          "title": "علم النحو (Syntax) - القواعد النحوية:",
          "items": [
            "مقدمة في علم النحو ودراسة تركيب الجمل.",
            "القواعد النحوية (Grammars) وأنواعها (قواعد التركيب، قواعد الاعتمادية).",
            "التحليل النحوي (Parsing) وتوليد الجمل (Sentence Generation).",
            "تمارين: تحليل الجمل نحويًا باستخدام قواعد نحوية بسيطة، بناء شجرة تحليل نحوي لجملة."
          ]
        },
        {
          "week": 6,
          "title": "علم النحو - التحليل النحوي الحاسوبي (Parsing):",
          "items": [
            "خوارزميات التحليل النحوي الحاسوبي (Top-down, Bottom-up, CYK).",
            "محللات نحوية (Parsers) وأدوات التحليل النحوي.",
            "التعامل مع الغموض النحوي (Syntactic Ambiguity).",
            "تمارين: استخدام محللات نحوية حاسوبية لتحليل جمل، مقارنة نتائج محللات مختلفة."
          ]
        },
        {
          "week": 7,
          "title": "علم الدلالة (Semantics) - دلالة الكلمات والجمل:",
          "items": [
            "مقدمة في علم الدلالة ودراسة معنى الكلمات والجمل.",
            "دلالة الكلمات (Lexical Semantics) والعلاقات الدلالية بين الكلمات (الترادف، التضاد، التجانس).",
            "دلالة الجمل (Sentence Semantics) والتمثيل الدلالي للجمل.",
            "تمارين: تحليل المعنى الدلالي للكلمات والجمل، تحديد العلاقات الدلالية بين الكلمات."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، تمثيل النصوص، المعالجة الصوتية، علم الصرف، علم النحو - القواعد والتحليل النحوي، علم الدلالة)."
          ]
        },
        {
          "week": 9,
          "title": "علم الدلالة - التمثيل الدلالي الحاسوبي:",
          "items": [
            "نماذج التمثيل الدلالي الحاسوبي (WordNet, FrameNet, Word Embeddings).",
            "حساب التشابه الدلالي بين الكلمات والجمل.",
            "تطبيقات التمثيل الدلالي في علم اللغة الحاسوبي (استرجاع المعلومات الدلالي، تلخيص النصوص).",
            "تمارين: استخدام نماذج التمثيل الدلالي لحساب التشابه الدلالي بين الكلمات والجمل."
          ]
        },
        {
          "week": 10,
          "title": "علم التداولية (Pragmatics) - مقدمة:",
          "items": [
            "مقدمة في علم التداولية ودراسة استخدام اللغة في السياق.",
            "الأفعال الكلامية (Speech Acts) وأنواعها (إخباري، طلبي، وعدي).",
            "الافتراضات المسبقة (Presuppositions) والاستلزام المنطقي (Implicatures).",
            "تمارين: تحليل الأفعال الكلامية في حوارات مختلفة، تحديد الافتراضات المسبقة والاستلزام المنطقي."
          ]
        },
        {
          "week": 11,
          "title": "تحليل الخطاب (Discourse Analysis):",
          "items": [
            "مقدمة في تحليل الخطاب ودراسة بنية الخطابات والنصوص المتماسكة.",
            "التماسك (Cohesion) والاتساق (Coherence) في الخطاب.",
            "بنية الخطاب (Discourse Structure) وأنماط الخطاب.",
            "تمارين: تحليل خطابات ونصوص مختلفة لتحديد التماسك والاتساق وبنية الخطاب."
          ]
        },
        {
          "week": 12,
          "title": "علم اللغة الحاسوبي والإحصاء:",
          "items": [
            "مقدمة في الأساليب الإحصائية في علم اللغة الحاسوبي.",
            "نماذج اللغة الإحصائية (Statistical Language Models).",
            "التعلم الآلي في علم اللغة الحاسوبي (مقدمة).",
            "تمارين: تطبيق أساليب إحصائية بسيطة على بيانات لغوية."
          ]
        },
        {
          "week": 13,
          "title": "تطبيقات علم اللغة الحاسوبي - الترجمة الآلية (مقدمة):",
          "items": [
            "مقدمة في الترجمة الآلية وتاريخ تطورها.",
            "مناهج الترجمة الآلية (القائمة على القواعد، الإحصائية، العصبية).",
            "تحديات الترجمة الآلية وتقييم جودة الترجمة.",
            "تمارين: تقييم جودة ترجمة آلية لنصوص مختلفة، مقارنة نتائج أنظمة ترجمة آلية مختلفة."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات علم اللغة الحاسوبي - استرجاع المعلومات (مقدمة):",
          "items": [
            "مقدمة في استرجاع المعلومات ومحركات البحث.",
            "نماذج استرجاع المعلومات (نموذج الفضاء المتجهي، نموذج الاحتمالية).",
            "تقييم أداء أنظمة استرجاع المعلومات.",
            "تمارين: تقييم أداء نظام استرجاع معلومات بسيط، تحسين نتائج البحث باستخدام تقنيات مختلفة."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في علم اللغة الحاسوبي:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وتقنيات علم اللغة الحاسوبي على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية في علم اللغة الحاسوبي، ومستويات التحليل اللغوي، وتقنيات المعالجة، وتطبيقات علم اللغة الحاسوبي."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية باستخدام الحاسوب وأدوات علم اللغة الحاسوبي، مشاريع تطبيقية، مناقشات جماعية، قراءات ومناقشات لمقالات علمية.",
      "outcomes_ar": [
        "فهم المفاهيم الأساسية في علم اللغة الحاسوبي ومستويات التحليل اللغوي.",
        "تطبيق تقنيات معالجة النصوص الأولية والصرفية والنحوية والدلالية.",
        "استخدام أدوات علم اللغة الحاسوبي لتحليل اللغة الطبيعية.",
        "فهم تطبيقات علم اللغة الحاسوبي في مجالات مختلفة مثل معالجة اللغة الطبيعية والترجمة الآلية واسترجاع المعلومات.",
        "تطبيق علم اللغة الحاسوبي لحل مشاكل لغوية حاسوبية في مشاريع عملية."
      ]
    },
    {
      "title_ar": "معالجة اللغة الطبيعية (NLP)",
      "title_en": "Natural Language Processing (NLP)",
      "description_ar": "مقدمة شاملة في مجال معالجة اللغة الطبيعية (NLP)، وهو فرع من فروع الذكاء الاصطناعي يهتم بتطوير أنظمة حاسوبية قادرة على فهم اللغة البشرية وتوليدها. تغطي المادة المفاهيم الأساسية والتقنيات المستخدمة في معالجة اللغة الطبيعية، بما في ذلك معالجة النصوص، التحليل النحوي، التحليل الدلالي، استخراج المعلومات، تلخيص النصوص، الترجمة الآلية، الحوار الآلي، وتحليل المشاعر. يتم التركيز على الجوانب العملية من خلال تمارين وتطبيقات باستخدام مكتبات NLP في بايثون.",
      "description_en": "NLP pipeline from classical methods to Transformers: preprocessing, embeddings, sequence models, evaluation, and applications.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في معالجة اللغة الطبيعية (NLP):",
          "items": [
            "تعريف معالجة اللغة الطبيعية وأهدافها وتاريخ تطورها.",
            "العلاقة بين NLP والذكاء الاصطناعي وعلم اللغة الحاسوبي.",
            "تحديات معالجة اللغة الطبيعية (الغموض، التباين، السياق).",
            "تطبيقات NLP في مجالات مختلفة (الطب، الهندسة، الأعمال، التسويق، الإعلام، إلخ.).",
            "تمارين: مناقشة تطبيقات NLP، تحديد تحديات معالجة اللغة الطبيعية في أمثلة مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "معالجة النصوص الأولية (Text Preprocessing):",
          "items": [
            "تنظيف النصوص (إزالة الأحرف غير المرغوب فيها، علامات الترقيم، الأرقام).",
            "تقطيع الكلمات (Tokenization) والجمل (Sentence Segmentation).",
            "تحويل الحروف لحالة واحدة (Case Conversion).",
            "إزالة الكلمات الشائعة (Stop Word Removal).",
            "تمارين: تطبيق تقنيات معالجة النصوص الأولية باستخدام Python ومكتبات NLP (NLTK, spaCy)."
          ]
        },
        {
          "week": 3,
          "title": "التمثيل النصي (Text Representation) - الأكياس الكلامية (Bag of Words):",
          "items": [
            "نموذج الأكياس الكلامية (Bag of Words - BoW) لتمثيل النصوص.",
            "إنشاء مصفوفة تمثيل الأكياس الكلامية (Document-Term Matrix).",
            "عيوب نموذج الأكياس الكلامية.",
            "تمارين: تطبيق نموذج الأكياس الكلامية لتمثيل مجموعة من النصوص باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 4,
          "title": "التمثيل النصي - TF-IDF:",
          "items": [
            "مقياس تردد الكلمة - عكس تردد المستند (TF-IDF) لتمثيل النصوص.",
            "حساب قيم TF-IDF للكلمات في النصوص.",
            "مزايا وعيوب TF-IDF مقارنة بالأكياس الكلامية.",
            "تمارين: تطبيق TF-IDF لتمثيل مجموعة من النصوص باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 5,
          "title": "التمثيل النصي - Word Embeddings (Word2Vec, GloVe):",
          "items": [
            "مقدمة في تمثيل الكلمات المضمنة (Word Embeddings).",
            "نموذج Word2Vec (CBOW, Skip-gram) لتعلم تمثيل الكلمات.",
            "نموذج GloVe (Global Vectors for Word Representation) لتعلم تمثيل الكلمات.",
            "استخدام تمثيل الكلمات المضمنة في تطبيقات NLP.",
            "تمارين: تدريب نماذج Word2Vec و GloVe باستخدام Python ومكتبات NLP (Gensim, spaCy)."
          ]
        },
        {
          "week": 6,
          "title": "التحليل النحوي (Syntactic Analysis) - التحليل الشجري (Parsing):",
          "items": [
            "مقدمة في التحليل النحوي ودوره في NLP.",
            "التحليل الشجري (Parsing) للجمل.",
            "محللات نحوية (Parsers) وأدوات التحليل النحوي في NLP.",
            "تمارين: استخدام محللات نحوية حاسوبية لتحليل جمل باستخدام Python ومكتبات NLP (NLTK, spaCy)."
          ]
        },
        {
          "week": 7,
          "title": "التحليل الدلالي (Semantic Analysis) - دلالة الكلمات والجمل:",
          "items": [
            "مقدمة في التحليل الدلالي ودوره في NLP.",
            "استخراج العلاقات الدلالية بين الكلمات والجمل.",
            "التمييز الدلالي للكلمات (Word Sense Disambiguation).",
            "تمارين: تطبيق تقنيات التحليل الدلالي لاستخراج العلاقات الدلالية بين الكلمات باستخدام Python ومكتبات NLP."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، معالجة النصوص الأولية، التمثيل النصي - BoW, TF-IDF, Word Embeddings، التحليل النحوي، التحليل الدلالي)."
          ]
        },
        {
          "week": 9,
          "title": "استخراج المعلومات (Information Extraction - IE):",
          "items": [
            "مقدمة في استخراج المعلومات وأهدافه.",
            "استخراج الكيانات المسماة (Named Entity Recognition - NER).",
            "استخراج العلاقات (Relation Extraction).",
            "استخراج الأحداث (Event Extraction).",
            "تمارين: تطبيق تقنيات استخراج المعلومات لاستخراج الكيانات والعلاقات والأحداث من النصوص باستخدام Python ومكتبات NLP (spaCy, NLTK)."
          ]
        },
        {
          "week": 10,
          "title": "تلخيص النصوص (Text Summarization):",
          "items": [
            "مقدمة في تلخيص النصوص وأهميته.",
            "أساليب تلخيص النصوص (الاستخلاصي، التجريدي).",
            "خوارزميات تلخيص النصوص (TextRank, LexRank).",
            "تمارين: تطبيق خوارزميات تلخيص النصوص لتلخيص مقالات ونصوص طويلة باستخدام Python ومكتبات NLP."
          ]
        },
        {
          "week": 11,
          "title": "تحليل المشاعر (Sentiment Analysis):",
          "items": [
            "مقدمة في تحليل المشاعر وأهميته في تطبيقات NLP.",
            "أساليب تحليل المشاعر (القائمة على المعجم، التعلم الآلي).",
            "تصنيف المشاعر (إيجابي، سلبي، محايد).",
            "تمارين: تطبيق تقنيات تحليل المشاعر لتحليل آراء المستخدمين في النصوص باستخدام Python ومكتبات NLP (TextBlob, VADER)."
          ]
        },
        {
          "week": 12,
          "title": "نمذجة الموضوع (Topic Modeling) - LDA:",
          "items": [
            "مقدمة في نمذجة الموضوع وأهميتها في تحليل النصوص.",
            "نموذج تخصيص ديريشيه اللاتمي (Latent Dirichlet Allocation - LDA) لنمذجة الموضوع.",
            "تفسير مواضيع LDA وتحليل النتائج.",
            "تمارين: تطبيق LDA لنمذجة الموضوع في مجموعة من الوثائق باستخدام Python ومكتبات NLP (Gensim)."
          ]
        },
        {
          "week": 13,
          "title": "الترجمة الآلية (Machine Translation) - مقدمة:",
          "items": [
            "مقدمة في الترجمة الآلية وتاريخ تطورها.",
            "مناهج الترجمة الآلية (القائمة على القواعد، الإحصائية، العصبية).",
            "استخدام أنظمة الترجمة الآلية الجاهزة وتقييم جودتها.",
            "تمارين: استخدام أنظمة ترجمة آلية جاهزة لترجمة نصوص، تقييم جودة الترجمة."
          ]
        },
        {
          "week": 14,
          "title": "الحوار الآلي (Chatbots) - مقدمة:",
          "items": [
            "مقدمة في الحوار الآلي وتطبيقاته.",
            "بناء روبوتات محادثة بسيطة باستخدام أدوات NLP.",
            "تصميم تدفق الحوار (Dialogue Flow).",
            "تمارين: بناء روبوت محادثة بسيط باستخدام أدوات NLP (Rasa, Dialogflow)."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في معالجة اللغة الطبيعية:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وتقنيات NLP على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية في NLP، وتقنيات معالجة النصوص، والتحليل النحوي والدلالي، وتطبيقات NLP المختلفة."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام Python ومكتبات NLP (NLTK, spaCy, Gensim, scikit-learn, TensorFlow, Keras, PyTorch)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، مسابقات NLP (اختياري).",
      "outcomes_ar": [
        "فهم المفاهيم الأساسية في معالجة اللغة الطبيعية وتطبيقاتها.",
        "تطبيق تقنيات معالجة النصوص الأولية والتمثيل النصي.",
        "استخدام تقنيات التحليل النحوي والدلالي في NLP.",
        "تطبيق تقنيات استخراج المعلومات وتلخيص النصوص وتحليل المشاعر ونمذجة الموضوع.",
        "فهم مبادئ الترجمة الآلية والحوار الآلي.",
        "استخدام مكتبات NLP في بايثون لتطوير تطبيقات NLP بسيطة.",
        "تطبيق مهارات NLP لحل مشاكل واقعية في مجالات مختلفة."
      ]
    },
    {
      "title_ar": "تحليل النصوص",
      "title_en": "Text Analysis",
      "description_ar": "مقدمة متعمقة في مجال تحليل النصوص، وهو مجموعة من التقنيات والأساليب المستخدمة لاستخلاص رؤى ومعلومات قيمة من البيانات النصية. تغطي المادة مراحل تحليل النصوص بشكل شامل، بدءًا من جمع النصوص ومعالجتها الأولية، مرورًا بتقنيات التحليل المختلفة (التحليل الإحصائي، التحليل الدلالي، تحليل المشاعر، نمذجة الموضوع، الشبكات الاجتماعية النصية)، وصولًا إلى تفسير النتائج وتطبيقاتها في مجالات متنوعة. يتم التركيز على الجانب العملي باستخدام أدوات تحليل النصوص ومكتبات البرمجة في بايثون.",
      "description_en": "Text analytics for insight: cleaning, feature engineering, topic modeling, sentiment, classification, and reporting results.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في تحليل النصوص:",
          "items": [
            "تعريف تحليل النصوص وأهميته في العصر الرقمي.",
            "أنواع البيانات النصية ومصادرها المختلفة.",
            "مراحل عملية تحليل النصوص (جمع البيانات، المعالجة الأولية، التحليل، التفسير، التطبيق).",
            "تطبيقات تحليل النصوص في مجالات مختلفة (الأعمال، التسويق، الإعلام، العلوم الاجتماعية، إلخ.).",
            "تمارين: مناقشة تطبيقات تحليل النصوص، تحديد أنواع البيانات النصية المناسبة لمشاكل مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "جمع البيانات النصية ومصادرها:",
          "items": [
            "مصادر البيانات النصية المتاحة (الويب، وسائل التواصل الاجتماعي، قواعد البيانات، الوثائق).",
            "تقنيات جمع البيانات النصية (Web Scraping, APIs).",
            "اعتبارات أخلاقية وقانونية في جمع البيانات النصية.",
            "تمارين: جمع بيانات نصية من مصادر مختلفة باستخدام تقنيات Web Scraping أو APIs."
          ]
        },
        {
          "week": 3,
          "title": "معالجة النصوص الأولية (Text Preprocessing) لتحليل النصوص:",
          "items": [
            "تنظيف النصوص (إزالة الأحرف غير المرغوب فيها، علامات الترقيم، الأرقام، HTML tags).",
            "تقطيع الكلمات (Tokenization) والجمل (Sentence Segmentation).",
            "تحويل الحروف لحالة واحدة (Case Conversion).",
            "إزالة الكلمات الشائعة (Stop Word Removal) والكلمات قليلة التكرار.",
            "تمارين: تطبيق تقنيات معالجة النصوص الأولية باستخدام Python ومكتبات NLP (NLTK, spaCy) لتحضير النصوص للتحليل."
          ]
        },
        {
          "week": 4,
          "title": "التحليل الإحصائي للنصوص - الإحصاءات الوصفية:",
          "items": [
            "حساب الإحصاءات الوصفية للنصوص (عدد الكلمات، عدد الجمل، متوسط طول الجملة، التوزيع الترددي للكلمات).",
            "تصور البيانات النصية باستخدام الرسوم البيانية (Word Clouds, Histograms).",
            "تحليل التوزيع الترددي للكلمات (Frequency Distribution Analysis).",
            "تمارين: تطبيق التحليل الإحصائي للنصوص وحساب الإحصاءات الوصفية وتصور البيانات باستخدام Python ومكتبات NLP و Data Visualization."
          ]
        },
        {
          "week": 5,
          "title": "التحليل الإحصائي للنصوص - مقاييس الارتباط والتشابه:",
          "items": [
            "مقاييس الارتباط بين الكلمات (Pointwise Mutual Information - PMI, Association Rules).",
            "مقاييس التشابه بين النصوص (Cosine Similarity, Jaccard Index).",
            "تطبيقات مقاييس الارتباط والتشابه في تحليل النصوص (اكتشاف الكلمات المتلازمة، تجميع الوثائق المتشابهة).",
            "تمارين: تطبيق مقاييس الارتباط والتشابه لتحليل العلاقات بين الكلمات والنصوص باستخدام Python ومكتبات NLP و scikit-learn."
          ]
        },
        {
          "week": 6,
          "title": "التحليل الدلالي للنصوص - Word Sense Disambiguation:",
          "items": [
            "مقدمة في التحليل الدلالي للكلمات في السياق.",
            "التمييز الدلالي للكلمات (Word Sense Disambiguation - WSD).",
            "أساليب WSD (القائمة على المعرفة، القائمة على التعلم الآلي).",
            "تطبيقات WSD في تحليل النصوص (تحسين استرجاع المعلومات، الترجمة الآلية).",
            "تمارين: تطبيق تقنيات WSD للتمييز بين معاني الكلمات في النصوص باستخدام Python ومكتبات NLP."
          ]
        },
        {
          "week": 7,
          "title": "تحليل المشاعر (Sentiment Analysis) - أساليب المعجم والتعلم الآلي:",
          "items": [
            "مقدمة في تحليل المشاعر وأهميته في تحليل النصوص.",
            "أساليب تحليل المشاعر القائمة على المعجم (Lexicon-based Sentiment Analysis).",
            "أساليب تحليل المشاعر القائمة على التعلم الآلي (Machine Learning-based Sentiment Analysis).",
            "تقييم أداء أنظمة تحليل المشاعر.",
            "تمارين: تطبيق أساليب تحليل المشاعر القائمة على المعجم والتعلم الآلي لتحليل آراء المستخدمين في النصوص باستخدام Python ومكتبات NLP (TextBlob, VADER, scikit-learn)."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، جمع البيانات النصية، معالجة النصوص الأولية، التحليل الإحصائي - الإحصاءات الوصفية ومقاييس الارتباط والتشابه، التحليل الدلالي، تحليل المشاعر)."
          ]
        },
        {
          "week": 9,
          "title": "نمذجة الموضوع (Topic Modeling) - LDA وتطبيقاتها في تحليل النصوص:",
          "items": [
            "مقدمة في نمذجة الموضوع وأهميتها في تحليل النصوص.",
            "نموذج تخصيص ديريشيه اللاتمي (Latent Dirichlet Allocation - LDA) لنمذجة الموضوع.",
            "تفسير مواضيع LDA وتحليل النتائج وتصورها.",
            "تطبيقات نمذجة الموضوع في تحليل النصوص (تحليل اتجاهات الرأي، اكتشاف الموضوعات الرئيسية في مجموعة وثائق).",
            "تمارين: تطبيق LDA لنمذجة الموضوع في مجموعة من الوثائق وتحليل النتائج باستخدام Python ومكتبات NLP (Gensim)."
          ]
        },
        {
          "week": 10,
          "title": "تحليل الشبكات الاجتماعية النصية (Text-based Social Network Analysis):",
          "items": [
            "مقدمة في تحليل الشبكات الاجتماعية النصية.",
            "بناء شبكات اجتماعية من البيانات النصية (شبكات الكلمات، شبكات المؤلفين، شبكات العلاقات).",
            "مقاييس تحليل الشبكات الاجتماعية (المركزية، الوساطة، الكثافة).",
            "تطبيقات تحليل الشبكات الاجتماعية النصية (تحليل العلاقات بين الكيانات، اكتشاف المجتمعات).",
            "تمارين: بناء وتحليل شبكات اجتماعية نصية باستخدام Python ومكتبات تحليل الشبكات (NetworkX)."
          ]
        },
        {
          "week": 11,
          "title": "تحليل الأنماط والاتجاهات في النصوص مع مرور الوقت (Temporal Text Analysis):",
          "items": [
            "مقدمة في تحليل الأنماط والاتجاهات في النصوص مع مرور الوقت.",
            "تحليل السلاسل الزمنية للبيانات النصية.",
            "اكتشاف الاتجاهات والتغيرات في الموضوعات والمشاعر والكلمات مع مرور الوقت.",
            "تطبيقات تحليل الأنماط الزمنية في النصوص (تحليل تطور الرأي العام، تتبع الأحداث الإخبارية).",
            "تمارين: تطبيق تقنيات تحليل الأنماط الزمنية على البيانات النصية باستخدام Python ومكتبات تحليل السلاسل الزمنية."
          ]
        },
        {
          "week": 12,
          "title": "تحليل مقارن للنصوص (Comparative Text Analysis):",
          "items": [
            "مقدمة في تحليل مقارن للنصوص.",
            "مقارنة مجموعات مختلفة من النصوص (مقارنة بين آراء مجموعات مختلفة، مقارنة بين أنواع مختلفة من الوثائق).",
            "استخدام مقاييس التشابه والاختلاف للمقارنة بين النصوص.",
            "تطبيقات التحليل المقارن للنصوص (مقارنة بين استراتيجيات التسويق المختلفة، مقارنة بين الخطابات السياسية).",
            "تمارين: تطبيق تقنيات التحليل المقارن للنصوص لمقارنة مجموعات مختلفة من النصوص باستخدام Python ومكتبات NLP و scikit-learn."
          ]
        },
        {
          "week": 13,
          "title": "تقييم نتائج تحليل النصوص وتفسيرها:",
          "items": [
            "طرق تقييم جودة نتائج تحليل النصوص (التقييم الكمي، التقييم النوعي).",
            "تفسير النتائج واستخلاص الرؤى والمعلومات القيمة.",
            "تصور نتائج تحليل النصوص بشكل فعال.",
            "اعتبارات أخلاقية في تفسير نتائج تحليل النصوص.",
            "تمارين: تقييم وتفسير نتائج تحليل نصوص حقيقية، إعداد تقارير بنتائج التحليل."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة في تحليل النصوص (اختياري):",
          "items": [
            "تحليل النصوص العميق (Deep Learning for Text Analysis).",
            "تحليل النصوص متعدد اللغات (Multilingual Text Analysis).",
            "تحليل النصوص التفاعلي (Interactive Text Analysis).",
            "مناقشة مواضيع متقدمة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في تحليل النصوص:",
          "items": [
            "يقوم الطلاب بتطبيق تقنيات تحليل النصوص على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية في تحليل النصوص، ومراحل التحليل، وتقنيات التحليل الإحصائي والدلالي وتحليل المشاعر ونمذجة الموضوع والشبكات الاجتماعية النصية، وتطبيقات تحليل النصوص."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام Python ومكتبات NLP و Data Visualization، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، مسابقات تحليل النصوص (اختياري).",
      "outcomes_ar": [
        "فهم المفاهيم الأساسية في تحليل النصوص وأهميته وتطبيقاته.",
        "تطبيق مراحل عملية تحليل النصوص بشكل كامل (جمع، معالجة، تحليل، تفسير، تطبيق).",
        "استخدام تقنيات معالجة النصوص الأولية والتحليل الإحصائي والدلالي وتحليل المشاعر ونمذجة الموضوع والشبكات الاجتماعية النصية.",
        "تفسير نتائج تحليل النصوص واستخلاص رؤى ومعلومات قيمة.",
        "استخدام أدوات تحليل النصوص ومكتبات البرمجة في بايثون لتنفيذ تحليلات النصوص.",
        "تطبيق مهارات تحليل النصوص لحل مشاكل واقعية في مجالات مختلفة."
      ]
    },
    {
      "title_ar": "الترجمة الآلية",
      "title_en": "Machine Translation",
      "description_ar": "مقدمة متخصصة في مجال الترجمة الآلية (Machine Translation - MT)، وهو فرع من فروع معالجة اللغة الطبيعية يهدف إلى تطوير أنظمة حاسوبية قادرة على ترجمة النصوص من لغة إلى أخرى بشكل آلي. تغطي المادة تاريخ الترجمة الآلية وتطورها، والمناهج المختلفة للترجمة الآلية (القائمة على القواعد، الإحصائية، الهجينة، العصبية)، وتقنيات الترجمة العصبية الحديثة، وتقييم جودة الترجمة الآلية، وتطبيقات الترجمة الآلية في مجالات متنوعة، والتحديات الأخلاقية والاجتماعية للترجمة الآلية. يتم التركيز على الجوانب النظرية والعملية من خلال دراسة نماذج ترجمة آلية حقيقية وتطبيقات عملية.",
      "description_en": "MT from statistical to neural: encoder–decoder, attention, Transformers, evaluation (BLEU), and building MT systems.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في الترجمة الآلية:",
          "items": [
            "تعريف الترجمة الآلية وأهدافها وتاريخ تطورها.",
            "أهمية الترجمة الآلية في العصر الرقمي والعولمة.",
            "تحديات الترجمة الآلية (الغموض، الاختلافات اللغوية والثقافية).",
            "أنواع الترجمة الآلية (ترجمة الكلمات، ترجمة العبارات، ترجمة الجمل، ترجمة الوثائق).",
            "تمارين: مناقشة تطبيقات الترجمة الآلية، تحديد تحديات الترجمة الآلية في أمثلة مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية القائمة على القواعد (Rule-based MT):",
          "items": [
            "مقدمة في الترجمة الآلية القائمة على القواعد (RBMT).",
            "مكونات نظام RBMT (القواعد النحوية، القواميس، قواعد النقل).",
            "مزايا وعيوب RBMT.",
            "تمارين: تحليل قواعد ترجمة بسيطة، بناء نظام RBMT بسيط لترجمة عبارات قصيرة."
          ]
        },
        {
          "week": 3,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية الإحصائية (Statistical MT) - نماذج اللغة:",
          "items": [
            "مقدمة في الترجمة الآلية الإحصائية (SMT).",
            "نماذج اللغة الإحصائية (Statistical Language Models - SLMs) ودورها في SMT.",
            "نماذج N-gram اللغوية.",
            "تمارين: بناء نموذج لغة N-gram باستخدام بيانات نصية، حساب احتمالية جملة باستخدام نموذج لغة."
          ]
        },
        {
          "week": 4,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية الإحصائية - نماذج الترجمة:",
          "items": [
            "نماذج الترجمة الإحصائية (Translation Models - TMs) ودورها في SMT.",
            "نماذج الترجمة القائمة على العبارات (Phrase-based Translation).",
            "تدريب نماذج الترجمة الإحصائية باستخدام بيانات متوازية.",
            "تمارين: تحليل بيانات متوازية، تدريب نموذج ترجمة إحصائي بسيط."
          ]
        },
        {
          "week": 5,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية الإحصائية - فك التشفير (Decoding):",
          "items": [
            "فك التشفير (Decoding) في الترجمة الآلية الإحصائية.",
            "خوارزميات البحث (Search Algorithms) للفك التشفير (Viterbi, Beam Search).",
            "تقييم جودة الترجمة الآلية الإحصائية (BLEU Score).",
            "تمارين: تطبيق خوارزمية فك تشفير بسيطة، حساب BLEU Score لترجمة آلية."
          ]
        },
        {
          "week": 6,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية الهجينة (Hybrid MT):",
          "items": [
            "مقدمة في الترجمة الآلية الهجينة (Hybrid MT).",
            "دمج مناهج RBMT و SMT في أنظمة الترجمة الهجينة.",
            "مزايا وعيوب الترجمة الآلية الهجينة.",
            "تمارين: مقارنة أنظمة RBMT و SMT و Hybrid MT، تحليل نقاط القوة والضعف لكل منهج."
          ]
        },
        {
          "week": 7,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية العصبية (Neural MT) - مقدمة:",
          "items": [
            "مقدمة في الترجمة الآلية العصبية (NMT).",
            "الشبكات العصبية المتكررة (Recurrent Neural Networks - RNNs) للترجمة الآلية.",
            "نموذج التسلسل إلى التسلسل (Sequence-to-Sequence Model) مع آلية الانتباه (Attention Mechanism).",
            "تمارين: بناء نموذج NMT بسيط باستخدام مكتبات Deep Learning (TensorFlow, Keras, PyTorch) (مقدمة)."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، RBMT، SMT - نماذج اللغة والترجمة والفك، Hybrid MT، NMT - مقدمة)."
          ]
        },
        {
          "week": 9,
          "title": "مناهج الترجمة الآلية - الترجمة الآلية العصبية - نماذج متقدمة:",
          "items": [
            "نماذج NMT المتقدمة (Transformer Networks).",
            "آلية الانتباه الذاتي (Self-Attention Mechanism) في Transformer.",
            "مزايا وعيوب Transformer مقارنة بـ RNNs في الترجمة الآلية.",
            "تمارين: بناء نموذج NMT باستخدام Transformer باستخدام مكتبات Deep Learning."
          ]
        },
        {
          "week": 10,
          "title": "تدريب نماذج الترجمة الآلية العصبية:",
          "items": [
            "إعداد البيانات لتدريب نماذج NMT (البيانات المتوازية، التقطيع، الترميز).",
            "تدريب نماذج NMT باستخدام مكتبات Deep Learning (TensorFlow, Keras, PyTorch).",
            "ضبط المعلمات الفائقة (Hyperparameter Tuning) لنماذج NMT.",
            "تمارين: تدريب نموذج NMT على مجموعة بيانات صغيرة للترجمة."
          ]
        },
        {
          "week": 11,
          "title": "تقييم جودة الترجمة الآلية:",
          "items": [
            "مقاييس التقييم الآلي للترجمة الآلية (BLEU, METEOR, TER).",
            "التقييم البشري للترجمة الآلية.",
            "تحليل أخطاء الترجمة الآلية وتحسين الجودة.",
            "تمارين: تقييم جودة ترجمة آلية باستخدام مقاييس التقييم الآلي والبشري."
          ]
        },
        {
          "week": 12,
          "title": "تطبيقات الترجمة الآلية - أنظمة الترجمة الآلية الجاهزة:",
          "items": [
            "استخدام أنظمة الترجمة الآلية الجاهزة (Google Translate, Microsoft Translator, DeepL).",
            "تقييم أداء أنظمة الترجمة الآلية الجاهزة في سيناريوهات مختلفة.",
            "تطبيقات الترجمة الآلية في مجالات متنوعة (التجارة الإلكترونية، السفر، التعليم، الإعلام).",
            "تمارين: استخدام أنظمة ترجمة آلية جاهزة لترجمة نصوص متنوعة، مقارنة نتائج أنظمة مختلفة."
          ]
        },
        {
          "week": 13,
          "title": "تطبيقات الترجمة الآلية - تخصيص الترجمة الآلية (Customization):",
          "items": [
            "تخصيص أنظمة الترجمة الآلية لتطبيقات محددة (Domain Adaptation).",
            "تدريب نماذج الترجمة الآلية على بيانات خاصة بالمجال.",
            "تحسين جودة الترجمة الآلية في مجالات متخصصة.",
            "تمارين: تخصيص نموذج ترجمة آلية لترجمة نصوص في مجال محدد."
          ]
        },
        {
          "week": 14,
          "title": "التحديات الأخلاقية والاجتماعية للترجمة الآلية:",
          "items": [
            "التحيز في الترجمة الآلية وتأثيره على المجتمع.",
            "قضايا الخصوصية والأمن في الترجمة الآلية.",
            "مستقبل الترجمة الآلية وتأثيرها على مهنة الترجمة البشرية.",
            "مناقشة التحديات الأخلاقية والاجتماعية للترجمة الآلية."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في الترجمة الآلية:",
          "items": [
            "يقوم الطلاب بتطبيق مفاهيم وتقنيات الترجمة الآلية على مشروع عملي حقيقي.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا (بناء نظام ترجمة آلية بسيط، تخصيص نظام ترجمة آلية جاهز، تقييم أنظمة ترجمة آلية مختلفة).",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية في الترجمة الآلية، ومناهج الترجمة الآلية المختلفة (RBMT, SMT, Hybrid MT, NMT)، وتقنيات الترجمة العصبية، وتقييم الجودة، وتطبيقات وتحديات الترجمة الآلية."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام Python ومكتبات NLP و Deep Learning، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، قراءات ومناقشات لمقالات علمية في مجال الترجمة الآلية.",
      "outcomes_ar": [
        "فهم المفاهيم الأساسية في الترجمة الآلية وتاريخ تطورها وتحدياتها.",
        "شرح ومقارنة مناهج الترجمة الآلية المختلفة (RBMT, SMT, Hybrid MT, NMT).",
        "فهم تقنيات الترجمة العصبية الحديثة ونماذج Transformer.",
        "تدريب وتقييم نماذج الترجمة الآلية العصبية.",
        "استخدام أنظمة الترجمة الآلية الجاهزة وتخصيصها لتطبيقات محددة.",
        "تقييم جودة الترجمة الآلية باستخدام مقاييس التقييم الآلي والبشري.",
        "فهم تطبيقات الترجمة الآلية في مجالات متنوعة والتحديات الأخلاقية والاجتماعية للترجمة الآلية.",
        "تطبيق مهارات الترجمة الآلية في مشاريع عملية."
      ]
    },
    {
      "title_ar": "برمجة تطبيقات اللغة الطبيعية",
      "title_en": "Natural Language Processing Applications Programming",
      "description_ar": "مقدمة عملية في برمجة تطبيقات معالجة اللغة الطبيعية (NLP)، تركز على تطوير تطبيقات حقيقية باستخدام مكتبات وأدوات NLP في بايثون. تغطي المادة دورة حياة تطوير تطبيقات NLP بشكل كامل، بدءًا من تحديد المشكلة وتحليل المتطلبات، مرورًا بتصميم التطبيق وتنفيذه وبرمجته باستخدام مكتبات NLP (NLTK, spaCy, Gensim, Transformers)، وصولًا إلى اختبار التطبيق وتقييمه ونشره. يتم التركيز على الجانب العملي من خلال مشاريع تطبيقية متنوعة لتطوير تطبيقات NLP في مجالات مختلفة.",
      "description_en": "Comprehensive course: Natural Language Processing Applications Programming.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في برمجة تطبيقات اللغة الطبيعية:",
          "items": [
            "تعريف تطبيقات NLP وأهميتها وتنوعها.",
            "دورة حياة تطوير تطبيقات NLP (تحديد المشكلة، تحليل المتطلبات، التصميم، التنفيذ، الاختبار، التقييم، النشر).",
            "مكتبات وأدوات NLP الشائعة في بايثون (NLTK, spaCy, Gensim, Transformers).",
            "إعداد بيئة تطوير تطبيقات NLP في بايثون.",
            "تمارين: مناقشة أفكار لتطبيقات NLP، تحديد مشاكل واقعية يمكن حلها بتطبيقات NLP."
          ]
        },
        {
          "week": 2,
          "title": "تحديد المشكلة وتحليل المتطلبات لتطبيقات NLP:",
          "items": [
            "تحديد مشاكل NLP واقعية وتحديد أهداف التطبيق.",
            "تحليل متطلبات المستخدم ووظائف التطبيق.",
            "تحديد البيانات اللازمة لتطوير التطبيق ومصادرها.",
            "تصميم واجهة المستخدم (User Interface - UI) وتجربة المستخدم (User Experience - UX) لتطبيقات NLP.",
            "تمارين: تحديد مشكلة NLP محددة، تحليل متطلبات تطبيق لحل المشكلة، تصميم واجهة مستخدم بسيطة."
          ]
        },
        {
          "week": 3,
          "title": "تصميم تطبيقات NLP - تصميم معماري التطبيق:",
          "items": [
            "تصميم معماري التطبيق (Application Architecture) لتطبيقات NLP.",
            "اختيار المكونات والوحدات البرمجية المناسبة (مكتبات NLP، قواعد البيانات، واجهات المستخدم).",
            "تصميم تدفق البيانات (Data Flow) في التطبيق.",
            "تصميم واجهات برمجة التطبيقات (APIs) للتكامل مع أنظمة أخرى (إذا لزم الأمر).",
            "تمارين: تصميم معماري لتطبيق NLP محدد، تحديد المكونات والوحدات البرمجية وتدفق البيانات."
          ]
        },
        {
          "week": 4,
          "title": "برمجة تطبيقات NLP - معالجة النصوص الأولية في التطبيقات:",
          "items": [
            "تنفيذ تقنيات معالجة النصوص الأولية (تنظيف، تقطيع، تحويل حالة، إزالة كلمات شائعة) في تطبيقات NLP باستخدام بايثون ومكتبات NLP.",
            "تغليف وظائف معالجة النصوص الأولية في وحدات برمجية قابلة لإعادة الاستخدام.",
            "تمارين: برمجة وظائف معالجة النصوص الأولية في بايثون وتطبيقها على بيانات نصية حقيقية."
          ]
        },
        {
          "week": 5,
          "title": "برمجة تطبيقات NLP - التمثيل النصي في التطبيقات:",
          "items": [
            "تنفيذ تقنيات التمثيل النصي (BoW, TF-IDF, Word Embeddings) في تطبيقات NLP باستخدام بايثون ومكتبات NLP و scikit-learn و Gensim.",
            "تكامل نماذج تمثيل الكلمات المضمنة المدربة مسبقًا (Pre-trained Word Embeddings) في التطبيقات.",
            "تمارين: برمجة وظائف تمثيل النصوص في بايثون وتطبيقها على بيانات نصية حقيقية."
          ]
        },
        {
          "week": 6,
          "title": "برمجة تطبيقات NLP - التحليل النحوي والدلالي في التطبيقات:",
          "items": [
            "تكامل أدوات التحليل النحوي والدلالي (Parsers, Word Sense Disambiguation) في تطبيقات NLP باستخدام بايثون ومكتبات NLP (spaCy, NLTK).",
            "استخدام نتائج التحليل النحوي والدلالي في وظائف التطبيق المختلفة.",
            "تمارين: برمجة وظائف التحليل النحوي والدلالي في بايثون وتطبيقها على بيانات نصية حقيقية."
          ]
        },
        {
          "week": 7,
          "title": "برمجة تطبيقات NLP - استخراج المعلومات في التطبيقات:",
          "items": [
            "تنفيذ تقنيات استخراج المعلومات (NER, Relation Extraction, Event Extraction) في تطبيقات NLP باستخدام بايثون ومكتبات NLP (spaCy, NLTK, Transformers).",
            "تصميم وظائف استخراج المعلومات لتلبية متطلبات التطبيق.",
            "تمارين: برمجة وظائف استخراج المعلومات في بايثون وتطبيقها على بيانات نصية حقيقية."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، تحديد المشكلة وتحليل المتطلبات، تصميم التطبيق، برمجة معالجة النصوص الأولية والتمثيل النصي والتحليل النحوي والدلالي واستخراج المعلومات في التطبيقات)."
          ]
        },
        {
          "week": 9,
          "title": "برمجة تطبيقات NLP - تحليل المشاعر في التطبيقات:",
          "items": [
            "تنفيذ تقنيات تحليل المشاعر (Lexicon-based, Machine Learning-based) في تطبيقات NLP باستخدام بايثون ومكتبات NLP (TextBlob, VADER, scikit-learn, Transformers).",
            "تصميم وظائف تحليل المشاعر لتلبية متطلبات التطبيق.",
            "تمارين: برمجة وظائف تحليل المشاعر في بايثون وتطبيقها على بيانات نصية حقيقية."
          ]
        },
        {
          "week": 10,
          "title": "برمجة تطبيقات NLP - نمذجة الموضوع في التطبيقات:",
          "items": [
            "تكامل تقنيات نمذجة الموضوع (LDA) في تطبيقات NLP باستخدام بايثون ومكتبات NLP (Gensim).",
            "استخدام مواضيع LDA في وظائف التطبيق المختلفة (تصنيف الوثائق، التوصية بالمحتوى).",
            "تمارين: برمجة وظائف نمذجة الموضوع في بايثون وتطبيقها على بيانات نصية حقيقية."
          ]
        },
        {
          "week": 11,
          "title": "برمجة تطبيقات NLP - الحوار الآلي في التطبيقات:",
          "items": [
            "بناء روبوتات محادثة بسيطة باستخدام أدوات NLP (Rasa, Dialogflow) ودمجها في تطبيقات NLP.",
            "تصميم تدفق الحوار (Dialogue Flow) وبرمجة منطق الحوار في التطبيقات.",
            "تمارين: بناء روبوت محادثة بسيط باستخدام أدوات NLP ودمجه في تطبيق NLP."
          ]
        },
        {
          "week": 12,
          "title": "اختبار تطبيقات NLP وتقييمها:",
          "items": [
            "استراتيجيات اختبار تطبيقات NLP (Unit Testing, Integration Testing, System Testing).",
            "مقاييس تقييم أداء تطبيقات NLP (Accuracy, Precision, Recall, F1-score, BLEU).",
            "تصحيح الأخطاء وتحسين أداء التطبيق.",
            "تمارين: كتابة اختبارات لتطبيق NLP، تقييم أداء التطبيق باستخدام مقاييس مناسبة، تحليل الأخطاء وتحسين التطبيق."
          ]
        },
        {
          "week": 13,
          "title": "نشر تطبيقات NLP وتوزيعها:",
          "items": [
            "خيارات نشر تطبيقات NLP (ويب، تطبيقات سطح المكتب، تطبيقات الهاتف المحمول).",
            "توزيع تطبيقات NLP للمستخدمين (Packaging, Deployment).",
            "اعتبارات الأداء وقابلية التوسع (Performance and Scalability) في نشر تطبيقات NLP.",
            "تمارين: نشر تطبيق NLP بسيط على منصة ويب أو نظام تشغيل محلي."
          ]
        },
        {
          "week": 14,
          "title": "دراسات حالة لتطبيقات NLP في مجالات مختلفة:",
          "items": [
            "دراسة حالات لتطبيقات NLP ناجحة في مجالات متنوعة (خدمة العملاء، الرعاية الصحية، التعليم، الإعلام، التجارة الإلكترونية).",
            "تحليل تصميم وتنفيذ وتقييم هذه التطبيقات.",
            "استخلاص الدروس المستفادة وأفضل الممارسات في تطوير تطبيقات NLP.",
            "مناقشة دراسات حالة لتطبيقات NLP مختلفة."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في برمجة تطبيقات اللغة الطبيعية:",
          "items": [
            "يقوم الطلاب بتطوير تطبيق NLP كامل لحل مشكلة واقعية.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على دورة حياة تطوير تطبيقات NLP، ومراحل التطوير (تحديد المشكلة، التصميم، التنفيذ، الاختبار، التقييم، النشر)، وتقنيات البرمجة باستخدام مكتبات NLP، وتطبيقات NLP في مجالات مختلفة، ودراسات الحالة."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة في المختبر، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، ورش عمل لتطوير تطبيقات NLP.",
      "outcomes_ar": [
        "فهم دورة حياة تطوير تطبيقات NLP بشكل كامل.",
        "تحديد مشاكل NLP واقعية وتحليل متطلبات تطبيقات NLP.",
        "تصميم معماريات تطبيقات NLP واختيار المكونات المناسبة.",
        "برمجة تطبيقات NLP باستخدام مكتبات وأدوات NLP في بايثون.",
        "تطبيق تقنيات معالجة النصوص الأولية والتمثيل النصي والتحليل النحوي والدلالي واستخراج المعلومات وتحليل المشاعر ونمذجة الموضوع في تطبيقات NLP.",
        "بناء روبوتات محادثة بسيطة ودمجها في تطبيقات NLP.",
        "اختبار تطبيقات NLP وتقييم أدائها.",
        "نشر تطبيقات NLP وتوزيعها للمستخدمين.",
        "تطبيق مهارات برمجة تطبيقات NLP لتطوير حلول لمشاكل واقعية في مجالات مختلفة."
      ]
    },
    {
      "title_ar": "الأنظمة الخبيرة",
      "title_en": "Expert Systems",
      "description_ar": "مقدمة شاملة في مجال الأنظمة الخبيرة (Expert Systems)، وهي أنظمة ذكاء اصطناعي مصممة لتقليد قدرات الخبراء البشريين في حل المشكلات واتخاذ القرارات في مجالات متخصصة. تغطي المادة المفاهيم الأساسية للأنظمة الخبيرة، ومكوناتها الرئيسية (قاعدة المعرفة، محرك الاستدلال، واجهة المستخدم)، وطرق تمثيل المعرفة (القواعد، الشبكات الدلالية، الأطر)، وآليات الاستدلال (الاستدلال الأمامي، الاستدلال الخلفي)، وتقنيات بناء الأنظمة الخبيرة، وتطبيقات الأنظمة الخبيرة في مجالات متنوعة، ومزايا وعيوب الأنظمة الخبيرة، والاتجاهات الحديثة في تطوير الأنظمة الخبيرة. يتم التركيز على الجانب النظري والعملي من خلال دراسة أمثلة لأنظمة خبيرة حقيقية وتطبيقات عملية بسيطة.",
      "description_en": "Knowledge-based systems: rule engines, inference, knowledge acquisition, uncertainty, and building expert systems for decisions.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في الأنظمة الخبيرة:",
          "items": [
            "تعريف الأنظمة الخبيرة وأهدافها وتاريخ تطورها.",
            "العلاقة بين الأنظمة الخبيرة والذكاء الاصطناعي وأنظمة دعم القرار.",
            "خصائص الأنظمة الخبيرة ومميزاتها مقارنة بالأنظمة التقليدية.",
            "مجالات تطبيق الأنظمة الخبيرة وأهميتها في مجالات متخصصة (الطب، الهندسة، القانون، المال، إلخ.).",
            "تمارين: مناقشة تطبيقات الأنظمة الخبيرة، تحديد مجالات مناسبة لتطبيق الأنظمة الخبيرة."
          ]
        },
        {
          "week": 2,
          "title": "مكونات الأنظمة الخبيرة - قاعدة المعرفة (Knowledge Base):",
          "items": [
            "مكونات الأنظمة الخبيرة الرئيسية (قاعدة المعرفة، محرك الاستدلال، واجهة المستخدم).",
            "قاعدة المعرفة (Knowledge Base) ودورها في الأنظمة الخبيرة.",
            "أنواع المعرفة التي تمثل في قاعدة المعرفة (حقائق، قواعد، خبرة، استراتيجيات).",
            "تمارين: تحليل أمثلة لقواعد معرفة في مجالات مختلفة، تحديد أنواع المعرفة الممثلة."
          ]
        },
        {
          "week": 3,
          "title": "طرق تمثيل المعرفة - القواعد (Rules):",
          "items": [
            "طرق تمثيل المعرفة في الأنظمة الخبيرة.",
            "تمثيل المعرفة باستخدام القواعد (Rules) (قواعد الإنتاج، قواعد الاستنتاج).",
            "صياغة القواعد وتمثيلها في الأنظمة الخبيرة.",
            "مزايا وعيوب تمثيل المعرفة بالقواعد.",
            "تمارين: تمثيل المعرفة باستخدام القواعد لمشكلة بسيطة في مجال متخصص."
          ]
        },
        {
          "week": 4,
          "title": "طرق تمثيل المعرفة - الشبكات الدلالية (Semantic Networks):",
          "items": [
            "تمثيل المعرفة باستخدام الشبكات الدلالية (Semantic Networks).",
            "العقد (Nodes) والروابط (Links) في الشبكات الدلالية.",
            "أنواع الروابط الدلالية (العلاقات، الخصائص، التصنيفات).",
            "مزايا وعيوب تمثيل المعرفة بالشبكات الدلالية.",
            "تمارين: تمثيل المعرفة باستخدام الشبكات الدلالية لمشكلة بسيطة في مجال متخصص."
          ]
        },
        {
          "week": 5,
          "title": "طرق تمثيل المعرفة - الأطر (Frames):",
          "items": [
            "تمثيل المعرفة باستخدام الأطر (Frames).",
            "الأطر والفتحات (Slots) والقيم (Values) في الأطر.",
            "الوراثة (Inheritance) في الأطر.",
            "مزايا وعيوب تمثيل المعرفة بالأطر.",
            "تمارين: تمثيل المعرفة باستخدام الأطر لمشكلة بسيطة في مجال متخصص."
          ]
        },
        {
          "week": 6,
          "title": "محرك الاستدلال (Inference Engine) - الاستدلال الأمامي (Forward Chaining):",
          "items": [
            "محرك الاستدلال (Inference Engine) ودوره في الأنظمة الخبيرة.",
            "آليات الاستدلال (Inference Mechanisms) في الأنظمة الخبيرة.",
            "الاستدلال الأمامي (Forward Chaining) وآلية عمله.",
            "تطبيقات الاستدلال الأمامي.",
            "تمارين: تطبيق الاستدلال الأمامي لحل مشكلة بسيطة باستخدام مجموعة من القواعد والحقائق."
          ]
        },
        {
          "week": 7,
          "title": "محرك الاستدلال - الاستدلال الخلفي (Backward Chaining):",
          "items": [
            "الاستدلال الخلفي (Backward Chaining) وآلية عمله.",
            "مقارنة بين الاستدلال الأمامي والخلفي.",
            "تطبيقات الاستدلال الخلفي.",
            "تمارين: تطبيق الاستدلال الخلفي لحل مشكلة بسيطة باستخدام مجموعة من القواعد والحقائق."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة، مكونات الأنظمة الخبيرة - قاعدة المعرفة ومحرك الاستدلال وواجهة المستخدم، طرق تمثيل المعرفة - القواعد والشبكات الدلالية والأطر، آليات الاستدلال - الاستدلال الأمامي والخلفي)."
          ]
        },
        {
          "week": 9,
          "title": "عدم اليقين في الأنظمة الخبيرة (Uncertainty in Expert Systems):",
          "items": [
            "مفهوم عدم اليقين في المعرفة والبيانات في الأنظمة الخبيرة.",
            "طرق التعامل مع عدم اليقين (نظرية الاحتمالات، المنطق الضبابي، عوامل التأكيد).",
            "تأثير عدم اليقين على الاستدلال واتخاذ القرارات في الأنظمة الخبيرة.",
            "تمارين: تطبيق طرق التعامل مع عدم اليقين في نظام خبير بسيط."
          ]
        },
        {
          "week": 10,
          "title": "بناء الأنظمة الخبيرة - دورة حياة تطوير الأنظمة الخبيرة:",
          "items": [
            "دورة حياة تطوير الأنظمة الخبيرة (تحديد المشكلة، اكتساب المعرفة، تصميم النظام، الترميز، الاختبار، التقييم، الصيانة).",
            "مراحل اكتساب المعرفة (Knowledge Acquisition) من الخبراء البشريين.",
            "أدوات بناء الأنظمة الخبيرة (Expert System Shells).",
            "تمارين: تحديد مشكلة مناسبة لتطوير نظام خبير، تخطيط دورة حياة تطوير النظام."
          ]
        },
        {
          "week": 11,
          "title": "بناء الأنظمة الخبيرة - اكتساب المعرفة (Knowledge Acquisition):",
          "items": [
            "تقنيات اكتساب المعرفة من الخبراء البشريين (المقابلات، الملاحظة، تحليل البروتوكولات، تحليل الحالات).",
            "تحديات اكتساب المعرفة وتجنب التحيز.",
            "تمارين: تطبيق تقنيات اكتساب المعرفة لاكتساب المعرفة من خبير بشري في مجال محدد."
          ]
        },
        {
          "week": 12,
          "title": "التحقق من صحة الأنظمة الخبيرة وتقييمها (Validation and Evaluation):",
          "items": [
            "التحقق من صحة الأنظمة الخبيرة (Validation) والتحقق من أنها تعمل بشكل صحيح.",
            "تقييم الأنظمة الخبيرة (Evaluation) وقياس أدائها وفعاليتها.",
            "مقاييس تقييم الأنظمة الخبيرة (الدقة، الكفاءة، قابلية الاستخدام).",
            "تمارين: تصميم اختبارات للتحقق من صحة وتقييم نظام خبير بسيط."
          ]
        },
        {
          "week": 13,
          "title": "واجهة المستخدم في الأنظمة الخبيرة (User Interface):",
          "items": [
            "تصميم واجهة المستخدم (User Interface - UI) للأنظمة الخبيرة.",
            "اعتبارات تجربة المستخدم (User Experience - UX) في تصميم واجهات الأنظمة الخبيرة.",
            "أنواع واجهات المستخدم (النصية، الرسومية، الصوتية).",
            "تمارين: تصميم واجهة مستخدم لنظام خبير بسيط."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات الأنظمة الخبيرة في مجالات متنوعة:",
          "items": [
            "دراسة حالات لأنظمة خبيرة ناجحة في مجالات مختلفة (الطب، التشخيص، الهندسة، التخطيط، التعليم، المال).",
            "تحليل تصميم وتنفيذ وتقييم هذه الأنظمة.",
            "استخلاص الدروس المستفادة وأفضل الممارسات في تطوير الأنظمة الخبيرة.",
            "مناقشة دراسات حالة لأنظمة خبيرة مختلفة."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في الأنظمة الخبيرة:",
          "items": [
            "يقوم الطلاب بتصميم وبناء نظام خبير بسيط لحل مشكلة في مجال متخصص.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية في الأنظمة الخبيرة، ومكونات الأنظمة الخبيرة، وطرق تمثيل المعرفة، وآليات الاستدلال، وتقنيات بناء الأنظمة الخبيرة، وتطبيقات الأنظمة الخبيرة، ومزايا وعيوب الأنظمة الخبيرة، والاتجاهات الحديثة."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، عروض تقديمية للطلاب، زيارات لشركات تستخدم الأنظمة الخبيرة (إذا أمكن).",
      "outcomes_ar": [
        "فهم المفاهيم الأساسية للأنظمة الخبيرة وتطبيقاتها.",
        "تحديد ووصف مكونات الأنظمة الخبيرة الرئيسية (قاعدة المعرفة، محرك الاستدلال، واجهة المستخدم).",
        "تطبيق طرق تمثيل المعرفة المختلفة (القواعد، الشبكات الدلالية، الأطر).",
        "شرح آليات الاستدلال (الاستدلال الأمامي والخلفي).",
        "فهم كيفية التعامل مع عدم اليقين في الأنظمة الخبيرة.",
        "تطبيق دورة حياة تطوير الأنظمة الخبيرة.",
        "استخدام تقنيات اكتساب المعرفة من الخبراء البشريين.",
        "التحقق من صحة الأنظمة الخبيرة وتقييم أدائها.",
        "تصميم واجهات مستخدم للأنظمة الخبيرة.",
        "فهم تطبيقات الأنظمة الخبيرة في مجالات متنوعة ومزايا وعيوبها والاتجاهات الحديثة.",
        "تصميم وبناء نظام خبير بسيط لحل مشكلة في مجال متخصص."
      ]
    },
    {
      "title_ar": "قواعد البيانات",
      "title_en": "Databases",
      "description_ar": "مقدمة شاملة في مجال قواعد البيانات، تغطي المفاهيم الأساسية والنماذج المختلفة لتصميم وإدارة قواعد البيانات. تتضمن المادة دراسة نماذج البيانات العلائقية، والكيانية-الارتباطية، وغير العلائقية، بالإضافة إلى لغة الاستعلام الهيكلية (SQL)، وتصميم قواعد البيانات، والتطبيع، وإدارة المعاملات، والأمان، وقواعد البيانات الحديثة مثل NoSQL وقواعد البيانات السحابية.",
      "description_en": "Relational databases & SQL with design, normalization, indexing, transactions, and building data-driven applications.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في قواعد البيانات:",
          "items": [
            "مفهوم قاعدة البيانات ونظم إدارة قواعد البيانات (DBMS).",
            "أهمية قواعد البيانات وتطبيقاتها في مختلف المجالات.",
            "تطور نظم إدارة قواعد البيانات وأنواعها المختلفة.",
            "مكونات نظام إدارة قواعد البيانات (المكونات المادية، البرمجية، البيانات، المستخدمون).",
            "نماذج البيانات: نموذج البيانات العلائقي، نموذج الكيانية-الارتباطية، نموذج البيانات الهرمي، نموذج الشبكة، نموذج الكائنية التوجه، نماذج NoSQL.",
            "تمارين: مناقشة تطبيقات قواعد البيانات، تحديد أنواع قواعد البيانات المناسبة لتطبيقات مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "نموذج البيانات العلائقي:",
          "items": [
            "المفاهيم الأساسية في نموذج البيانات العلائقي: العلاقات، الصفوف، الأعمدة، المفاتيح (الأساسية، الأجنبية، المرشحة).",
            "قيود التكامل في نموذج البيانات العلائقي (تكامل الكيان، التكامل المرجعي، التكامل الدلالي).",
            "الجبر العلائقي: العمليات الأساسية (الاختيار، الإسقاط، الربط، الاتحاد، التقاطع، الفرق).",
            "تمارين: تطبيق عمليات الجبر العلائقي، تصميم علاقات بسيطة."
          ]
        },
        {
          "week": 3,
          "title": "لغة الاستعلام الهيكلية (SQL) - أساسيات الاستعلام:",
          "items": [
            "مقدمة في لغة SQL وأنواعها الفرعية (DML, DDL, DCL).",
            "أوامر SQL الأساسية للاستعلام عن البيانات (SELECT, FROM, WHERE).",
            "عوامل المقارنة والعمليات المنطقية في SQL.",
            "الترتيب والتجميع في SQL (ORDER BY, GROUP BY, Aggregate Functions).",
            "تمارين: كتابة استعلامات SQL بسيطة لاسترجاع البيانات من قاعدة بيانات."
          ]
        },
        {
          "week": 4,
          "title": "لغة الاستعلام الهيكلية (SQL) - الاستعلامات المتقدمة:",
          "items": [
            "الاستعلامات الفرعية (Subqueries) في SQL.",
            "الربط بين الجداول (JOINs) وأنواعها المختلفة (INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL OUTER JOIN).",
            "عمليات الاتحاد والتقاطع والفرق في SQL (UNION, INTERSECT, EXCEPT).",
            "الدوال المضمنة في SQL (Built-in Functions).",
            "تمارين: كتابة استعلامات SQL متقدمة تتضمن ربط الجداول والاستعلامات الفرعية."
          ]
        },
        {
          "week": 5,
          "title": "تصميم قواعد البيانات - نموذج الكيانية-الارتباطية (ER Model):",
          "items": [
            "مقدمة في تصميم قواعد البيانات وأهميته.",
            "مفهوم نموذج الكيانية-الارتباطية (ER Model) ومكوناته (الكيانات، الصفات، العلاقات، القيود).",
            "أنواع الكيانات (الكيانات القوية، الكيانات الضعيفة).",
            "أنواع العلاقات (علاقة واحد إلى واحد، علاقة واحد إلى متعدد، علاقة متعدد إلى متعدد).",
            "تمارين: تصميم نماذج ER بسيطة لمشاكل واقعية."
          ]
        },
        {
          "week": 6,
          "title": "تصميم قواعد البيانات - تحويل نموذج ER إلى نموذج علائقي:",
          "items": [
            "قواعد تحويل نموذج الكيانية-الارتباطية (ER Model) إلى نموذج علائقي.",
            "معالجة العلاقات المختلفة (واحد إلى واحد، واحد إلى متعدد، متعدد إلى متعدد) في التحويل.",
            "معالجة الكيانات الضعيفة والصفات متعددة القيم في التحويل.",
            "تمارين: تحويل نماذج ER مصممة في الأسبوع السابق إلى نماذج علائقية."
          ]
        },
        {
          "week": 7,
          "title": "التطبيع (Normalization):",
          "items": [
            "مفهوم التطبيع وأهميته في تصميم قواعد البيانات الجيدة.",
            "مستويات التطبيع (1NF, 2NF, 3NF, BCNF).",
            "المشاكل التي تحلها مستويات التطبيع (التكرار، التحديث، الإضافة، الحذف).",
            "عملية التطبيع خطوة بخطوة.",
            "تمارين: تطبيق مستويات التطبيع على جداول غير مطبعة."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في قواعد البيانات، نموذج البيانات العلائقي، SQL - أساسيات ومتقدمة، تصميم قواعد البيانات - ER Model والتحويل، التطبيع)."
          ]
        },
        {
          "week": 9,
          "title": "لغة تعريف البيانات (DDL) ولغة معالجة البيانات (DML) في SQL:",
          "items": [
            "أوامر DDL في SQL لإنشاء وتعديل وحذف الكائنات في قاعدة البيانات (CREATE, ALTER, DROP).",
            "أنواع البيانات المختلفة في SQL.",
            "قيود التكامل في SQL (PRIMARY KEY, FOREIGN KEY, UNIQUE, NOT NULL, CHECK).",
            "أوامر DML في SQL لإضافة وتعديل وحذف البيانات في الجداول (INSERT, UPDATE, DELETE).",
            "تمارين: كتابة أوامر DDL و DML لإنشاء وإدارة قاعدة بيانات بسيطة."
          ]
        },
        {
          "week": 10,
          "title": "إدارة المعاملات (Transaction Management):",
          "items": [
            "مفهوم المعاملة وخصائص ACID (Atomicity, Consistency, Isolation, Durability).",
            "حالات المعاملات (نشطة، جزئية، فاشلة، ملتزمة، منتهية).",
            "التحكم بالتزامن (Concurrency Control) وأهميته.",
            "تقنيات التحكم بالتزامن (الأقفال، الطوابع الزمنية).",
            "تمارين: مناقشة مشاكل التزامن وحلولها."
          ]
        },
        {
          "week": 11,
          "title": "الأمان في قواعد البيانات:",
          "items": [
            "أهمية أمان قواعد البيانات وأنواع التهديدات.",
            "آليات التحكم بالوصول (Access Control) والتصاريح (Permissions).",
            "التشفير (Encryption) في قواعد البيانات.",
            "التدقيق (Auditing) والمراقبة (Monitoring) في قواعد البيانات.",
            "تمارين: تصميم سياسات أمان لقاعدة بيانات بسيطة."
          ]
        },
        {
          "week": 12,
          "title": "قواعد بيانات NoSQL:",
          "items": [
            "مقدمة في قواعد بيانات NoSQL وأنواعها المختلفة (قواعد بيانات المستندات، قواعد بيانات المفتاح-القيمة، قواعد بيانات الأعمدة العريضة، قواعد بيانات الرسوم البيانية).",
            "مقارنة بين قواعد بيانات NoSQL وقواعد البيانات العلائقية.",
            "حالات استخدام قواعد بيانات NoSQL.",
            "أمثلة على قواعد بيانات NoSQL (MongoDB, Cassandra, Redis, Neo4j).",
            "تمارين: استكشاف أحد أنواع قواعد بيانات NoSQL (مثال: MongoDB)."
          ]
        },
        {
          "week": 13,
          "title": "قواعد البيانات السحابية:",
          "items": [
            "مفهوم قواعد البيانات السحابية ومزاياها (قابلية التوسع، المرونة، التكلفة).",
            "أنواع نماذج نشر قواعد البيانات السحابية (IaaS, PaaS, SaaS).",
            "أمثلة على قواعد البيانات السحابية (Amazon RDS, Azure SQL Database, Google Cloud SQL).",
            "اعتبارات الأمان والأداء في قواعد البيانات السحابية.",
            "تمارين: استكشاف أحد مزودي قواعد البيانات السحابية (مثالAmazon RDS"
          ]
        },
        {
          "week": 14,
          "title": "قواعد البيانات المتقدمة وموضوعات حديثة (اختياري):",
          "items": [
            "قواعد البيانات الموزعة (Distributed Databases).",
            "قواعد البيانات في الذاكرة (In-Memory Databases).",
            "تحليل البيانات الضخمة باستخدام قواعد البيانات.",
            "مواضيع حديثة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في قواعد البيانات:",
          "items": [
            "يقوم الطلاب بتصميم وتنفيذ قاعدة بيانات لمشكلة واقعية.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والنماذج، ولغة SQL، والتصميم، وإدارة المعاملات، والأمان، وقواعد البيانات الحديثة."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام نظم إدارة قواعد البيانات (مثل MySQL, PostgreSQL, SQL Server, MongoDB)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم قواعد البيانات وأنواعها المختلفة.",
        "تصميم قواعد بيانات علائقية باستخدام نموذج الكيانية-الارتباطية.",
        "كتابة استعلامات SQL فعالة لاسترجاع وتعديل البيانات.",
        "تطبيق مبادئ التطبيع لتصميم قواعد بيانات جيدة.",
        "فهم وإدارة المعاملات والأمان في قواعد البيانات.",
        "التعرف على قواعد بيانات NoSQL وقواعد البيانات السحابية واستخداماتها."
      ]
    },
    {
      "title_ar": "التنقيب عن البيانات",
      "title_en": "Data Mining",
      "description_ar": "مقدمة شاملة في مجال التنقيب عن البيانات، يغطي المفاهيم الأساسية والتقنيات المستخدمة لاستخراج المعرفة والأنماط المفيدة من كميات كبيرة من البيانات. تتضمن المادة مراحل عملية التنقيب عن البيانات، وتقنيات المعالجة المسبقة للبيانات، وخوارزميات التصنيف، والتجميع، والارتباط، واكتشاف القيم الشاذة، وتقييم الأداء، والتطبيقات العملية للتنقيب عن البيانات.",
      "description_en": "Data mining methods: preprocessing, association rules, clustering, classification, anomaly detection, and practical case studies.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في التنقيب عن البيانات:",
          "items": [
            "مفهوم التنقيب عن البيانات وأهميته في عصر البيانات الضخمة.",
            "العلاقة بين التنقيب عن البيانات ومجالات أخرى (الإحصاء، التعلم الآلي، قواعد البيانات).",
            "مراحل عملية التنقيب عن البيانات (فهم المجال، تجهيز البيانات، اختيار التقنيات، التنقيب، التقييم، النشر).",
            "أنواع البيانات ومصادرها.",
            "تطبيقات التنقيب عن البيانات في مجالات مختلفة (التسويق، الطب، الهندسة، التمويل، إلخ.).",
            "تمارين: مناقشة تطبيقات التنقيب عن البيانات، تحديد أنواع البيانات المناسبة لمشاكل مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "تجهيز البيانات والمعالجة المسبقة:",
          "items": [
            "أهمية تجهيز البيانات في عملية التنقيب.",
            "تنظيف البيانات: معالجة القيم المفقودة، القيم الشاذة، الضوضاء، البيانات غير المتناسقة.",
            "تحويل البيانات: التوحيد (Normalization)، التقييس (Standardization)، التجميع (Aggregation)، التعميم (Generalization).",
            "تقليل الأبعاد: اختيار الميزات (Feature Selection)، استخراج الميزات (Feature Extraction).",
            "تمارين: تطبيق تقنيات تجهيز البيانات باستخدام Python (pandas, scikit-learn)."
          ]
        },
        {
          "week": 3,
          "title": "تقنيات التصنيف - أشجار القرار:",
          "items": [
            "مفهوم التصنيف وأهميته في التنقيب عن البيانات.",
            "أشجار القرار كخوارزمية تصنيف.",
            "خوارزميات بناء أشجار القرار (ID3, C4.5, CART).",
            "مزايا وعيوب أشجار القرار.",
            "تمارين: تطبيق أشجار القرار للتصنيف باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 4,
          "title": "تقنيات التصنيف - المصنفات الاحتمالية (Naive Bayes):",
          "items": [
            "مفهوم المصنفات الاحتمالية وتصنيف بايز البسيط (Naive Bayes).",
            "افتراض الاستقلال الشرطي في تصنيف بايز البسيط.",
            "أنواع مصنفات بايز البسيطة (Gaussian Naive Bayes, Multinomial Naive Bayes, Bernoulli Naive Bayes).",
            "مزايا وعيوب مصنفات بايز البسيطة.",
            "تمارين: تطبيق مصنفات بايز البسيطة للتصنيف باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 5,
          "title": "تقنيات التصنيف - آلات الدعم المتجه (SVM):",
          "items": [
            "مفهوم آلات الدعم المتجه (Support Vector Machines - SVM) في التصنيف.",
            "المصنفات الخطية وغير الخطية لـ SVM.",
            "النواة (Kernels) في SVM (الخطي، متعدد الحدود، الشعاعي).",
            "مزايا وعيوب آلات الدعم المتجه.",
            "تمارين: تطبيق آلات الدعم المتجه للتصنيف باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 6,
          "title": "تقنيات التجميع - التجميع التقسيمي (K-Means):",
          "items": [
            "مفهوم التجميع وأهميته في التنقيب عن البيانات.",
            "التجميع التقسيمي وخوارزمية K-Means.",
            "خطوات خوارزمية K-Means وتحديد عدد المجموعات الأمثل (K).",
            "مزايا وعيوب خوارزمية K-Means.",
            "تمارين: تطبيق خوارزمية K-Means للتجميع باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 7,
          "title": "تقنيات التجميع - التجميع الهرمي:",
          "items": [
            "التجميع الهرمي وأنواعه (التجميع التراكمي، التجميع التقسيمي).",
            "مقاييس التشابه والتباعد في التجميع الهرمي.",
            "مزايا وعيوب التجميع الهرمي.",
            "تمارين: تطبيق خوارزميات التجميع الهرمي باستخدام Python (scikit-learn)."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في التنقيب عن البيانات، تجهيز البيانات، تقنيات التصنيف - أشجار القرار، مصنفات بايز البسيطة، آلات الدعم المتجه، تقنيات التجميع - K-Means والتجميع الهرمي)."
          ]
        },
        {
          "week": 9,
          "title": "تقنيات اكتشاف الارتباط - قواعد الارتباط (Association Rules):",
          "items": [
            "مفهوم قواعد الارتباط وأهميتها في التنقيب عن البيانات.",
            "قياسات قواعد الارتباط (الدعم، الثقة، الرفع).",
            "خوارزمية Apriori لاكتشاف قواعد الارتباط.",
            "مزايا وعيوب قواعد الارتباط.",
            "تمارين: تطبيق خوارزمية Apriori لاكتشاف قواعد الارتباط باستخدام Python (mlxtend أو  apyori"
          ]
        },
        {
          "week": 10,
          "title": "تقنيات اكتشاف القيم الشاذة (Outlier Detection):",
          "items": [
            "مفهوم القيم الشاذة وأنواعها.",
            "أهمية اكتشاف القيم الشاذة وتطبيقاته.",
            "تقنيات اكتشاف القيم الشاذة الإحصائية، القائمة على المسافة، القائمة على الكثافة.",
            "مزايا وعيوب تقنيات اكتشاف القيم الشاذة المختلفة.",
            "تمارين: تطبيق تقنيات اكتشاف القيم الشاذة باستخدام Python (scikit-learn, PyOD)."
          ]
        },
        {
          "week": 11,
          "title": "تقييم نماذج التنقيب عن البيانات:",
          "items": [
            "مقاييس تقييم نماذج التصنيف (الدقة، الاسترجاع، F1-score، AUC-ROC، مصفوفة الارتباك).",
            "مقاييس تقييم نماذج التجميع (Silhouette Score, Davies-Bouldin Index).",
            "مقاييس تقييم قواعد الارتباط (الدعم، الثقة، الرفع).",
            "التحقق المتقاطع (Cross-Validation) في التنقيب عن البيانات.",
            "تمارين: تقييم نماذج تنقيب عن بيانات مختلفة ومقارنة أدائها."
          ]
        },
        {
          "week": 12,
          "title": "التنقيب عن البيانات في النصوص (Text Mining):",
          "items": [
            "مقدمة في التنقيب عن البيانات في النصوص وأهميته.",
            "تقنيات المعالجة المسبقة للنصوص (Tokenization, Stop Word Removal, Stemming, Lemmatization).",
            "تمثيل النصوص (Bag of Words, TF-IDF, Word Embeddings).",
            "تطبيقات التنقيب عن البيانات في النصوص (تحليل المشاعر، تصنيف النصوص، تلخيص النصوص).",
            "تمارين: تطبيق تقنيات التنقيب عن البيانات في النصوص باستخدام Python (NLTK, spaCy, scikit-learn)."
          ]
        },
        {
          "week": 13,
          "title": "التنقيب عن البيانات في الويب (Web Mining):",
          "items": [
            "مقدمة في التنقيب عن البيانات في الويب وأنواعه (تنقيب المحتوى، تنقيب الاستخدام، تنقيب البنية).",
            "تقنيات تنقيب المحتوى (Web Crawling, Web Scraping).",
            "تحليل بيانات استخدام الويب (Web Usage Mining).",
            "تحليل بنية الويب (Web Structure Mining).",
            "تمارين: تطبيق تقنيات التنقيب عن البيانات في الويب باستخدام Python (Beautiful Soup, Scrapy)."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة في التنقيب عن البيانات (اختياري):",
          "items": [
            "التنقيب عن البيانات الضخمة (Big Data Mining).",
            "التنقيب عن البيانات المتدفقة (Stream Data Mining).",
            "التنقيب عن البيانات المكانية (Spatial Data Mining).",
            "مواضيع حديثة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في التنقيب عن البيانات:",
          "items": [
            "يقوم الطلاب بتطبيق تقنيات التنقيب عن البيانات على مجموعة بيانات حقيقية لحل مشكلة واقعية.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والتقنيات، والخوارزميات، والتطبيقات العملية للتنقيب عن البيانات."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام Python ومكتبات التنقيب عن البيانات (scikit-learn, pandas, NLTK, spaCy, mlxtend, apyori)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم التنقيب عن البيانات ومراحله.",
        "تطبيق تقنيات تجهيز البيانات والمعالجة المسبقة.",
        "تطبيق خوارزميات التصنيف، والتجميع، واكتشاف الارتباط، واكتشاف القيم الشاذة.",
        "تقييم أداء نماذج التنقيب عن البيانات واختيار النموذج الأنسب.",
        "تطبيق التنقيب عن البيانات في مجالات مختلفة (النصوص، الويب، إلخ.).",
        "تنفيذ مشاريع تنقيب عن بيانات واقعية."
      ]
    },
    {
      "title_ar": "الويب الدلالي",
      "title_en": "Semantic Web",
      "description_ar": "مقدمة في مجال الويب الدلالي، يغطي المفاهيم الأساسية والتقنيات المستخدمة لجعل الويب أكثر قابلية للقراءة والفهم من قبل الآلات. تتضمن المادة دراسة لغات تمثيل المعرفة (RDF, OWL, SKOS)، ولغات الاستعلام الدلالي (SPARQL)، وتقنيات بناء تطبيقات الويب الدلالي، والربط بين البيانات، والاستدلال الدلالي، وتطبيقات الويب الدلالي في مجالات مختلفة.",
      "description_en": "Semantic Web technologies: RDF, OWL, SPARQL, ontologies, linked data, and building semantic knowledge graphs.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في الويب الدلالي:",
          "items": [
            "مفهوم الويب الدلالي وأهميته في تطوير الويب الحالي.",
            "الفرق بين الويب الدلالي والويب التقليدي (الويب الدلالي كويب بيانات).",
            "بنية الويب الدلالي (Semantic Web Stack): URI, RDF, OWL, SPARQL, قواعد الاستدلال.",
            "فوائد الويب الدلالي وتطبيقاته في مجالات مختلفة (إدارة المعرفة، تكامل البيانات، البحث الدلالي، الذكاء الاصطناعي).",
            "تمارين: مناقشة تطبيقات الويب الدلالي، مقارنة الويب الدلالي بالويب التقليدي."
          ]
        },
        {
          "week": 2,
          "title": "لغة وصف الموارد (RDF):",
          "items": [
            "مقدمة في لغة وصف الموارد (Resource Description Framework - RDF).",
            "بنية RDF: الموضوع، المحمول، القيمة (Subject, Predicate, Object).",
            "تمثيل البيانات باستخدام RDF (الرسوم البيانية RDF).",
            "صيغ تمثيل RDF (XML, Turtle, JSON-LD).",
            "تمارين: كتابة بيانات RDF باستخدام صيغ مختلفة."
          ]
        },
        {
          "week": 3,
          "title": "مخطط RDF (RDF Schema - RDFS):",
          "items": [
            "مقدمة في مخطط RDF (RDF Schema - RDFS) ودوره في تعريف المفردات والعلاقات في RDF.",
            "فئات RDFS (rdfs:Class, rdfs:Resource, rdfs:Literal).",
            "خصائص RDFS (rdfs:domain, rdfs:range, rdfs:subClassOf, rdfs:subPropertyOf).",
            "الاستدلال الأساسي في RDFS (الاستدلال على نوع المورد، الاستدلال على نوع الخاصية).",
            "تمارين: تعريف مخططات RDFS بسيطة."
          ]
        },
        {
          "week": 4,
          "title": "لغة الويب الأنطولوجية (OWL):",
          "items": [
            "مقدمة في لغة الويب الأنطولوجية (Web Ontology Language - OWL) ودورها في بناء الأنطولوجيات الغنية.",
            "أنواع OWL (OWL Lite, OWL DL, OWL 2).",
            "مفاهيم OWL الأساسية (الفئات، الخصائص، الأفراد، القيود).",
            "الاستدلال المتقدم في OWL (الاستدلال على التكافؤ، الاستدلال على التضمين، الاستدلال على التناقض).",
            "تمارين: بناء أنطولوجيات OWL بسيطة باستخدام محرر أنطولوجيات (مثال: Protégé)."
          ]
        },
        {
          "week": 5,
          "title": "لغة الاستعلام SPARQL:",
          "items": [
            "مقدمة في لغة الاستعلام SPARQL (SPARQL Protocol and RDF Query Language).",
            "بنية استعلام SPARQL (SELECT, CONSTRUCT, ASK, DESCRIBE).",
            "أنماط المطابقة (Basic Graph Patterns, Property Paths).",
            "عوامل التصفية (Filters) والدوال (Functions) في SPARQL.",
            "تمارين: كتابة استعلامات SPARQL لاسترجاع البيانات من قواعد بيانات RDF."
          ]
        },
        {
          "week": 6,
          "title": "قواعد الاستدلال في الويب الدلالي:",
          "items": [
            "مفهوم الاستدلال الدلالي وأهميته في الويب الدلالي.",
            "أنواع الاستدلال (الاستدلال الأمامي، الاستدلال الخلفي).",
            "محركات الاستدلال (Reasoners) في الويب الدلالي (مثال: Pellet, HermiT).",
            "تطبيقات الاستدلال في التحقق من الاتساق، استنتاج المعرفة الضمنية، الإجابة على الأسئلة.",
            "تمارين: تطبيق الاستدلال باستخدام محركات استدلال مختلفة."
          ]
        },
        {
          "week": 7,
          "title": "البيانات المرتبطة (Linked Data):",
          "items": [
            "مفهوم البيانات المرتبطة ومبادئها الأربعة.",
            "نشر البيانات المرتبطة على الويب (URIs, HTTP, RDF, SPARQL).",
            "مجموعات البيانات المرتبطة الكبيرة (DBpedia, Wikidata, GeoNames).",
            "تطبيقات البيانات المرتبطة في تكامل البيانات، البحث، اكتشاف المعرفة.",
            "تمارين: استكشاف مجموعات البيانات المرتبطة، كتابة استعلامات SPARQL عبر مجموعات بيانات مرتبطة."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في الويب الدلالي، RDF, RDFS, OWL, SPARQL, قواعد الاستدلال، البيانات المرتبطة)."
          ]
        },
        {
          "week": 9,
          "title": "لغة SKOS (نظام تنظيم المعرفة البسيط):",
          "items": [
            "مقدمة في لغة SKOS (Simple Knowledge Organization System) ودورها في تمثيل أنظمة تنظيم المعرفة (التصنيفات، القواميس، قوائم الرؤوس الموضوعية).",
            "مفاهيم SKOS الأساسية (المفاهيم، الملصقات، العلاقات الدلالية).",
            "استخدام SKOS في إدارة المفردات، بناء أنظمة البحث، تحسين قابلية التشغيل البيني.",
            "تمارين: بناء أنظمة تنظيم معرفة بسيطة باستخدام SKOS."
          ]
        },
        {
          "week": 10,
          "title": "بناء تطبيقات الويب الدلالي:",
          "items": [
            "معمارية تطبيقات الويب الدلالي.",
            "أدوات وبرمجيات بناء تطبيقات الويب الدلالي (مكتبات RDF في Python, Java, JavaScript، محركات قواعد بيانات RDF).",
            "عملية تطوير تطبيقات الويب الدلالي خطوة بخطوة.",
            "أمثلة على تطبيقات الويب الدلالي (تطبيقات البحث الدلالي، تطبيقات تكامل البيانات، تطبيقات إدارة المعرفة).",
            "تمارين: بناء تطبيق ويب دلالي بسيط."
          ]
        },
        {
          "week": 11,
          "title": "الاستدلال الدلالي المتقدم:",
          "items": [
            "قواعد الاستدلال (Rule-based Reasoning) في الويب الدلالي (SWRL, RuleML).",
            "الاستدلال على أساس الوصف المنطقي (Description Logic Reasoning).",
            "التعامل مع عدم اليقين وعدم الاكتمال في البيانات الدلالية.",
            "مواضيع متقدمة في الاستدلال حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 12,
          "title": "تقييم تطبيقات الويب الدلالي:",
          "items": [
            "معايير تقييم جودة البيانات الدلالية (الاتساق، الاكتمال، الدقة، الملاءمة).",
            "طرق تقييم أداء تطبيقات الويب الدلالي (الدقة، الاسترجاع، F-measure).",
            "تحديات تقييم الويب الدلالي.",
            "تمارين: تقييم بيانات دلالية وتطبيقات ويب دلالي بسيطة."
          ]
        },
        {
          "week": 13,
          "title": "الويب الدلالي والذكاء الاصطناعي:",
          "items": [
            "العلاقة بين الويب الدلالي والذكاء الاصطناعي.",
            "استخدام الويب الدلالي في تطبيقات الذكاء الاصطناعي (تمثيل المعرفة، الاستدلال، معالجة اللغة الطبيعية، التعلم الآلي).",
            "الويب الدلالي كبنية تحتية للذكاء الاصطناعي.",
            "مواضيع حديثة في الويب الدلالي والذكاء الاصطناعي حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 14,
          "title": "تطبيقات متقدمة في الويب الدلالي (اختياري):",
          "items": [
            "الويب الدلالي في مجالات محددة (الطب، الهندسة، الأعمال، الحكومة الإلكترونية).",
            "الويب الدلالي والبيانات الضخمة.",
            "الويب الدلالي والإنترنت من الأشياء (IoT).",
            "مواضيع حديثة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في الويب الدلالي:",
          "items": [
            "يقوم الطلاب بتصميم وتطوير تطبيق ويب دلالي لمشكلة واقعية.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والتقنيات، واللغات (RDF, OWL, SPARQL, SKOS)، والاستدلال، والبيانات المرتبطة، وتطبيقات الويب الدلالي."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام أدوات الويب الدلالي (Protégé, Jena, Sesame, rdflib, SPARQL endpoints)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم الويب الدلالي وبنيته.",
        "تمثيل المعرفة باستخدام لغات الويب الدلالي (RDF, OWL, SKOS).",
        "كتابة استعلامات SPARQL فعالة لاسترجاع البيانات الدلالية.",
        "تطبيق قواعد الاستدلال لاستنتاج المعرفة الضمنية.",
        "فهم مبادئ البيانات المرتبطة ونشر البيانات المرتبطة.",
        "بناء تطبيقات ويب دلالي بسيطة.",
        "التعرف على تطبيقات الويب الدلالي في مجالات مختلفة."
      ]
    },
    {
      "title_ar": "محركات البحث والتنقيب في المواقع",
      "title_en": "Search Engines and Web Crawling",
      "description_ar": "مقدمة شاملة في مجال محركات البحث والتنقيب في المواقع، يغطي المفاهيم الأساسية والتقنيات المستخدمة لبناء محركات بحث فعالة وبرامج تنقيب في الويب. تتضمن المادة دراسة مكونات محركات البحث (الزحف، الفهرسة، الترتيب، الاستعلام)، وتقنيات الزحف في الويب (Web Crawling)، وتقنيات الفهرسة (Indexing)، وتقنيات ترتيب النتائج (Ranking Algorithms)، وتقييم محركات البحث، وتقنيات البحث المتقدمة، وتطبيقات محركات البحث في مجالات مختلفة.",
      "description_en": "Information retrieval: crawling, indexing, ranking, evaluation, and building a mini search engine.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في محركات البحث والتنقيب في المواقع:",
          "items": [
            "مفهوم محركات البحث وأهميتها في الوصول إلى المعلومات على الويب.",
            "تطور محركات البحث وأنواعها المختلفة.",
            "مكونات محرك البحث الأساسية (الزاحف، الفهرس، المرتب، المستعلم).",
            "مفهوم التنقيب في المواقع (Web Crawling) وأهميته.",
            "تطبيقات محركات البحث والتنقيب في المواقع في مجالات مختلفة (البحث العام، البحث المتخصص، تحليل الويب، مراقبة الويب).",
            "تمارين: مناقشة تطبيقات محركات البحث، مقارنة محركات البحث المختلفة."
          ]
        },
        {
          "week": 2,
          "title": "الزحف في الويب (Web Crawling) - أساسيات الزحف:",
          "items": [
            "مفهوم الزاحف (Crawler) وأنواعه (الزاحف العام، الزاحف المركز، الزاحف التزايدي).",
            "بنية الزاحف الأساسية (قائمة عناوين URL، وحدة التنزيل، وحدة التحليل، وحدة استخراج الروابط، وحدة التخزين).",
            "سياسات الزحف (سياسة الاختيار، سياسة إعادة الزيارة، سياسة الأدب، سياسة التوازي).",
            "بروتوكول robots.txt وأهميته في التحكم في سلوك الزواحف.",
            "تمارين: تصميم زاحف ويب بسيط، تحليل ملف robots.txt لمواقع مختلفة."
          ]
        },
        {
          "week": 3,
          "title": "الزحف في الويب (Web Crawling) - تقنيات متقدمة:",
          "items": [
            "الزحف العميق (Deep Web Crawling) والزحف السطحي (Surface Web Crawling).",
            "الزحف المركز (Focused Crawling) والزحف الموضوعي (Topical Crawling).",
            "التعامل مع المواقع الديناميكية (Dynamic Websites) ومواقع AJAX.",
            "تقنيات تجنب الازدحام (Politeness) وتوزيع الحمل (Load Distribution) في الزحف.",
            "تمارين: تصميم زاحف ويب مركز، استكشاف تقنيات الزحف المتقدمة."
          ]
        },
        {
          "week": 4,
          "title": "الفهرسة (Indexing) - بناء الفهرس:",
          "items": [
            "مفهوم الفهرس وأهميته في محركات البحث.",
            "أنواع الفهارس (فهرس الكلمات، فهرس المستندات، الفهرس المعكوس).",
            "عملية بناء الفهرس المعكوس (تحليل النص، إزالة الكلمات الشائعة، التجذير، الفهرسة).",
            "هياكل بيانات الفهرس المعكوس (قوائم النشر، أشجار B+).",
            "تمارين: بناء فهرس معكوس بسيط لمجموعة من المستندات."
          ]
        },
        {
          "week": 5,
          "title": "الفهرسة (Indexing) - تقنيات متقدمة:",
          "items": [
            "الفهرسة الدلالية (Semantic Indexing) والفهرسة القائمة على الأنطولوجيات.",
            "الفهرسة الموزعة (Distributed Indexing) للفهارس الكبيرة.",
            "تحديث الفهرس (Index Update) بشكل دوري وتزايدي.",
            "تقنيات ضغط الفهرس (Index Compression) لتقليل حجم الفهرس.",
            "تمارين: استكشاف تقنيات الفهرسة المتقدمة، تصميم فهرس موزع بسيط."
          ]
        },
        {
          "week": 6,
          "title": "ترتيب النتائج (Ranking Algorithms) - نماذج استرجاع المعلومات:",
          "items": [
            "مفهوم ترتيب النتائج وأهميته في محركات البحث.",
            "نماذج استرجاع المعلومات (نموذج الفضاء المتجهي، نموذج الاحتمالية، نموذج اللغة).",
            "قياسات التشابه بين الاستعلام والمستند (Cosine Similarity, TF-IDF).",
            "تقنيات تحسين ترتيب النتائج (PageRank, HITS).",
            "تمارين: تطبيق نماذج استرجاع المعلومات لترتيب المستندات بناءً على استعلام."
          ]
        },
        {
          "week": 7,
          "title": "ترتيب النتائج (Ranking Algorithms) - تقنيات متقدمة:",
          "items": [
            "التعلم للترتيب (Learning to Rank) واستخدام التعلم الآلي في ترتيب النتائج.",
            "ميزات ترتيب النتائج (ميزات المحتوى، ميزات الارتباط، ميزات المستخدم).",
            "نماذج التعلم للترتيب (Pointwise, Pairwise, Listwise).",
            "تقنيات التخصيص الشخصي للبحث (Personalized Search) وتكييف النتائج حسب المستخدم.",
            "تمارين: استكشاف تقنيات التعلم للترتيب، تصميم نظام ترتيب نتائج بسيط باستخدام التعلم الآلي."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في محركات البحث والتنقيب في المواقع، الزحف في الويب - أساسيات ومتقدمة، الفهرسة - بناء الفهرس وتقنيات متقدمة، ترتيب النتائج - نماذج استرجاع المعلومات وتقنيات متقدمة)."
          ]
        },
        {
          "week": 9,
          "title": "معالجة الاستعلام (Query Processing):",
          "items": [
            "مراحل معالجة الاستعلام في محرك البحث (تحليل الاستعلام، معالجة اللغة الطبيعية، استرجاع المستندات، ترتيب النتائج).",
            "تقنيات تحليل الاستعلام (Tokenization, Stop Word Removal, Stemming, Query Expansion).",
            "تقنيات معالجة اللغة الطبيعية في معالجة الاستعلام (تصحيح الأخطاء الإملائية، اقتراح الاستعلامات، فهم النية).",
            "تمارين: تصميم نظام معالجة استعلام بسيط، تطبيق تقنيات تحليل الاستعلام."
          ]
        },
        {
          "week": 10,
          "title": "تقييم محركات البحث:",
          "items": [
            "أهمية تقييم محركات البحث ومعايير التقييم (الدقة، الاسترجاع، F-measure، nDCG).",
            "طرق تقييم محركات البحث (التقييم اليدوي، التقييم الآلي).",
            "مجموعات البيانات القياسية لتقييم محركات البحث (TREC, CLEF).",
            "تحديات تقييم محركات البحث.",
            "تمارين: تقييم محركات بحث مختلفة باستخدام معايير ومجموعات بيانات قياسية."
          ]
        },
        {
          "week": 11,
          "title": "واجهات المستخدم لمحركات البحث وتجربة المستخدم:",
          "items": [
            "مبادئ تصميم واجهات المستخدم لمحركات البحث الفعالة.",
            "عناصر واجهة المستخدم لمحركات البحث (صندوق البحث، صفحة النتائج، خيارات التصفية والترتيب).",
            "تحسين تجربة المستخدم في محركات البحث (سرعة الاستجابة، سهولة الاستخدام، ملاءمة النتائج).",
            "تقنيات التفاعل بين الإنسان والكمبيوتر في محركات البحث (تتبع حركة العين، تتبع النقرات).",
            "تمارين: تصميم واجهة مستخدم لمحرك بحث بسيط، تحليل واجهات مستخدم لمحركات بحث موجودة."
          ]
        },
        {
          "week": 12,
          "title": "البحث الدلالي ومحركات البحث الدلالية:",
          "items": [
            "مفهوم البحث الدلالي وأهميته في تحسين دقة البحث.",
            "استخدام الويب الدلالي وتقنياته في بناء محركات البحث الدلالية.",
            "تقنيات البحث الدلالي (توسيع الاستعلام الدلالي، الفهرسة الدلالية، الترتيب الدلالي).",
            "أمثلة على محركات البحث الدلالية (Google Knowledge Graph, WolframAlpha).",
            "تمارين: استكشاف محركات البحث الدلالية، تصميم نظام بحث دلالي بسيط."
          ]
        },
        {
          "week": 13,
          "title": "محركات البحث المتخصصة والتطبيقات الخاصة:",
          "items": [
            "أنواع محركات البحث المتخصصة (محركات بحث الصور، الفيديو، الأخبار، المنتجات، الأكاديمية، الطبية، إلخ.).",
            "تحديات بناء محركات البحث المتخصصة.",
            "تطبيقات محركات البحث في مجالات خاصة (التجارة الإلكترونية، المكتبات الرقمية، التحليل الاستخباراتي، إلخ.).",
            "مواضيع حديثة في محركات البحث المتخصصة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 14,
          "title": "قضايا أخلاقية وقانونية في محركات البحث والتنقيب في المواقع:",
          "items": [
            "قضايا الخصوصية في جمع بيانات الويب واستخدامها.",
            "قضايا التحيز والتمييز في نتائج البحث.",
            "قضايا الرقابة والرقابة الذاتية في محركات البحث.",
            "قضايا حقوق الملكية الفكرية في تنقيب المحتوى المحمي بحقوق الطبع والنشر.",
            "مناقشة القضايا الأخلاقية والقانونية المتعلقة بمحركات البحث والتنقيب في المواقع."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في محركات البحث والتنقيب في المواقع:",
          "items": [
            "يقوم الطلاب بتصميم وتطوير مكون من مكونات محرك بحث أو برنامج تنقيب في المواقع (زاحف ويب، فهرس، نظام ترتيب نتائج، واجهة مستخدم).",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والتقنيات، والخوارزميات، ومكونات محركات البحث، وتقييم محركات البحث، والقضايا الأخلاقية والقانونية."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام لغات البرمجة (Python, Java, C++) وأدوات بناء محركات البحث ومكتبات الزحف والفهرسة (Nutch, Lucene, Solr, Scrapy)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة.",
      "outcomes_ar": [
        "فهم متعمق لمكونات محركات البحث وعملها.",
        "تصميم وتنفيذ زاحف ويب فعال.",
        "بناء فهرس معكوس للمستندات.",
        "تطبيق نماذج استرجاع المعلومات وخوارزميات ترتيب النتائج.",
        "تقييم أداء محركات البحث.",
        "فهم تقنيات البحث المتقدمة والبحث الدلالي.",
        "التعرف على القضايا الأخلاقية والقانونية المتعلقة بمحركات البحث والتنقيب في المواقع."
      ]
    },
    {
      "title_ar": "معمارية الحاسبات",
      "title_en": "Computer Architecture",
      "description_ar": "مقدمة شاملة في مجال معمارية الحاسبات، يغطي المفاهيم الأساسية والتصميم الداخلي للحواسيب الرقمية. تتضمن المادة دراسة تنظيم الحاسوب، ومجموعة التعليمات، وتصميم وحدة المعالجة المركزية (CPU)، والذاكرة، والإدخال والإخراج، وخطوط الأنابيب، والذاكرة المخبئية، والذاكرة الافتراضية، والمعمارية متعددة النوى، والمعمارية الموازية، وتقييم الأداء.",
      "description_en": "Computer architecture: ISA, pipelining, memory hierarchy, caches, parallelism, and performance evaluation.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في معمارية الحاسبات:",
          "items": [
            "مفهوم معمارية الحاسبات وأهميتها في فهم أداء وكفاءة الحواسيب.",
            "تطور معمارية الحاسبات عبر الأجيال.",
            "مستويات تجريد معمارية الحاسبات (مستوى العتاد الصلب، مستوى التجميع، مستوى نظام التشغيل، مستوى لغة البرمجة عالية المستوى).",
            "مكونات الحاسوب الأساسية (وحدة المعالجة المركزية، الذاكرة، الإدخال والإخراج، الناقلات).",
            "مقياس الأداء في معمارية الحاسبات (وقت التنفيذ، معدل الإنتاجية، قانون أمدال).",
            "تمارين: مناقشة تطور معمارية الحاسبات، تحديد مقاييس الأداء المناسبة لتطبيقات مختلفة."
          ]
        },
        {
          "week": 2,
          "title": "تنظيم الحاسوب ومجموعة التعليمات:",
          "items": [
            "تنظيم الحاسوب (Computer Organization) مقابل معمارية الحاسبات (Computer Architecture).",
            "وظائف مكونات الحاسوب الأساسية (وحدة المعالجة المركزية، الذاكرة، الإدخال والإخراج).",
            "مجموعة التعليمات (Instruction Set Architecture - ISA) وأنواع التعليمات (تعليمات نقل البيانات، تعليمات العمليات الحسابية والمنطقية، تعليمات التحكم، تعليمات الإدخال والإخراج).",
            "أنماط عنونة التعليمات (Addressing Modes).",
            "تمارين: تحليل مجموعة تعليمات بسيطة، كتابة برنامج تجميع بسيط."
          ]
        },
        {
          "week": 3,
          "title": "تصميم وحدة المعالجة المركزية (CPU) - المسار الأحادي الدورة:",
          "items": [
            "بنية وحدة المعالجة المركزية (CPU) ومكوناتها (وحدة التحكم، وحدة الحساب والمنطق، المسجلات).",
            "دورة التعليمات (Instruction Cycle) ومراحلها (Fetch, Decode, Execute, Memory, Write Back).",
            "تصميم وحدة معالجة مركزية بسيطة بمسار أحادي الدورة (Single-Cycle Datapath).",
            "وحدة التحكم ذات الأسلاك الصلبة (Hardwired Control Unit).",
            "تمارين: تصميم مسار أحادي الدورة لوحدة معالجة مركزية بسيطة."
          ]
        },
        {
          "week": 4,
          "title": "تصميم وحدة المعالجة المركزية (CPU) - المسار متعدد الدورات:",
          "items": [
            "عيوب المسار الأحادي الدورة (بطء الأداء).",
            "تصميم وحدة معالجة مركزية بمسار متعدد الدورات (Multi-Cycle Datapath).",
            "وحدة التحكم المصغرة (Microprogrammed Control Unit).",
            "مزايا وعيوب المسار متعدد الدورات.",
            "تمارين: تصميم مسار متعدد الدورات لوحدة معالجة مركزية بسيطة، مقارنة الأداء بين المسارين الأحادي والمتعدد الدورات."
          ]
        },
        {
          "week": 5,
          "title": "خطوط الأنابيب (Pipelining):",
          "items": [
            "مفهوم خطوط الأنابيب وأهميته في تحسين الأداء.",
            "مراحل خط الأنابيب (Fetch, Decode, Execute, Memory, Write Back).",
            "مخاطر خط الأنابيب (Data Hazards, Control Hazards, Structural Hazards).",
            "تقنيات حل مخاطر خط الأنابيب (Forwarding, Stalling, Branch Prediction).",
            "تمارين: تحليل أداء خط الأنابيب، تصميم خط أنابيب بسيط."
          ]
        },
        {
          "week": 6,
          "title": "الذاكرة - التسلسل الهرمي للذاكرة والذاكرة المخبئية (Cache Memory):",
          "items": [
            "التسلسل الهرمي للذاكرة (Memory Hierarchy) وأهميته (الذاكرة المخبئية، الذاكرة الرئيسية، الذاكرة الثانوية).",
            "مفهوم الذاكرة المخبئية (Cache Memory) وأنواعها (الذاكرة المخبئية للمعلومات، الذاكرة المخبئية للتعليمات).",
            "سياسات استبدال البيانات في الذاكرة المخبئية (LRU, FIFO, Random).",
            "أداء الذاكرة المخبئية (معدل الإصابة، معدل الخطأ، وقت الوصول المتوسط).",
            "تمارين: تحليل أداء الذاكرة المخبئية، تصميم ذاكرة مخبئية بسيطة."
          ]
        },
        {
          "week": 7,
          "title": "الذاكرة - الذاكرة الرئيسية والذاكرة الافتراضية (Virtual Memory):",
          "items": [
            "أنواع الذاكرة الرئيسية (DRAM, SRAM, ROM).",
            "تنظيم الذاكرة الرئيسية وتقنيات الوصول إليها.",
            "مفهوم الذاكرة الافتراضية (Virtual Memory) وأهميته في إدارة الذاكرة.",
            "الترجمة من العناوين الافتراضية إلى العناوين الفيزيائية (Translation Lookaside Buffer - TLB).",
            "سياسات استبدال الصفحات في الذاكرة الافتراضية (Page Replacement Policies).",
            "تمارين: تحليل أداء الذاكرة الافتراضية، تصميم نظام ذاكرة افتراضية بسيط."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في معمارية الحاسبات، تنظيم الحاسوب ومجموعة التعليمات، تصميم وحدة المعالجة المركزية - المسار الأحادي والمتعدد الدورات، خطوط الأنابيب، الذاكرة - التسلسل الهرمي والذاكرة المخبئية، الذاكرة الرئيسية والذاكرة الافتراضية)."
          ]
        },
        {
          "week": 9,
          "title": "الإدخال والإخراج (Input/Output - I/O):",
          "items": [
            "مفهوم الإدخال والإخراج وأهميته في تفاعل الحاسوب مع العالم الخارجي.",
            "وحدات الإدخال والإخراج الشائعة (لوحة المفاتيح، الفأرة، الشاشة، القرص الصلب، الشبكة).",
            "طرق نقل البيانات بين وحدة المعالجة المركزية ووحدات الإدخال والإخراج (البرمجة، المقاطعة، الوصول المباشر للذاكرة - DMA).",
            "واجهات الإدخال والإخراج (Interfaces) والمعايير (Standards) (USB, PCI, SATA).",
            "تمارين: تحليل طرق نقل البيانات، تصميم نظام إدخال وإخراج بسيط."
          ]
        },
        {
          "week": 10,
          "title": "المعمارية متعددة النوى (Multi-Core Architecture):",
          "items": [
            "مفهوم المعمارية متعددة النوى وأهميتها في تحسين الأداء في الحوسبة المتوازية.",
            "أنواع المعالجات متعددة النوى (المعالجات المتجانسة، المعالجات غير المتجانسة).",
            "نماذج البرمجة المتوازية للمعالجات متعددة النوى (الذاكرة المشتركة، تمرير الرسائل).",
            "قضايا التزامن والاتساق في المعالجات متعددة النوى.",
            "تمارين: تحليل أداء المعالجات متعددة النوى، كتابة برنامج متوازي بسيط."
          ]
        },
        {
          "week": 11,
          "title": "المعمارية الموازية (Parallel Architecture):",
          "items": [
            "مفهوم المعمارية الموازية وأنواعها (SIMD, MIMD, Vector Processors, GPU).",
            "أنظمة الذاكرة الموازية (الذاكرة المشتركة، الذاكرة الموزعة).",
            "شبكات الربط البيني (Interconnection Networks) في الأنظمة الموازية.",
            "تطبيقات المعمارية الموازية في مجالات مختلفة (الحوسبة العلمية، معالجة الصور، التعلم الآلي).",
            "تمارين: مقارنة أنواع المعمارية الموازية، استكشاف تطبيقات المعمارية الموازية."
          ]
        },
        {
          "week": 12,
          "title": "تقييم الأداء في معمارية الحاسبات:",
          "items": [
            "مقاييس الأداء المتقدمة (CPI, MIPS, FLOPS).",
            "تقنيات القياس والتحليل للأداء (Benchmarking, Profiling).",
            "تحسين الأداء عن طريق التحسينات المعمارية (خطوط الأنابيب، الذاكرة المخبئية، المعالجة الموازية).",
            "موازنة الأداء والتكلفة في تصميم معمارية الحاسبات.",
            "تمارين: قياس وتحليل أداء برنامج بسيط على معماريتين مختلفتين، اقتراح تحسينات معمارية لزيادة الأداء."
          ]
        },
        {
          "week": 13,
          "title": "معمارية الحاسبات منخفضة الطاقة (Low-Power Computer Architecture):",
          "items": [
            "أهمية معمارية الحاسبات منخفضة الطاقة في الأجهزة المحمولة وأنظمة إنترنت الأشياء.",
            "مصادر استهلاك الطاقة في الحاسوب (الطاقة الديناميكية، الطاقة الساكنة).",
            "تقنيات تصميم معمارية الحاسبات منخفضة الطاقة (تقليل تردد التشغيل والجهد، إدارة الطاقة، تقنيات الإغلاق).",
            "معمارية الحاسبات المضمنة (Embedded Computer Architecture) ومتطلبات الطاقة المنخفضة.",
            "تمارين: تحليل استهلاك الطاقة لمكونات الحاسوب المختلفة، استكشاف تقنيات تصميم معمارية الحاسبات منخفضة الطاقة."
          ]
        },
        {
          "week": 14,
          "title": "اتجاهات حديثة في معمارية الحاسبات (اختياري):",
          "items": [
            "معمارية الحاسبات القابلة لإعادة التشكيل (Reconfigurable Computing).",
            "معمارية الحاسبات العصبية (Neuromorphic Computing).",
            "معمارية الحاسبات الكمومية (Quantum Computing) (مقدمة).",
            "مواضيع حديثة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في معمارية الحاسبات:",
          "items": [
            "يقوم الطلاب بتصميم وتقييم معمارية حاسوب بسيطة لتطبيق معين أو محاكاة أداء معمارية حاسوب موجودة.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، ومكونات الحاسوب، وتصميم وحدة المعالجة المركزية، والذاكرة، وخطوط الأنابيب، والمعمارية متعددة النوى والموازية، وتقييم الأداء."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام لغات وصف العتاد (VHDL, Verilog) ومحاكيات معمارية الحاسبات (MARS, Logisim)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة.",
      "outcomes_ar": [
        "فهم متعمق لتنظيم وعمل الحاسوب الرقمي.",
        "تصميم وحدة معالجة مركزية بسيطة بمسار أحادي ومتعدد الدورات.",
        "فهم مبادئ خطوط الأنابيب والذاكرة المخبئية والذاكرة الافتراضية.",
        "التعرف على المعمارية متعددة النوى والمعمارية الموازية.",
        "تقييم أداء معمارية الحاسبات.",
        "فهم اتجاهات حديثة في معمارية الحاسبات."
      ]
    },
    {
      "title_ar": "معمارية البرمجيات",
      "title_en": "Software Architecture",
      "description_ar": "مقدمة شاملة في مجال معمارية البرمجيات، يغطي المفاهيم الأساسية والمبادئ والأنماط المعمارية المستخدمة لتصميم وتطوير أنظمة برمجية كبيرة ومعقدة. تتضمن المادة دراسة الأنماط المعمارية المختلفة (الطبقات، العميل-الخادم، الأنابيب والمرشحات، الخدمات المصغرة، إلخ.)، وجودة البرمجيات، وتوثيق المعمارية، وتقييم المعمارية، والتصميم المعماري القائم على النماذج، وتطبيقات معمارية البرمجيات في مجالات مختلفة.",
      "description_en": "Architecting software systems: patterns, quality attributes, documentation, evaluation, and architecture decision making.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في معمارية البرمجيات:",
          "items": [
            "مفهوم معمارية البرمجيات وأهميتها في تطوير الأنظمة البرمجية الناجحة.",
            "الفرق بين معمارية البرمجيات وتصميم البرمجيات.",
            "أصحاب المصلحة في معمارية البرمجيات (المطورون، المستخدمون، العملاء، أصحاب الأعمال).",
            "وجهات النظر المعمارية (Architectural Views) (المنطقية، العملية، التطويرية، الفيزيائية).",
            "جودة البرمجيات (Software Quality Attributes) وأهميتها في المعمارية (الأداء، قابلية التوسع، الأمان، الموثوقية، قابلية الصيانة، قابلية الاستخدام).",
            "تمارين: مناقشة أهمية معمارية البرمجيات، تحديد أصحاب المصلحة ووجهات النظر المعمارية لنظام برمجي بسيط."
          ]
        },
        {
          "week": 2,
          "title": "الأنماط المعمارية - النمط الطبقي (Layered Pattern):",
          "items": [
            "مفهوم النمط المعماري وأهميته في إعادة استخدام الحلول المعمارية.",
            "النمط المعماري الطبقي (Layered Architecture Pattern) ومكوناته (طبقة العرض، طبقة التطبيق، طبقة الأعمال، طبقة البيانات).",
            "مزايا وعيوب النمط الطبقي.",
            "حالات استخدام النمط الطبقي.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم النمط الطبقي، تصميم معمارية نظام بسيط باستخدام النمط الطبقي."
          ]
        },
        {
          "week": 3,
          "title": "الأنماط المعمارية - نمط العميل-الخادم (Client-Server Pattern):",
          "items": [
            "النمط المعماري العميل-الخادم (Client-Server Architecture Pattern) ومكوناته (العميل، الخادم، الشبكة).",
            "أنواع أنظمة العميل-الخادم (نظام العميل-الخادم ذو الطبقة الواحدة، نظام العميل-الخادم ذو الطبقتين، نظام العميل-الخادم ذو الثلاث طبقات، نظام العميل-الخادم متعدد الطبقات).",
            "مزايا وعيوب نمط العميل-الخادم.",
            "حالات استخدام نمط العميل-الخادم.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم نمط العميل-الخادم، تصميم معمارية نظام بسيط باستخدام نمط العميل-الخادم."
          ]
        },
        {
          "week": 4,
          "title": "الأنماط المعمارية - نمط الأنابيب والمرشحات (Pipes and Filters Pattern):",
          "items": [
            "النمط المعماري الأنابيب والمرشحات (Pipes and Filters Architecture Pattern) ومكوناته (المرشحات، الأنابيب).",
            "خصائص نمط الأنابيب والمرشحات (الاستقلالية، إعادة الاستخدام، التوازي).",
            "مزايا وعيوب نمط الأنابيب والمرشحات.",
            "حالات استخدام نمط الأنابيب والمرشحات.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم نمط الأنابيب والمرشحات، تصميم معمارية نظام بسيط باستخدام نمط الأنابيب والمرشحات."
          ]
        },
        {
          "week": 5,
          "title": "الأنماط المعمارية - نمط الوسيط (Broker Pattern):",
          "items": [
            "النمط المعماري الوسيط (Broker Architecture Pattern) ومكوناته (العملاء، الوسطاء، الخوادم).",
            "دور الوسيط في إدارة الاتصالات وتوجيه الطلبات بين المكونات.",
            "مزايا وعيوب نمط الوسيط.",
            "حالات استخدام نمط الوسيط.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم نمط الوسيط، تصميم معمارية نظام بسيط باستخدام نمط الوسيط."
          ]
        },
        {
          "week": 6,
          "title": "الأنماط المعمارية - نمط اللوحة السوداء (Blackboard Pattern):",
          "items": [
            "النمط المعماري اللوحة السوداء (Blackboard Architecture Pattern) ومكوناته (مصادر المعرفة، اللوحة السوداء، وحدة التحكم).",
            "دور اللوحة السوداء في تبادل المعرفة بين مصادر المعرفة.",
            "مزايا وعيوب نمط اللوحة السوداء.",
            "حالات استخدام نمط اللوحة السوداء.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم نمط اللوحة السوداء، تصميم معمارية نظام بسيط باستخدام نمط اللوحة السوداء."
          ]
        },
        {
          "week": 7,
          "title": "الأنماط المعمارية - نمط الخدمات المصغرة (Microservices Pattern):",
          "items": [
            "النمط المعماري الخدمات المصغرة (Microservices Architecture Pattern) ومكوناته (الخدمات المصغرة، واجهات برمجة التطبيقات، البنية التحتية).",
            "خصائص الخدمات المصغرة (الاستقلالية، قابلية التوسع، المرونة، التوزيعية).",
            "مزايا وعيوب نمط الخدمات المصغرة.",
            "حالات استخدام نمط الخدمات المصغرة.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم نمط الخدمات المصغرة، تصميم معمارية نظام بسيط باستخدام نمط الخدمات المصغرة."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في معمارية البرمجيات، الأنماط المعمارية - النمط الطبقي، العميل-الخادم، الأنابيب والمرشحات، الوسيط، اللوحة السوداء، الخدمات المصغرة)."
          ]
        },
        {
          "week": 9,
          "title": "توثيق المعمارية (Architecture Documentation):",
          "items": [
            "أهمية توثيق المعمارية في التواصل بين أصحاب المصلحة وفهم النظام.",
            "أنواع وثائق المعمارية (وثائق وجهات النظر، وثائق القرارات المعمارية، وثائق الواجهات).",
            "نماذج توثيق المعمارية (4+1 View Model, C4 Model).",
            "أدوات توثيق المعمارية.",
            "تمارين: توثيق معمارية نظام برمجي بسيط باستخدام نموذج توثيق معماري."
          ]
        },
        {
          "week": 10,
          "title": "تقييم المعمارية (Architecture Evaluation):",
          "items": [
            "أهمية تقييم المعمارية في الكشف عن المشاكل المحتملة وتحسين الجودة.",
            "طرق تقييم المعمارية (سيناريوهات الجودة، قوائم الفحص، طرق السيناريو، طرق القياس).",
            "معايير تقييم المعمارية (قابلية التوسع، الأداء، الأمان، الموثوقية، قابلية الصيانة، قابلية الاستخدام).",
            "تمارين: تقييم معمارية نظام برمجي بسيط باستخدام طريقة تقييم معمارية."
          ]
        },
        {
          "week": 11,
          "title": "التصميم المعماري القائم على النماذج (Model-Driven Architecture - MDA):",
          "items": [
            "مفهوم التصميم المعماري القائم على النماذج (MDA) وأهميته في أتمتة عملية التطوير.",
            "مستويات النماذج في MDA (نموذج الحساب، نموذج المنصة المستقلة، نموذج المنصة المحددة).",
            "عملية التحويل بين النماذج في MDA.",
            "أدوات MDA.",
            "تمارين: تصميم نظام برمجي بسيط باستخدام MDA."
          ]
        },
        {
          "week": 12,
          "title": "الأنماط التصميمية (Design Patterns) وعلاقتها بالمعمارية:",
          "items": [
            "مفهوم الأنماط التصميمية وأهميتها في إعادة استخدام حلول التصميم.",
            "أنواع الأنماط التصميمية (الإنشائية، السلوكية، الهيكلية).",
            "العلاقة بين الأنماط التصميمية والأنماط المعمارية (الأنماط التصميمية كتفاصيل تنفيذية للأنماط المعمارية).",
            "أمثلة على الأنماط التصميمية الشائعة (Singleton, Factory, Observer, Strategy).",
            "تمارين: تطبيق أنماط تصميمية في تصميم نظام برمجي بسيط."
          ]
        },
        {
          "week": 13,
          "title": "معمارية البرمجيات الموجهة بالخدمات (Service-Oriented Architecture - SOA):",
          "items": [
            "مفهوم معمارية البرمجيات الموجهة بالخدمات (SOA) وأهميتها في بناء أنظمة موزعة قابلة للتشغيل البيني.",
            "مكونات SOA (الخدمات، موفر الخدمة، مستهلك الخدمة، سجل الخدمات، ناقل خدمة المؤسسة - ESB).",
            "معايير وتقنيات SOA (SOAP, WSDL, UDDI, REST).",
            "مزايا وعيوب SOA.",
            "تمارين: تحليل أمثلة لأنظمة برمجية تستخدم SOA، تصميم معمارية نظام بسيط باستخدام SOA."
          ]
        },
        {
          "week": 14,
          "title": "اتجاهات حديثة في معمارية البرمجيات (اختياري):",
          "items": [
            "المعمارية القائمة على الأحداث (Event-Driven Architecture).",
            "المعمارية غير الخادمية (Serverless Architecture).",
            "معمارية الحاويات (Container Architecture).",
            "مواضيع حديثة حسب اهتمام الطلاب والوقت المتاح."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في معمارية البرمجيات:",
          "items": [
            "يقوم الطلاب بتصميم معمارية نظام برمجي لمشكلة واقعية، مع توثيق المعمارية وتقييمها.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، والأنماط المعمارية، وجودة البرمجيات، والتوثيق، والتقييم، والتصميم المعماري القائم على النماذج."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية في تصميم المعمارية وتوثيقها وتقييمها، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، قراءات من الأدبيات العلمية في مجال معمارية البرمجيات.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم معمارية البرمجيات وأهميتها.",
        "التعرف على الأنماط المعمارية المختلفة وتطبيقها في تصميم الأنظمة.",
        "تحديد وتقييم جودة البرمجيات في المعمارية.",
        "توثيق وتقييم معمارية نظام برمجي.",
        "فهم التصميم المعماري القائم على النماذج.",
        "التعرف على اتجاهات حديثة في معمارية البرمجيات."
      ]
    },
    {
      "title_ar": "هياكل البيانات",
      "title_en": "Data Structures",
      "description_ar": "مقدمة شاملة في مجال هياكل البيانات، يغطي المفاهيم الأساسية وأنواع هياكل البيانات المختلفة وكيفية استخدامها لتنظيم وتخزين البيانات بكفاءة. تتضمن المادة دراسة هياكل البيانات الخطية (المصفوفات، القوائم المرتبطة، المكدسات، الطوابير)، وهياكل البيانات غير الخطية (الأشجار، الرسوم البيانية)، وخوارزميات البحث والترتيب، وتحليل التعقيد الزمني والمكاني للخوارزميات وهياكل البيانات، وتطبيقات هياكل البيانات في حل مشاكل برمجية مختلفة.",
      "description_en": "Core data structures & algorithms: lists, stacks, queues, trees, graphs, sorting/searching, and complexity analysis.",
      "outline_ar": [
        {
          "week": 1,
          "title": "مقدمة في هياكل البيانات والخوارزميات:",
          "items": [
            "مفهوم هياكل البيانات وأهميتها في تنظيم وتخزين البيانات بكفاءة.",
            "مفهوم الخوارزمية وأهميتها في حل المشكلات البرمجية.",
            "أنواع هياكل البيانات (الخطية، غير الخطية).",
            "أنواع الخوارزميات (البحث، الترتيب، الفرز، التجميع، إلخ.).",
            "تحليل التعقيد الزمني والمكاني للخوارزميات وهياكل البيانات (Big O Notation).",
            "تمارين: مناقشة أهمية هياكل البيانات والخوارزميات، تحليل التعقيد الزمني لخوارزميات بسيطة."
          ]
        },
        {
          "week": 2,
          "title": "المصفوفات (Arrays):",
          "items": [
            "مفهوم المصفوفة كهيكل بيانات خطي.",
            "تمثيل المصفوفات في الذاكرة (مصفوفات أحادية وثنائية الأبعاد).",
            "العمليات الأساسية على المصفوفات (الإضافة، الحذف، البحث، التحديث).",
            "مزايا وعيوب المصفوفات.",
            "تطبيقات المصفوفات.",
            "تمارين: تنفيذ عمليات المصفوفات باستخدام لغة برمجة (C++, Java, Python)."
          ]
        },
        {
          "week": 3,
          "title": "القوائم المرتبطة (Linked Lists):",
          "items": [
            "مفهوم القائمة المرتبطة كهيكل بيانات خطي ديناميكي.",
            "أنواع القوائم المرتبطة (قائمة مرتبطة مفردة، قائمة مرتبطة مزدوجة، قائمة مرتبطة دائرية).",
            "تمثيل القوائم المرتبطة في الذاكرة (العقد، المؤشرات).",
            "العمليات الأساسية على القوائم المرتبطة (الإضافة، الحذف، البحث، التحديث).",
            "مزايا وعيوب القوائم المرتبطة مقارنة بالمصفوفات.",
            "تطبيقات القوائم المرتبطة.",
            "تمارين: تنفيذ عمليات القوائم المرتبطة باستخدام لغة برمجة (C++, Java, Python)."
          ]
        },
        {
          "week": 4,
          "title": "المكدسات (Stacks):",
          "items": [
            "مفهوم المكدس كهيكل بيانات خطي يتبع مبدأ LIFO (Last-In, First-Out).",
            "العمليات الأساسية على المكدسات (Push, Pop, Peek, IsEmpty, IsFull).",
            "تمثيل المكدسات باستخدام المصفوفات والقوائم المرتبطة.",
            "تطبيقات المكدسات (تقييم التعابير الرياضية، تتبع المسار، التراجع، تحويل الأرقام).",
            "تمارين: تنفيذ عمليات المكدسات باستخدام لغة برمجة (C++, Java, Python)، تطبيق المكدسات في حل مشاكل بسيطة."
          ]
        },
        {
          "week": 5,
          "title": "الطوابير (Queues):",
          "items": [
            "مفهوم الطابور كهيكل بيانات خطي يتبع مبدأ FIFO (First-In, First-Out).",
            "أنواع الطوابير (طابور بسيط، طابور دائري، طابور ذو أولوية، طابور مزدوج الطرف).",
            "العمليات الأساسية على الطوابير (Enqueue, Dequeue, Peek, IsEmpty, IsFull).",
            "تمثيل الطوابير باستخدام المصفوفات والقوائم المرتبطة.",
            "تطبيقات الطوابير (جدولة العمليات، إدارة طلبات الطباعة، محاكاة الأنظمة).",
            "تمارين: تنفيذ عمليات الطوابير باستخدام لغة برمجة (C++, Java, Python)، تطبيق الطوابير في حل مشاكل بسيطة."
          ]
        },
        {
          "week": 6,
          "title": "الأشجار (Trees) - الأشجار الثنائية:",
          "items": [
            "مفهوم الشجرة كهيكل بيانات غير خطي هرمي.",
            "المصطلحات الأساسية في الأشجار (الجذر، العقدة الأب، العقدة الابن، العقدة الورقية، العمق، الارتفاع).",
            "الأشجار الثنائية (Binary Trees) وأنواعها (شجرة ثنائية كاملة، شجرة ثنائية متوازنة، شجرة بحث ثنائية).",
            "تمثيل الأشجار الثنائية في الذاكرة (المؤشرات، المصفوفات).",
            "عمليات اجتياز الأشجار الثنائية (Preorder, Inorder, Postorder, Level Order).",
            "تمارين: تنفيذ عمليات الأشجار الثنائية باستخدام لغة برمجة (C++, Java, Python)، تطبيق الأشجار الثنائية في حل مشاكل بسيطة."
          ]
        },
        {
          "week": 7,
          "title": "الأشجار (Trees) - أشجار البحث الثنائية (Binary Search Trees - BST):",
          "items": [
            "مفهوم أشجار البحث الثنائية وخصائصها.",
            "العمليات الأساسية على أشجار البحث الثنائية (الإدراج، الحذف، البحث، البحث عن الحد الأدنى والحد الأقصى).",
            "تحليل أداء عمليات أشجار البحث الثنائية.",
            "تطبيقات أشجار البحث الثنائية (فهرسة البيانات، القواميس، الخرائط).",
            "تمارين: تنفيذ عمليات أشجار البحث الثنائية باستخدام لغة برمجة (C++, Java, Python)، تطبيق أشجار البحث الثنائية في حل مشاكل بسيطة."
          ]
        },
        {
          "week": 8,
          "title": "الامتحان النصفي الأول:",
          "items": [
            "يغطي محتوى الأسابيع 1-7 (مقدمة في هياكل البيانات والخوارزميات، المصفوفات، القوائم المرتبطة، المكدسات، الطوابير، الأشجار - الأشجار الثنائية وأشجار البحث الثنائية)."
          ]
        },
        {
          "week": 9,
          "title": "الأشجار (Trees) - أشجار متوازنة (Balanced Trees) - أشجار AVL وأشجار أحمر-أسود:",
          "items": [
            "مشكلة عدم التوازن في أشجار البحث الثنائية وتأثيرها على الأداء.",
            "الأشجار المتوازنة (Balanced Trees) وأهميتها في ضمان الأداء الأمثل.",
            "أشجار AVL (AVL Trees) وخوارزميات الموازنة (الدوران).",
            "أشجار أحمر-أسود (Red-Black Trees) وخواصها.",
            "مقارنة بين أشجار AVL وأشجار أحمر-أسود.",
            "تمارين: استكشاف أشجار AVL وأشجار أحمر-أسود، مقارنة أدائها بأشجار البحث الثنائية غير المتوازنة."
          ]
        },
        {
          "week": 10,
          "title": "الرسوم البيانية (Graphs) - التمثيل والاجتياز:",
          "items": [
            "مفهوم الرسم البياني (Graph) كهيكل بيانات غير خطي يمثل العلاقات بين الكائنات.",
            "المصطلحات الأساسية في الرسوم البيانية (الرؤوس، الحواف، الرسوم البيانية الموجهة وغير الموجهة، الرسوم البيانية الموزونة وغير الموزونة).",
            "طرق تمثيل الرسوم البيانية في الذاكرة (مصفوفة التجاور، قائمة التجاور).",
            "خوارزميات اجتياز الرسوم البيانية (بحث العمق أولاً - DFS، بحث العرض أولاً - BFS).",
            "تمارين: تمثيل رسوم بيانية باستخدام المصفوفات والقوائم، تنفيذ خوارزميات اجتياز الرسوم البيانية باستخدام لغة برمجة (C++, Java, Python)."
          ]
        },
        {
          "week": 11,
          "title": "الرسوم البيانية (Graphs) - خوارزميات المسار الأقصر:",
          "items": [
            "مشكلة المسار الأقصر في الرسوم البيانية وتطبيقاتها.",
            "خوارزمية Dijkstra للمسار الأقصر في الرسوم البيانية الموزونة ذات الأوزان غير السالبة.",
            "خوارزمية Bellman-Ford للمسار الأقصر في الرسوم البيانية الموزونة ذات الأوزان السالبة.",
            "خوارزمية Floyd-Warshall لجميع الأزواج من المسارات الأقصر.",
            "تمارين: تطبيق خوارزميات المسار الأقصر باستخدام لغة برمجة (C++, Java, Python)، تطبيق خوارزميات المسار الأقصر في حل مشاكل واقعية."
          ]
        },
        {
          "week": 12,
          "title": "خوارزميات الترتيب (Sorting Algorithms):",
          "items": [
            "مفهوم الترتيب وأهميته في معالجة البيانات.",
            "خوارزميات الترتيب الأساسية (الترتيب بالإدراج، الترتيب بالاختيار، الترتيب الفقاعي).",
            "خوارزميات الترتيب المتقدمة (الترتيب السريع، الترتيب بالدمج، الترتيب الكومي).",
            "مقارنة بين خوارزميات الترتيب المختلفة من حيث التعقيد الزمني والمكاني والأداء.",
            "تمارين: تنفيذ خوارزميات الترتيب المختلفة باستخدام لغة برمجة (C++, Java, Python)، مقارنة أداء خوارزميات الترتيب على مجموعات بيانات مختلفة."
          ]
        },
        {
          "week": 13,
          "title": "خوارزميات البحث (Searching Algorithms):",
          "items": [
            "مفهوم البحث وأهميته في استرجاع البيانات.",
            "خوارزميات البحث الأساسية (البحث الخطي، البحث الثنائي).",
            "خوارزميات البحث المتقدمة (البحث بالقفز، البحث بالاستيفاء).",
            "مقارنة بين خوارزميات البحث المختلفة من حيث التعقيد الزمني والمكاني والأداء.",
            "تمارين: تنفيذ خوارزميات البحث المختلفة باستخدام لغة برمجة (C++, Java, Python)، مقارنة أداء خوارزميات البحث على مجموعات بيانات مختلفة."
          ]
        },
        {
          "week": 14,
          "title": "جداول التجزئة (Hash Tables):",
          "items": [
            "مفهوم جداول التجزئة كهيكل بيانات فعال للبحث والإدراج والحذف في المتوسط الزمني الثابت.",
            "وظيفة التجزئة (Hash Function) وخصائصها.",
            "معالجة التصادمات (Collision Handling) في جداول التجزئة (الفصل المتسلسل، العنونة المفتوحة).",
            "تحليل أداء جداول التجزئة (عامل التحميل، متوسط طول السلسلة).",
            "تطبيقات جداول التجزئة (القواميس، الخرائط، الذاكرة المخبئية).",
            "تمارين: تنفيذ جداول التجزئة باستخدام لغة برمجة (C++, Java, Python)، تطبيق جداول التجزئة في حل مشاكل بسيطة."
          ]
        },
        {
          "week": 15,
          "title": "مشروع عملي في هياكل البيانات والخوارزميات:",
          "items": [
            "يقوم الطلاب بتطبيق هياكل البيانات والخوارزميات لحل مشكلة برمجية معقدة أو تطوير مكتبة هياكل بيانات مخصصة.",
            "يمكن أن يكون المشروع فرديًا أو جماعيًا.",
            "عرض المشاريع ومناقشتها."
          ]
        },
        {
          "week": 16,
          "title": "الامتحان النهائي:",
          "items": [
            "امتحان شامل يغطي جميع مواد المادة (الأسابيع 1-15)، مع التركيز على المفاهيم الأساسية، وأنواع هياكل البيانات، والخوارزميات (البحث، الترتيب، الرسوم البيانية)، وتحليل التعقيد، وتطبيقات هياكل البيانات."
          ]
        }
      ],
      "teaching_methods_ar": "محاضرات نظرية، تمارين عملية مكثفة باستخدام لغات البرمجة (C++, Java, Python) ومنصات التطوير المتكاملة (IDEs)، مشاريع تطبيقية، مناقشات جماعية، دراسات حالة، مسابقات برمجية.",
      "outcomes_ar": [
        "فهم متعمق لمفاهيم هياكل البيانات والخوارزميات وأهميتها.",
        "التعرف على أنواع هياكل البيانات الخطية وغير الخطية وتطبيقها.",
        "تطبيق خوارزميات البحث والترتيب والرسوم البيانية.",
        "تحليل التعقيد الزمني والمكاني للخوارزميات وهياكل البيانات.",
        "اختيار هيكل البيانات والخوارزمية المناسبة لحل مشكلة برمجية معينة.",
        "تنفيذ هياكل البيانات والخوارزميات باستخدام لغة برمجة.",
        "تطوير تطبيقات برمجية تستخدم هياكل البيانات والخوارزميات بكفاءة."
      ]
    }
  ]
}